{
    "ISHA": {
        "intro": "“If all the Upanishads and all the other scriptures happened all of a sudden\nto be reduced to ashes, and if only the first verse in the Ishopanishad were\nleft in the memory of the Hindus, Hinduism would live forever.”\nWith these words Mahatma Gandhi paid tribute to the remarkable\nUpanishad that traditionally stands at the beginning of most Indian\ncollections. It owes this priority to the poetic grandeur and sustained\nprofundity of its language, which in only eighteen verses establish the\nfundamental building blocks of spiritual awareness.\nWhat Gandhi had in mind with his great tribute he made clear in his reply\nto a journalist who wanted the secret of his life in three words: “Renounce\nand enjoy!” (tena tyaktena bhunjitah), from the first verse of the Isha.\nThe fifth-century Greek writer we know as Dionysius the Areopagite\nonce said that as he grew older and wiser his books got shorter and shorter.\nHe would have envied the sage of this Upanishad. In its intensity he does\nnot mince words. The central section, verses 9–14, is what scholars call a\n“crux,” or famously difficult passage. The translation brings out its practical\nsignificance: materialism leads us to lose awareness of our inner life, which\nis bad enough; but to be hypnotized by our own feelings and sensations and\nforget about others and the world around us is worse. By living in\nawareness of both these worlds, we can rise above them toward the one\nReality. With the last four verses we emerge onto that lofty plane, and the\nUpanishad takes on a tone of intense devotion that is rare even in later,\nGod-centered mystical literature.\nEach Upanishad comes with an invocation drawn from a traditional set.\nThe invocation to the Isha is especially striking. Consistent with the\ncondensed meaning of the Upanishad itself, it rings changes on a simple\nhousehold word, “full” (purnam): in the inexhaustible Reality, the infinite\n\fof “that” world, the unseen, sends forth “this” world of infinite variety in\nwhich we live, without ever being diminished. The American poet Anne\nSexton may have been thinking of this haunting invocation when she wrote:\nThen the well spoke to me.\nIt said: Abundance is scooped from abundance\nyet abundance remains.\nThis is a very Gandhian idea. Materialism reinforces a “paradigm of\nscarcity”: there is not enough to go around, so we are doomed to fight one\nanother for ever-diminishing resources. Spiritual economics begins not\nfrom the assumed scarcity of matter but from the verifiable infinitude of\nconsciousness. “Think of this One original source,” Plotinus said, “as a\nspring, self-generating, feeding all of itself to the rivers and yet not used up\nby them, ever at rest.” Or, as Gandhi put it, “There is enough in the world\nfor everyone’s need; there is not enough for everyone’s greed.” The\nappearance of scarcity overcomes those for whom, as the Upanishad says,\n“the world without alone is real.” There is no scarcity of love, respect,\nmeaning – the resources of consciousness. Such is the timeless wisdom of\nthe Upanishads. –M.N.",
        "1": "The Lord is enshrined in the hearts of all.\nThe Lord is the supreme Reality.\nRejoice in him through renunciation.\nCovet nothing. All belongs to the Lord.",
        "2": "Thus working may you live a hundred years.\nThus alone will you work in real freedom.",
        "3": "Those who deny the Self are born again\nBlind to the Self, enveloped in darkness,\nUtterly devoid of love for the Lord.",
        "4": "The Self is one. Ever still, the Self is\nSwifter than thought, swifter than the senses.\nThough motionless, he outruns all pursuit.\nWithout the Self, never could life exist.",
        "5": "The Self seems to move, but is ever still.\nHe seems far away, but is ever near.\nHe is within all, and he transcends all.",
        "6": "Those who see all creatures in themselves\nAnd themselves in all creatures know no fear.",
        "7": "Those who see all creatures in themselves\nAnd themselves in all creatures know no grief.\nHow can the multiplicity of life\nDelude the one who sees its unity?",
        "8": "The Self is everywhere. Bright is the Self,\nIndivisible, untouched by sin, wise,\nImmanent and transcendent. He it is\nWho holds the cosmos together.",
        "9": "In dark night live those for whom\nThe world without alone is real; in night\nDarker still, for whom the world within\nAlone is real. The first leads to a life\nOf action, the second to a life of meditation.\nBut those who combine action with meditation\nCross the sea of death through action\nAnd enter into immortality\nThrough the practice of meditation.\nSo have we heard from the wise.",
        "12": "In dark night live those for whom the Lord\nIs transcendent only; in night darker still,\nFor whom he is immanent only.\nBut those for whom he is transcendent\nAnd immanent cross the sea of death\nWith the immanent and enter into\nImmortality with the transcendent.\nSo have we heard from the wise.",
        "15": "The face of truth is hidden by your orb\nOf gold, O sun. May you remove your orb\nSo that I, who adore the true, may see\nThe glory of truth.",
        "16": "O nourishing sun,\nSolitary traveler, controller,\nSource of life for all creatures, spread your light\nAnd subdue your dazzling splendor\nSo that I may see your blessed Self.\nEven that very Self am I!",
        "17": "\fMay my life merge in the Immortal\nWhen my body is reduced to ashes.\nO mind, meditate on the eternal Brahman.\nRemember the deeds of the past.\nRemember, O mind, remember.",
        "18": "O god of fire, lead us by the good path\nTo eternal joy. You know all our deeds.\nDeliver us from evil, we who bow\nAnd pray again and again."
    },
    "KATHA": {
        "intro": "If there is one Upanishad that can be called a favorite in all ages, it is the\nKatha. It is not hard to see why. Its theme, broadly, is the same as that of all\nthe Upanishads: the deathless Self, the need for and the way to its\nrealization; but the Katha is more successful than other Upanishads at\ndescribing this, in several ways.\nAs the Upanishads illustrate, the right questions are half the battle in life.\nIn the Katha we have the right question in highly dramatic form; in fact we\nhave a highly imaginative confrontation of the ideal teacher (I.1.22) and the\nideal student (II.1.4), and their identity is surprising: the latter is a teenager,\nand his teacher is death.\nWe must consider why.\nNothing places the question “Who am I?” in such stark relief as the fact\nof death. What dies? What is left? Are we here merely to be torn away from\neveryone, and everyone from us? And what, if anything, can we do about\ndeath – now, while we are still alive?\nMost social life seems a conspiracy to discourage us from thinking of\nthese questions. But there is a rare type for whom death is present every\nmoment, putting his grim question mark to every aspect of life, and that\nperson cannot rest without some answers. It can happen to anyone: in the\n“fall of a sparrow,” a dead animal on the freeway, news reports of some\nfaraway natural disaster, the passing of an old friend, or a new one; in some\nchance reminder of the violence that is not far from any of us, in all these\nthat unwelcome Presence can make itself briefly but urgently known.\nNachiketa represents that rare type of awakened person in whom this\npresence, once glimpsed, can never go away. “Now that I have seen your\nface,” he says to Death, “what can I enjoy?” Yet, rare as he is, he represents\n\fthe capacity latent in all of us to face that grim awareness and use it as a\ndrive to deepening consciousness.\nIn other Upanishads and throughout Indian literature allegory is a\nfavorite device, but rarely is it more dynamic and successful than in the\nKatha. The opening narrative is an extended allegory which keeps spiritual\ndepth and dramatic vividness in high suspense: the story never becomes\nunreal and its archetypal significance never becomes invisible; neither is\nmere vehicle or signifier for the other. Every detail has both immediate and\ntranscendent reality (in some cases making translation unusually\ninadequate). Nachiketa, who has more personality than most Upanishadic\nfigures, asks, as an abstraction could not, “What is death going to do with\nme, today?” But at the same time he immediately universalizes his\ncondition, which is in fact the most universal of human destinies: “I shall go\nto death, at the head of many more to follow. . . .” That Nachiketa is\nconsigned to death by his own father cries out for allegorical interpretation,\nand it is not hard to supply. As Julian of Norwich, a fourteenth-century\nEnglish anchoress and mystic, wrote, “We wot that our parents do but bear\nus into death. A strange thing, that.” Birth is but the beginning of a\ntrajectory to death; for all their love, parents cannot halt it and in a sense\nhave “given us to death” merely by giving us birth.\nAs for the student, we can only pause in admiration of this ancient\ncivilization whose hero is a teenager who has not learned the rudimentary\ngrace of civilized existence – to hold his peace in the presence of hypocrisy.\nNachiketa is an attractive character who cannot go along with sham; but he\nis not an obstreperous rebel: he is more sincere about convention than his\nfather (including the convention of obedience to a father even when the\nlatter has lost his temper) and his first wish is for reconciliation with him.\nAt no time does he lack respect. But that is just the point; he forces the issue\nby taking the demands of religion seriously when the majority have long\nsince allowed external observance to paper it over, making of it a dead letter\nthat no longer communicates anything about personal struggle. But by\npoking holes in society’s shroud of complacency he represents, again, what\nit would take to awaken any and all of us. The text sums it up in the single\ntrait it tells us about the lad. He has shraddha: determined seriousness, a\ndeep, abiding, confident faith.\nIn structure and content, the Katha is more of an organic whole than any\nbut the briefest Upanishads. It begins with a prose narrative of the “once\n\fupon a time” variety, sounding very much like its source story in the\nBrahmanas, but it quickly enters a gripping dramatic situation with the\ncharacters’ speeches in verse.\nThen follows the encounter of Nachiketa with Death, and its dramatic\nreversal when he passes Death’s severe test and changes him from gruff and\noff-putting deity to delighted teacher. Though this interpersonal drama falls\ninto the background during the subsequent teaching, it comes back as it\nwere triumphantly at the end of the Upanishad, along with several key\nwords and the major themes of the question for which Nachiketa had gone\nto the king of death to find some answer.\nThe Katha consistently lays stress on several practical themes of the\nspiritual life: that a spiritual teacher is essential; that in all human\nexperience it is really only the Self, pure consciousness, that is the enjoyer,\nso that when one realizes the Self “there is nothing else to be known” and\n“all the knots that strangle the heart are loosened”; and of course that death\noccurs only to that part of us which was born and launched into separate\nexistence. This Upanishad thus speaks to a longing which could not be\ndeeper or more universal: that some day, somehow, as Donne put it, “Death\nshall be no more: Death, thou shalt die!”\nThe Katha is also distinctive in explaining with the use of two very\npractical terms that every moment we live, even theoretically while we\nsleep, we face a steep choice between what will move us closer to that day\nand what will only postpone it – that is, between what is good and what is\nmerely pleasant; in Sanskrit, between shreya and preya. While there are no\ndualities and no compartments in reality, as long as there are dualities and\ncompartments in personality, we have to pay careful attention to this\ndistinction at every moment. But that makes life very much worth living;\nand perhaps in this sense, as Wallace Stevens wrote in “Sunday Morning”:\nDeath is the mother of beauty; hence from her,\nAlone, shall come fulfillment to our dreams\nAnd our desires.\n–M.N.",
        "1": {
            "1": {
                "1": "Once, long ago, Vajasravasa gave away his possessions to gain religious merit. He had a son named Nachiketa who,",
                "2": "though only a boy, was full of faith in the scriptures. Nachiketa thought when the offerings were made:",
                "3": "“What merit can one obtain by giving away cows that are too old to give milk?”",
                "4": "To help his father understand this, Nachiketa said: “To whom will you offer me?” He asked this again and again. “To death I give you!” said his father in anger.",
                "5": "The son thought: “I go, the first of many who will die, in the midst of many who are dying, on a mission to Yama, king of death.",
                "6": "See how it was with those who came before, How it will be with those who are living. Like corn mortals ripen and fall; like corn They come up again.”",
                "7": "Nachiketa went to Yama’s abode, but the king of death was not there. He waited three days. When Yama returned, he heard a voice say: “When a spiritual guest enters the house, Like a bright flame, he must be received well, With water to wash his feet.",
                "8": "Far from wise \fAre those who are not hospitable To such a guest. They will lose all their hopes, The religious merit they have acquired, Their sons and their cattle.”",
                "9": "O spiritual guest, I grant you three boons To atone for the three inhospitable nights You have spent in my abode. Ask for three boons, one for each night.",
                "10": "NACHIKETA O king of death, as the first of these boons Grant that my father’s anger be appeased, So he may recognize me when I return And receive me with love.",
                "11": "YAMA I grant that your father, the son of Uddalaka and Aruna, Will love you as in the past. When he sees you Released from the jaws of death, he will sleep Again with a mind at peace.",
                "12": "NACHIKETA There is no fear at all in heaven; for you Are not there, neither old age nor death. Passing beyond hunger and thirst and pain, All rejoice in the kingdom of heaven.",
                "13": "You know the fire sacrifice that leads to heaven, O king of death. I have full faith In you and ask for instruction. Let this Be your second boon to me.",
                "14": "Yes, I do know, Nachiketa, and shall \fTeach you the fire sacrifice that leads To heaven and sustains the world, that knowledge Concealed in the heart. Now listen.",
                "15": "Then the king of death taught Nachiketa how to perform the fire sacrifice, how to erect the altar for worshipping the fire from which the universe evolves. When the boy repeated his instruction, the dread king of death was well pleased and said:",
                "16": "Let me give you a special boon: this sacrifice Shall be called by your name, Nachiketa. Accept from me this many-hued chain too.",
                "17": "Those who have thrice performed this sacrifice, Realized their unity with father, mother, And teacher, and discharged the three duties Of studying the scriptures, ritual worship, And giving alms to those in need, rise above Birth and death. Knowing the god of fire Born of Brahman, they attain perfect peace.",
                "18": "18 Those who carry out this triple duty Conscious of its full meaning will shake off The dread noose of death and transcend sorrow To enjoy the world of heaven.",
                "19": "Thus have I granted you the second boon, Nachiketa, the secret of the fire That leads to heaven. It will have your name. Ask now, Nachiketa, for the third boon.",
                "20": "When a person dies, there arises this doubt: “He still exists,” say some; “he does not,” Say others. I want you to teach me the truth. This is my third boon.",
                "21": "YAMA \fThis doubt haunted even the gods of old, For the secret of death is hard to know. Nachiketa, ask for some other boon And release me from my promise.",
                "22": "NACHIKETA This doubt haunted even the gods of old; For it is hard to know, O Death, as you say. I can have no greater teacher than you, And there is no boon equal to this.",
                "23": "YAMA Ask for sons and grandsons who will live A hundred years. Ask for herds of cattle, Elephants and horses, gold and vast land, And ask to live as long as you desire.",
                "24": "Or, if you can think of anything more Desirable, ask for that, with wealth and Long life as well. Nachiketa, be the ruler Of a great kingdom, and I will give you The utmost capacity to enjoy The pleasures of life.",
                "25": "Ask for beautiful Women of loveliness rarely seen on earth, Riding in chariots, skilled in music, To attend on you. But Nachiketa, Don’t ask me about the secret of death.",
                "26": "NACHIKETA These pleasures last but until tomorrow, And they wear out the vital powers of life. How fleeting is all life on earth! Therefore Keep your horses and chariots, dancing And music, for yourself.",
                "27": "Never can mortals Be made happy by wealth. How can we be Desirous of wealth when we see your face 26 \fAnd know we cannot live while you are here? This is the boon I choose and ask you for.",
                "28": "Having approached an immortal like you, How can I, subject to old age and death, Ever try to rejoice in a long life For the sake of the senses’ fleeting pleasures?",
                "29": "Dispel this doubt of mine, O king of death: Does a person live after death or does he not? Nachiketa asks for no other boon Than the secret of this great mystery."
            },
            "2": {
                "1": "The joy of the spirit ever abides, But not what seems pleasant to the senses. Both these, differing in their purpose, prompt Us to action. All is well for those who choose The joy of the spirit, but they miss The goal of life who prefer the pleasant.",
                "2": "Perennial joy or passing pleasure? This is the choice one is to make always. Those who are wise recognize this, but not The ignorant. The first welcome what leads To abiding joy, though painful at the time. The latter run, goaded by their senses, After what seems immediate pleasure.",
                "3": "Well have you renounced these passing pleasures So dear to the senses, Nachiketa, And turned your back on the way of the world That makes mankind forget the goal of life.",
                "4": "Far apart are wisdom and ignorance. The first leads one to Self-realization; The second makes one more and more Estranged from one’s real Self. I regard you, 4 \fNachiketa, as worthy of instruction, For passing pleasures tempt you not at all.",
                "5": "5 Ignorant of their ignorance, yet wise In their own esteem, those deluded men Proud of their vain learning go round and round Like the blind led by the blind.",
                "6": "Far beyond Their eyes, hypnotized by the world of sense, Opens the way to immortality. “I am my body; when my body dies, I die.” Living in this superstition, They fall life after life under my sway.",
                "7": "It is but few who hear about the Self. Fewer still dedicate their lives to its Realization. Wonderful is the one Who speaks about the Self. Rare are they Who make it the supreme goal of their lives. Blessed are they who, through an illumined Teacher, attain to Self-realization.",
                "8": "The truth of the Self cannot come through one Who has not realized that he is the Self. The intellect cannot reveal the Self, Beyond its duality of subject And object. Those who see themselves in all And all in them help others through spiritual Osmosis to realize the Self themselves.",
                "9": "This awakening you have known comes not Through logic and scholarship, but from Close association with a realized teacher. Wise are you, Nachiketa, because you Seek the Self eternal. May we have more Seekers like you!",
                "10": "I know that earthly treasures are transient, And never can I reach the eternal through them. 10 \fHence have I renounced all my desires for earthly treasures To win the eternal through your instruction.",
                "11": "I spread before your eyes, Nachiketa, The fulfillment of all worldly desires: Power to dominate the earth, delights Celestial gained through religious rites, Miraculous powers beyond time and space. These with will and wisdom have you renounced.",
                "12": "The wise, realizing through meditation The timeless Self, beyond all perception, Hidden in the cave of the heart, Leave pain and pleasure far behind.",
                "13": "Those who know they are neither body nor mind But the immemorial Self, the divine Principle of existence, find the source Of all joy and live in joy abiding. I see the gates of joy are opening For you, Nachiketa.",
                "14": "Teach me of That you see as beyond right And wrong, cause and effect, past and future.",
                "15": " YAMA I will give you the Word all the scriptures Glorify, all spiritual disciplines Express, to attain which aspirants lead A life of sense-restraint and self-naughting.",
                "16": " It is OM. This symbol of the Godhead Is the highest. Realizing it one finds Complete fulfillment of all one’s longings.",
                "17": " It is of the greatest support to all seekers. \fWhen OM reverberates unceasingly Within the heart, that one is indeed blessed And deeply loved as one who is the Self.",
                "18": " The all-knowing Self was never born, Nor will it die. Beyond cause and effect, This Self is eternal and immutable. When the body dies, the Self does not die.",
                "19": " If the slayer believes that he can kill Or the slain believes that he can be killed, Neither knows the truth. The eternal Self Slays not, nor is ever slain.",
                "20": " Hidden in the heart of every creature Exists the Self, subtler than the subtlest, Greater than the greatest. They go beyond All sorrow who extinguish their self-will And behold the glory of the Self Through the grace of the Lord of Love.",
                "21": " Though one sits in meditation in a Particular place, the Self within Can exercise his influence far away. Though still, he moves everything everywhere.",
                "22": " When the wise realize the Self, Formless in the midst of forms, changeless In the midst of change, omnipresent And supreme, they go beyond sorrow.",
                "23": " The Self cannot be known through study Of the scriptures, nor through the intellect, Nor through hearing discourses about it. The Self can be attained only by those Whom the Self chooses. Verily unto them Does the Self reveal himself.",
                "24": " \fThe Self cannot be known by anyone Who desists not from unrighteous ways, Controls not the senses, stills not the mind, And practices not meditation.",
                "25": " None else can know the omnipresent Self, Whose glory sweeps away the rituals Of the priest and the prowess of the warrior And puts death itself to death."
            },
            "3": {
                "1": "In the secret cave of the heart, two are Seated by life’s fountain. The separate ego Drinks of the sweet and bitter stuff, Liking the sweet, disliking the bitter, While the supreme Self drinks sweet and bitter Neither liking this nor disliking that. The ego gropes in darkness, while the Self Lives in light. So declare the illumined sages And the householders who worship The sacred fire in the name of the Lord.",
                "2": " May we light the fire of Nachiketa That burns out the ego and enables us To pass from fearful fragmentation To fearless fullness in the changeless whole.",
                "3": "Know the Self as lord of the chariot, The body as the chariot itself, The discriminating intellect as The charioteer, and the mind as reins.",
                "4": "The senses, say the wise, are the horses; Selfish desires are the roads they travel. When the Self is confused with the body, Mind, and senses, they point out, he seems To enjoy pleasure and suffer sorrow.",
                "5": " When a person lacks discrimination \fAnd his mind is undisciplined, the senses Run hither and thither like wild horses.",
                "6": "But they obey the rein like trained horses When one has discrimination and Has made the mind one-pointed.",
                "7": "Those who lack Discrimination, with little control Over their thoughts and far from pure, Reach not the pure state of immortality But wander from death to death;",
                "8": "but those Who have discrimination, with a still mind And a pure heart, reach journey’s end, Never again to fall into the jaws of death.",
                "9": "With a discriminating intellect As charioteer and a trained mind as reins, They attain the supreme goal of life, To be united with the Lord of Love.",
                "10": "The senses derive from objects of sense-perception, Sense objects from mind, mind from intellect, And intellect from ego; ",
                "11": "ego from undifferentiated Consciousness, and consciousness from Brahman. Brahman is the First Cause and last refuge.",
                "12": " Brahman, the hidden Self in everyone, Does not shine forth. He is revealed only To those who keep their minds one-pointed On the Lord of Love and thus develop A superconscious manner of knowing.",
                "13": " Meditation enables them to go Deeper and deeper into consciousness, From the world of words to the world of thoughts, Then beyond thoughts to wisdom in the Self.",
                "14": " Get up! Wake up! Seek the guidance of an Illumined teacher and realize the Self. Sharp like a razor’s edge, the sages say, Is the path, difficult to traverse.",
                "15": " \fThe supreme Self is beyond name and form, Beyond the senses, inexhaustible, Without beginning, without end, beyond Time, space, and causality, eternal, Immutable. Those who realize the Self Are forever free from the jaws of death.",
                "16": " The wise, who gain experiential knowledge Of this timeless tale of Nachiketa, Narrated by Death, attain the glory Of living in spiritual awareness. Those who, full of devotion, recite this Supreme mystery at a spiritual Gathering are fit for eternal life. They are indeed fit for eternal life."
            }
        },
        "2": {
            "1": {
                "1": "The self-existent Lord pierced the senses To turn outward. Thus we look to the world Without and see not the Self within us. A sage withdrew his senses from the world Of change and, seeking immortality, Looked within and beheld the deathless Self.",
                "2": " The immature run after sense pleasures And fall into the widespread net of death. But the wise, knowing the Self as deathless, Seek not the changeless in the world of change.",
                "3": "That through which one enjoys form, taste, smell, sound, Touch, and sexual union is the Self. Can there be anything not known to That Who is the One in all? Know One, know all.",
                "4": "That through which one enjoys the waking And sleeping states is the Self. To know That \fAs consciousness is to go beyond sorrow.",
                "5": "Those who know the Self as enjoyer Of the honey from the flowers of the senses, Ever present within, ruler of time, Go beyond fear. For this Self is supreme!",
                "6": " The god of creation, Brahma, Born of the Godhead through meditation Before the waters of life were created, Who stands in the heart of every creature, Is the Self indeed. For this Self is supreme!",
                "7": " The goddess of energy, Aditi, Born of the Godhead through vitality, Mother of all the cosmic forces, Who stands in the heart of every creature, Is the Self indeed. For this Self is supreme!",
                "8": " The god of fire, Agni, hidden between Two firesticks like a child well protected In the mother’s womb, whom we adore Every day in the depths of meditation, Is the Self indeed. For this Self is supreme!",
                "9": " That which is the source of the sun And of every power in the cosmos, beyond which There is neither going nor coming, Is the Self indeed. For this Self is supreme!",
                "10": " What is here is also there; what is there, Also here. Who sees multiplicity But not the one indivisible Self Must wander on and on from death to death.",
                "11": " Only the one-pointed mind attains This state of unity. There is no one But the Self. Who sees multiplicity \fBut not the one indivisible Self Must wander on and on from death to death.",
                "12": " That thumb-sized being enshrined in the heart, Ruler of time, past and future, To see whom is to go beyond all fear, Is the Self indeed. For this Self is supreme!",
                "13": " That thumb-sized being, a flame without smoke, Ruler of time, past and future, The same on this day as on tomorrow, Is the Self indeed. For this Self is supreme!",
                "14": " As the rain on a mountain peak runs off The slopes on all sides, so those who see Only the seeming multiplicity of life Run after things on every side.",
                "15": " As pure water poured into pure water Becomes the very same, so does the Self Of the illumined man or woman, Nachiketa, Verily become one with the Godhead."
            },
            "2": {
                "1": "There is a city with eleven gates Of which the ruler is the unborn Self, Whose light forever shines. They go beyond Sorrow who meditate on the Self and Are freed from the cycle of birth and death. For this Self is supreme!",
                "2": " The Self is the sun shining in the sky, The wind blowing in space; he is the fire At the altar and in the home the guest; He dwells in human beings, in gods, in truth, And in the vast firmament; he is the fish Born in water, the plant growing in the earth, \fThe river flowing down from the mountain. For this Self is supreme!",
                "3": " The adorable one who is seated In the heart rules the breath of life. Unto him all the senses pay their homage.",
                "4": "When the dweller in the body breaks out In freedom from the bonds of flesh, What remains? For this Self is supreme!",
                "5": " We live not by the breath that flows in And flows out, but by him who causes the breath To flow in and flow out.",
                "6": " Now, O Nachiketa, I will tell you Of this unseen, eternal Brahman, and What befalls the Self after death. 7 Of those Unaware of the Self, some are born as Embodied creatures while others remain In a lower stage of evolution, As determined by their own need for growth.",
                "7": " That which is awake even in our sleep, Giving form in dreams to the objects of Sense craving, that indeed is pure light, Brahman the immortal, who contains all For this Self is supreme!",
                "8": " As the same fire assumes different shapes When it consumes objects differing in shape, So does the one Self take the shape Of every creature in whom he is present.",
                "9": " As the same air assumes different shapes When it enters objects differing in shape, So does the one Self take the shape Of every creature in whom he is present.",
                "10": " \fAs the sun, who is the eye of the world, Cannot be tainted by the defects in our eyes Or by the objects it looks on, So the one Self, dwelling in all, cannot Be tainted by the evils of the world. For this Self transcends all!",
                "11": " The ruler supreme, inner Self of all, Multiplies his oneness into many. Eternal joy is theirs who see the Self In their own hearts. To none else does it come!",
                "12": " Changeless amidst the things that pass away, Pure consciousness in all who are conscious, The One answers the prayers of many. Eternal peace is theirs who see the Self In their own hearts. To none else does it come!",
                "13": " NACHIKETA How can I know that blissful Self, supreme, Inexpressible, realized by the wise? Is he the light, or does he reflect light?",
                "14": " YAMA There shines not the sun, neither moon nor star, Nor flash of lightning, nor fire lit on earth. The Self is the light reflected by all. He shining, everything shines after him."
            },
            "3": {
                "1": "The Tree of Eternity has its roots above And its branches on earth below. Its pure root is Brahman the immortal, From whom all the worlds draw their life, and whom None can transcend. For this Self is supreme!",
                "2": " \fThe cosmos comes forth from Brahman and moves In him. With his power it reverberates, Like thunder crashing in the sky. Those who Realize him pass beyond the sway of death.",
                "3": " In fear of him fire burns; in fear of him The sun shines, the clouds rain, and the winds blow. In fear of him death stalks about to kill.",
                "4": "If one fails to realize Brahman in this life Before the physical sheath is shed, He must again put on a body In the world of embodied creatures.",
                "5": " Brahman can be seen, as in a mirror, In a pure heart; in the world of the ancestors As in a dream; in the gandharva world As the reflections in trembling waters; And clear as light in the realm of Brahma.",
                "6": " Knowing the senses to be separate From the Self, and the sense experience To be fleeting, the wise grieve no more.",
                "7": " Above the senses is the mind, above The mind is the intellect, above that Is the ego, and above the ego Is the unmanifested Cause.",
                "8": "And beyond is Brahman, omnipresent, Attributeless. Realizing him one is released From the cycle of birth and death.",
                "9": " He is formless, and can never be seen With these two eyes. But he reveals himself In the heart made pure through meditation And sense-restraint. Realizing him, one is Released from the cycle of birth and death.",
                "10": " \fWhen the five senses are stilled, when the mind Is stilled, when the intellect is stilled, That is called the highest state by the wise.",
                "11": " They say yoga is this complete stillness In which one enters the unitive state, Never to become separate again. If one is not established in this state, The sense of unity will come and go.",
                "12": " The unitive state cannot be attained Through words or thoughts or through the eye. How can it be attained except through one Who is established in this state oneself?",
                "13": " There are two selves, the separate ego And the indivisible Atman. When One rises above I and me and mine, The Atman is revealed as one’s real Self.",
                "14": " When all desires that surge in the heart Are renounced, the mortal becomes immortal.",
                "15": " When all the knots that strangle the heart Are loosened, the mortal becomes immortal. This sums up the teaching of the scriptures.",
                "16": " From the heart there radiate a hundred And one vital tracks. One of them rises To the crown of the head. This way leads To immortality, the others to death.",
                "17": " The Lord of Love, not larger than the thumb, Is ever enshrined in the hearts of all. Draw him clear out of the physical sheath, As one draws the stalk from the munja grass. Know thyself to be pure and immortal! Know thyself to be pure and immortal!"
            }
        }
    },
    "BRIHADARANYAKA": {
        "intro": "Brihad-aranyaka means “of the great forest,” and that is an apt name for\nthis Upanishad, which is by far the longest and one of the most revered of\nthese magnificent documents. To read it is like walking through a great\nforest with paths leading off in unpredictable but somehow meaningful\ndirections; we keep coming across gems of wisdom.\nThe opening selection illustrates this, being one of the most poignant and\nilluminating discussions in the wisdom of any tradition. It is the dialogue\nbetween a great sage, Yajnavalkya, and his wife Maitreyi. Yajnavalkya has\njust reached a critical juncture in his life: he is about to leave home in the\npursuit of truth, or Self-realization. Maitreyi shares his yearning for\nimmortality, and so the parting dialogue between them turns into a deep\nsession of “spiritual instruction” – one of the meanings of the word\nupanishad.\nWhat Yajnavalkya wants to teach is the greatest discovery of the\nUpanishads: the Self, which is identical in all of us, the Life of all that lives.\nWhenever we love, he tells his wife, we are really responding to the Self\nwithin that person. Therefore – and this is the underlying theme of all\nmysticism – if we discover this Self in our own consciousness, there will be\nno more parting, no more sorrow ever. Shankara once declared that two\nwords from the Upanishads give us the essence of all their teachings:\n“meditate on the Self,” that is, become one with – realize – this underlying\nReality.\nOften, it is this anguish of parting – the death of a loved one, the breaking\napart of a deep relationship, even the growing up of our children – that\npropels us into the search for a reality that will never let us down; so this\nopening passage illustrates, through the experience of Maitreyi, the state of\n\fseriousness, of being shocked into alertness, that makes one ready to absorb\nspiritual insight. The only real source of such insight is almost always, in\nIndian tradition, a living teacher who is equally ready to impart it; that is\nwhy almost all the Upanishads are in the form of dialogues.\nIn the next two sections we again meet Yajnavalkya, now playing the\nimportant role of spiritual adviser to a famous king, Janaka, who himself\nwas destined to achieve illumination. Illustrating the wry humor of the\nUpanishads and the very human way they see even the most august sages at\niii.7 Yajnavalkya perks up on hearing that King Janaka will give a thousand\ncows to the wisest among the gathered pundits and casually tells his\ndisciple, “Son, drive them home.” Then, when the outraged brahmins ask\nhow he dares declare himself the wisest among them, he disarms them by\nsaying, “I bow down to the wisest, but I want those cows!” Challenged by\nGargi, another of those women of spiritual authority who appear in the\nUpanishads, the sage explains how all existence – everything in the\nphenomenal world – is “woven” in the Imperishable. To bring across this\ngreat truth he relies on wonderfully vivid images. The human being moves\nbetween two main states of consciousness as a great fish, master of its\nworld, swims back and forth between the banks of a river; like a tired eagle\nreturning to its nest at last, we find our true home in the eternal Self, the\nsource of all awareness. Or, boldly, “as one in the arms of his beloved is not\naware of what is without or what is within, so one in union with the Self is\nnot aware of what is without or what is within,” for all desires are fulfilled.\nWhen we encounter this daring vision of reality, we want to know what\nto do. If this tremendous vision is to have any ultimate meaning for us,\nthere must be some way we can at least partly realize it ourselves.\nAppropriately, then, this selection ends with a passage that, while lightly\ndisguised as mythology, highlights three potent practices: damyata datta\ndayadhvam, “Be self-controlled, give, be compassionate.” This passage,\nboiled down as it is to three potent syllables, da – da – da, caught the\nimagination of T. S. Eliot; more to the point, it has helped countless seekers\ndown the ages to orient their lives to the supreme goal. –M.N.",
        "chapter2": {
            "1": "“Maitreyi,” Yajnavalkya said to his wife one day, “the time has come for me to go forth from the worldly life. Come, my dear, let me divide my property between you and Katyayani.”",
            "2": " MAITREYI My lord, if I could get all the wealth in the world, would it help me to go beyond death? YAJNAVALKYA Not at all. You would live and die like any other rich person. No one can buy immortality with money.",
            "3": " MAITREYI Of what use then are money and material possessions to me? Please tell me, my lord, of the way that leads to immortality.",
            "4": " YAJNAVALKYA You have always been dear to me, Maitreyi, and I love you even more now that you have asked me about immortality. Sit here by my side and reflect deeply on what I say.",
            "5": " A wife loves her husband not for his own sake, dear, but because the Self lives in him. A husband loves his wife not for her own sake, dear, but because the Self lives in her. \fChildren are loved not for their own sake, but because the Self lives in them. Wealth is loved not for its own sake, but because the Self lives in it. Brahmins are loved not for their own sake, but because the Self lives in them. Kshatriyas are loved not for their own sake, but because the Self lives in them. The universe is loved not for its own sake, but because the Self lives in it. The gods are loved not for their own sake, but because the Self lives in them. Creatures are loved not for their own sake, but because the Self lives in them. Everything is loved not for its own sake, but because the Self lives in it. This Self has to be realized. Hear about this Self and meditate upon him, Maitreyi. When you hear about the Self, meditate upon the Self, and finally realize the Self, you come to understand everything in life.",
            "6": " For brahmins confuse those who regard them as separate from the Self. Kshatriyas confuse those who regard them as separate from the Self. The universe confuses those who regard it as separate from the Self. Gods and creatures confuse those who regard them as separate from the Self. Everything confuses those who regard things as separate from the Self. Brahmins, kshatriyas, creatures, the universe, the gods, everything: these are the Self.",
            "7": " \fNo one can understand the sounds of a drum without understanding both drum and drummer; ",
            "8": " nor the sounds of a conch without understanding both the conch and its blower;",
            "9":  " nor the sounds of a vina without understanding both vina and musician.",
            "10": " As clouds of smoke arise from a fire laid with damp fuel, even so from the Supreme have issued forth all the Vedas, history, arts, sciences, poetry, aphorisms, and commentaries. All these are the breath of the Supreme.",
            "11": " As there can be no water without the sea, no touch without the skin, no smell without the nose, no taste without the tongue, no form without the eye, no sound without the ear, no thought without the mind, no wisdom without the heart, no work without hands, no walking without feet, no scriptures without the word, so there can be nothing without the Self.",
            "12": " As a lump of salt thrown in water dissolves and cannot be taken out again, though wherever we taste the water it is salty, even so, beloved, the separate self dissolves in the sea of pure consciousness, infinite and immortal. Separateness arises from identifying the Self with the body, which is made up of the elements; when this physical identification dissolves, there can be no more separate self. This is what I want to tell you, beloved.",
            "13": " MAITREYI I am bewildered, Blessed One, when you say there is then no separate self.",
            "14": " YAJNAVALKYA Reflect on what I have said, beloved, and you will not be confused. As long as there is separateness, one sees another as separate from oneself, hears another as separate from oneself, smells another as separate from oneself, speaks to another as separate from oneself, thinks of another as separate from oneself, knows another as separate from oneself. But when the Self is realized as the indivisible unity of life, who can be seen by whom, who can be \fheard by whom, who can be smelled by whom, who can be spoken to by whom, who can be thought of by whom, who can be known by whom? Maitreyi, my beloved, how can the knower ever be known?"
        },
        "chapter3": {
            "1": {
                "1": "King Janaka of Videha once performed a lavish sacrifice and distributed many gifts. Many wise men from Kuru and Panchalaattended the ceremony, and Janaka wanted to know who was the wisest among them. So he drove a thousand cows into a pen, and between the horns of each cow he fastened ten gold coins.",
                "2": "Then he said: 'Venerable brahmins, these cows are for the wisest one among you. Let him take them away.' None of the other brahmins dared to speak, but Yajnavalkya said to his pupil Samashrava: 'Son, you can drive these cows home.' 'Hero of seers!' his pupil exclaimed joyfully, and he drove them home. The other brahmins were furious. 'How presumptuous!' they shouted. And Ashvala, the royal priest, asked: 'Yajnavalkya, do you really believe you are the wisest of those assembled here? Yajnavalkya replied: 'I salute the wisest, but I want those cows.'"
            },
            "8": {
                "1": "Then Gargi, daughter of Vachaknu, said: “Venerable brahmins, I shall ask Yajnavalkya only two questions. If he answers them well, no one here can defeat him in a spiritual debate.” “Ask, Gargi,” the sage replied.",
                "2": " GARGI \fYajnavalkya, as a warrior from Kashi or Videha rises with bow and arrow to fell his opponent, I rise to fell you with two questions. YAJNAVALKYA Ask them, Gargi.",
                "3": " GARGI That which is above heaven and below the earth, which is also between heaven and earth, which is the same through past, present, and future, in what is that woven, warp and woof? Tell me, Yajnavalkya.",
                "4": " YAJNAVALKYA That which is above heaven and below earth, which is also between heaven and earth, which is the same through the past, present, and future – that is woven, warp and woof, in space.",
                "5": " GARGI My first question is answered well. Now for my second question. YAJNAVALKYA Ask, Gargi.",
                "6": " GARGI In what is space itself woven, warp and woof? Tell me, Yajnavalkya.",
                "7": " YAJNAVALKYA The sages call it Akshara, the Imperishable. It is neither big nor small, neither long nor short, neither hot nor cold, neither bright nor dark, neither air nor space. It is without attachment, without taste, smell, or touch, without eyes, ears, tongue, mouth, breath, or mind, without movement, without limitation, without inside or outside. It consumes nothing, and nothing consumes it.",
                "9": " \fIn perfect accord with the will of the Imperishable, sun and moon make their orbits; heaven and earth remain in place; moments, hours, days, nights, fortnights, months, and seasons become years; rivers starting from the snow-clad mountains flow east and west, north and south, to the sea.",
                "10": " Without knowing the Imperishable, Gargi, whoever performs rites and ceremonies and undergoes austerities, even for many years, reaps little benefit, because rites, ceremonies, and austerities are all perishable. Whosoever dies without knowing the Imperishable dies in a pitiable state; but those who know the Imperishable attain immortality when the body is shed at death.",
                "11": " The Imperishable is the seer, Gargi, though unseen; the hearer, though unheard; the thinker, though unthought; the knower, though unknown. Nothing other than the Imperishable can see, hear, think, or know. It is in the Imperishable that space is woven, warp and woof.",
                "12": "GARGI Venerable brahmins, count yourselves fortunate if you get away with merely paying this man homage. No one can defeat Yajnavalkya in debate about Brahman. With these words Gargi ended her questions."
            }
        },
        "chapter4": {
            "1": {
                "1": "Yajnavalkya came to Janaka, king of Videha, saying to himself, “I will not talk today.” But earlier, while they were discussing the fire ceremony, Yajnavalkya had promised him any boon he wanted. Now the king asked the sage permission to question him.",
                "2": " JANAKA Yajnavalkya, what is the light of man? YAJNAVALKYA The sun is our light, for by that light we sit, work, go out, and come back.",
                "3": " JANAKA When the sun sets, what is the light of man? YAJNAVALKYA The moon is our light, for by that light we sit, work, go out, and come back.",
                "4": " JANAKA When the sun sets,Yajnavalkya, and the moon sets, what is the light of man? YAJNAVALKYA Fire is our light, for by that we sit, work, go out, and come back.",
                "5": " JANAKA When the sun sets, Yajnavalkya, and the moon sets, and the fire goes out, what is the light of man? YAJNAVALKYA Then speech is our light, for by that we sit, work, go out, and come back. Even though we cannot see our own hand in the dark, we can hear what is said and move toward the person speaking.",
                "6": " JANAKA When the sun sets,Yajnavalkya, and the moon sets, and the fire goes out and no one speaks, what is the light of man? YAJNAVALKYA \fThe Self indeed is the light of man, your majesty, for by that we sit, work, go out, and come back.",
                "7": " JANAKA Who is that Self? YAJNAVALKYA The Self, pure awareness, shines as the light within the heart, surrounded by the senses. Only seeming to think, seeming to move, the Self neither sleeps nor wakes nor dreams.",
                "8": " When the Self takes on a body, he seems to assume the body’s frailties and limitations; but when he sheds the body at the time of death, the Self leaves all these behind.",
                "9": " The human being has two states of consciousness: one in this world, the other in the next. But there is a third state between them, not unlike the world of dreams, in which we are aware of both worlds, with their sorrows and joys. When a person dies, it is only the physical body that dies; that person lives on in a nonphysical body, which carries the impressions of his past life. It is these impressions that determine his next life. In this intermediate state he makes and dissolves impressions by the light of the Self.",
                "10": " In that third state of consciousness there are no chariots, no horses drawing them or roads on which to travel, but he makes up his own chariots, horses, and roads. In that state there are no joys or pleasures, but he makes up his own joys and pleasures. In that state there are no lotus ponds, no lakes, no rivers, but he makes up his own lotus ponds, lakes, and rivers. It is he who makes up all these from the impressions of his past or waking life.",
                "11": " It is said of these states of consciousness that in the dreaming state, when one is sleeping, the shining Self, who never dreams, who is ever awake, watches by his own light the dreams woven out of past deeds and present desires. In the dreaming state, when one is sleeping, the shining Self keeps the body alive with the vital force of \fprana, and wanders wherever he wills. In the dreaming state, when one is sleeping, the shining Self assumes many forms, eats with friends, indulges in sex, sees fearsome spectacles.",
                "16": " But he is not affected by anything because he is detached and free; and after wandering here and there in the state of dreaming, enjoying pleasures and seeing good and evil, he returns to the state from which he began.",
                "18": " As a great fish swims between the banks of a river as it likes, so does the shining Self move between the states of dreaming and waking.",
                "19": " As an eagle, weary after soaring in the sky, folds its wings and flies down to rest in its nest, so does the shining Self enter the state of dreamless sleep, where one is freed from all desires.",
                "21": " The Self is free from desire, free from evil, free from fear. As a man in the arms of his beloved is not aware of what is without and what is within, so a person in union with the Self is not aware of what is without and what is within, for in that unitive state all desires find their perfect fulfillment. There is no other desire that needs to be fulfilled, and one goes beyond sorrow.",
                "22": " In that unitive state there is neither father nor mother, neither worlds nor gods nor even scriptures. In that state there is neither thief nor slayer, neither low caste nor high, neither monk nor ascetic. The Self is beyond good and evil, beyond all the suffering of the human heart.",
                "23": " In that unitive state one sees without seeing, for there is nothing separate from him; smells without smelling, for there is nothing separate from him; tastes without tasting, for there is nothing separate from him; speaks without speaking, for there is nothing separate from him; hears without hearing, for there is nothing separate from him; touches without touching, for there is nothing separate from him; thinks without thinking, for there is \fnothing separate from him; knows without knowing, for there is nothing separate from him.",
                "31": " Where there is separateness, one sees another, smells another, tastes another, speaks to another, hears another, touches another, thinks of another, knows another.",
                "32": " But where there is unity, one without a second, that is the world of Brahman. This is the supreme goal of life, the supreme treasure, the supreme joy. Those who do not seek this supreme goal live on but a fraction of this joy.",
                "33": " JANAKA I give you another thousand cows! Please teach me more of the way to Self-realization.",
                "35": " YAJNAVALKYA As a heavily laden cart creaks as it moves along, the body groans under its burden when a person is about to die. ",
                "36": " When the body grows weak through old age or illness, the Self separates himself as a mango or fig or banyan fruit frees itself from the stalk, and returns the way he came to begin another life.",
                "37": " Just as when a king is expected to visit a village, the mayor and all the other officials turn out to welcome him with food and drink, all creation awaits the person who sheds his body having realized Brahman. “Here he comes!” they say. “Here comes Brahman himself!” ",
                "38": " But the senses, while that man lies dying, gather around and mourn the Selfs departure, as courtiers mourn when their king is about to leave."
            },
            "4": {
                "1": " When body and mind grow weak, the Self gathers in all the powers of life and descends with them into the heart. As prana leaves the eye, it ceases to see. ",
                "2": " He is becoming one, say the wise; he does not see. He is becoming one; he no longer hears. He is becoming one; he no longer speaks, or tastes, or smells, or thinks, or knows. By the light of the heart the Self leaves the body by one of its gates; and when he leaves, prana follows, and with it all the vital powers of the body. He who is dying merges in consciousness, and thus consciousness accompanies him when he departs, along with the impressions of all that he has done, experienced, and known.",
                "3": " As a caterpillar, having come to the end of one blade of grass, draws itself together and reaches out for the next, so the Self, having come to the end of one life and dispelled all ignorance, gathers in his faculties and reaches out from the old body to a new.",
                "4": " As a goldsmith fashions an old ornament into a new and more beautiful one, so the Self, having reached the end of the last life and dispelled all ignorance, makes for himself a new, more beautiful shape, like that of the devas or other celestial beings.",
                "5": " The Self is indeed Brahman, but through ignorance people identify it with intellect, mind, senses, passions, and the elements of earth, water, air, space, and fire. This is why the Self is said to consist of this and that, and appears to be everything. As a person acts, so he becomes in life. Those who do good become good; those who do harm become bad. Good deeds make one pure; bad deeds make one impure. You are what your deep, driving desire is. As your desire is, so is your will. As your will is, so is your deed. As your deed is, so is your destiny.",
                "6": " We live in accordance with our deep, driving desire. It is this desire at the time of death that determines what our next life will be. We will come back to earth to work out the satisfaction of that desire. But not those who are free from desire; they are free because all their desires have found fulfillment in the Self. They do not die like the others; but realizing Brahman, they merge in Brahman.",
                "7": "  So it is said: \fWhen all the desires that surge in the heart Are renounced, the mortal becomes immortal. When all the knots that strangle the heart Are loosened, the mortal becomes immortal, Here in this very life. As the skin of a snake is sloughed onto an anthill, so does the mortal body fall; but the Self, freed from the body, merges in Brahman, infinite life, eternal light. JANAKA I give you another thousand cows! Please teach me more of the way to Self-realization.",
                "23": " YAJNAVALKYA Those who realize the Self enter into the peace that brings complete self-control and perfect patience. They see themselves in everyone and everyone in themselves. Evil cannot overcome them because they overcome all evil. Sin cannot consume them because they consume all sin. Free from evil, free from sin and doubt, they live in the kingdom of Brahman. Your majesty, this kingdom is yours! JANAKA Venerable One, I offer myself and my kingdom in your service."
            }
        },
        "chapter5": {
            "1": "The children of Prajapati, the Creator – gods, human beings, and asuras, the godless – lived with their father as students. When they had completed the allotted period the gods said, “Venerable One, please teach us.” Prajapati answered with one syllable: “Da.” \f“Have you understood?” he asked. “Yes,” they said. “You have told us damyata, be self-controlled.” “You have understood,” he said.",
            "2": "Then the human beings approached. “Venerable One, please teach us.” Prajapati answered with one syllable: “Da.” “Have you understood?” he asked. “Yes,” they said. “You have told us datta, give.” “You have understood,” he said. Then the godless approached. “Venerable One, please teach us.” Prajapati answered with the same syllable: “Da.” “Have you understood?” he asked. “Yes,” they said. “You have told us dayadhvam, be compassionate.” “You have understood,” he said. The heavenly voice of the thunder repeats this teaching. Da-da-da! Be self-controlled! Give! Be compassionate!"
        }
    },
    "CHANDOGYA": {
        "intro": "In the wisdom of ancient India, the universe came forth from the invisible\nand unchanging Reality like the uttering of a meaningful sound: mystical\nspeech (which is why the Vedas are thought of as existing long before\nhuman beings or anything else). It was not a Big Bang but a big Om; and it\nis with this image that the Upanishad named Chandogya, “the uprising of\nsacred song,” begins. Just as Western scientists seek the laws of the physical\nuniverse in a kind of echo of that primordial explosion, the sages who\npredated them by so many centuries “heard” Om, the primordial sound, and\ndiscovered deep laws governing all existence.\nThe universe is founded on two principles, they discovered. One is rita,\nlaw, order, or regularity. Without it no scientific discovery would be\npossible; more importantly, no moral discovery would be possible. Human\nexperience would have no meaning, for we would have no way to learn\nfrom our experiences.\nThe second principle is yajna, sacrifice. The universe, they tell us, runs\non renunciation. The most significant human action is the sacrifice of\npersonal gain for the sake of something higher and holier.\nIf rita is the moral law, yajna is the human response to live in accordance\nwith that law, taking nothing from life for oneself but everywhere seeking\nto give of oneself to life. Jesus was essentially describing rita when he said,\n“By the same measure you mete out to others, by that measure shall it be\nmeted out to you,” and yajna when he said, “Lay not up for yourselves\ntreasures upon earth. . . . But seek first the kingdom of God and his\nrighteousness, and all these things shall be added unto you.” We can use\nthings, but to be in harmony with the underlying laws of life we should\n\fnever feel that they are really ours: as the Isha Upanishad so simply puts it,\n“Everything belongs to the Lord.”\nThis awareness leads to a profound peace, which the Chandogya conveys\nin one of the Upanishads’ most poignant images: “As a tethered bird flies\nthis way and that, and comes to rest at last on its own perch, so the mind,\ntired of wandering about . . . settles down in the Self” (VI.8.2). This\nUpanishad charts an inward course back to speech, breath, and vital energy\n(prana), and ultimately to the Self, or Brahman. Prana tends to become the\nfocus of attention whenever it comes up, and that is what happens in the\nsections that follow containing the famous stories of Satyakama (IV.4) and\nShvetaketu (VII). These two spiritual students are a striking contrast, as\nSatyakama breaks social convention: born out of wedlock, he has the\ncourage to admit as much to his teacher, who honors that courage and\naccepts him. This episode is one of the most imaginative frame stories for\nteaching in all the Upanishads (which is saying a lot), as various odd birds\nand animals teach him “one foot of Brahman” at a time until he is\nillumined.\nPrana also provides an explanation for the process we call death, as\nprana, life-energy, is withdrawn by progressive steps – the same kind of\nsteps by which the universe itself was manifested and will be withdrawn –\ninto its ultimate source (VI.15). This prepares us for the triumphant\ndeclaration of Chapter VIII, the “City of Brahman,” a moving description of\nBrahmaloka, the “Land of No Change” beyond all death and suffering.\nWhile we actually visit this state without knowing it while in deep sleep\n(VI.8.1 and VIII.3.2), we can possess it in full awareness through the heroic\nspiritual disciplines the Upanishads are always leading us to. We can live in\nthis very world free from sorrow, ill health, perturbation, distress of any\nkind; and then for us death, while it claims the body, will never touch us\nbecause we are identified completely with the Self, which is a “bridge” or\n“bulwark” (VIII.4) none of these can cross. –M.N.",
        "chapter1": {
            "1": " Let us meditate on OM the imperishable, the beginning of prayer.",
            "2": "For as the earth comes from the waters, plants from earth, and man from plants, so man is speech, and speech is OM. Of all speech the essence is the Rig Veda; but Sama is the essence of Rig, and of Sama the essence is OM, the Udgitha.",
            "3": "This is the essence of essences, the highest, the eighth rung, venerated above all that human beings hold holy. OM is the Self of all.",
            "4": "What is rig, what is sama, at the heart of prayer?",
            "5": " As rig is speech, so sama is song, and the imperishable OM is the Udgitha. Speech and breath, Sama and Rig, are couples",
            "6": " and in the imperishable OM they come together to fulfill each other’s desire.",
            "7": "For those who, knowing this, meditate on the imperishable OM, all desires are fulfilled.",
            "8": " With the word OM we say, “I agree,” and fulfill desires.",
            "9": "With OM we recite, we give direction, we sing aloud the honor of that Word, the key to the three kinds of knowledge",
            "10": "Side by side, those who know the Self and those who know it not do the same thing; but it is not the same: the act done with knowledge, with inner awareness and faith, grows in power. That, in a word, tells the significance of OM, the indivisible"
        },
        "chapter3": {
            "1": "This universe comes forth from Brahman, exists in Brahman, and will return to Brahman. Verily, all is Brahman.A person is what his deep desire is. It is our deepest desire in this life that shapes the life to come. So let us direct our deepest desires to realize the Self.",
            "2": "The Self, who can be realized by the pure in heart, who is life, light, truth, space, who gives rise to all works, all desires, all odors, all tastes, who is beyond words, who is joy abiding –",
            "3": " this is the Self dwelling in my heart. Smaller than a grain of rice, smaller than a grain of barley, smaller than a mustard seed, smaller than a grain of millet, smaller even than the kernel of a grain of millet is the Self. This is the Self dwelling in my heart, greater than the earth, greater than the sky, greater than all the worlds.",
            "4": "This Self who gives rise to all works, all desires, all odors, all tastes, who pervades the universe, who is beyond words, who is joy abiding, who is ever present in my heart, is Brahman indeed. To him I shall attain when my ego dies. So said Shandilya; so said Shandilya."
        },
        "chapter4": {
            "4": {
                "1": "“Mother,” Satyakama said, “I feel the time has come for me to go to the home of a spiritual teacher. From whom does our family come, so that I may tell him when he asks my lineage?”",
                "2": "\f“I do not know, dear,” she replied. “You were born when I was young and going from place to place as a servant. Your name is Satyakama and my name is Jabala; why not call yourself Satyakama Jabala?”",
                "3": "Satyakama went to Haridrumata Gautama and said to him, “Sir, I want to become your disciple.”",
                "4": "“What family are you from, bright one?” “Sir, I don’t know. My mother says she bore me in her youth and doesn’t know my ancestry. She says that since my name is Satyakama and hers is Jabala I should call myself Satyakama Jabala.”",
                "5": "“None but a true brahmin could have said that. Fetch the firewood, my boy; I will initiate you. You have not flinched from the truth.”He selected four hundred lean and sickly cows and gave them to Satyakama to care for. “I shall not return,” the boy said to himself, “until they become a thousand.”"
            },
            "5": {
                "1": "For years Satyakama dwelt in the forest, tending the herd. Then one day the bull of the herd said to him: “Satyakama!”“Sir?” he replied. “We have become a thousand. Let us now rejoin our teacher’sfamily",
                "2": "and I will tell you one of the four feet of Brahman.”“Please tell me, revered sir,” the boy said. “There are four quarters: east, west, south, and north. This is one foot of Brahman, called the Shining. To meditate on these four is to become full of light and master the resplendent regions of thecosmos, knowing this portion of the truth."
            },
            "6": {
                "1": "Agni, fire, will tell youmore.” \fThe next day Satyakama set out for his teacher’s house with the herd. Toward evening he made a fire, penned the cows, and sat bythe fire facing east.",
                "2": "The fire spoke: “Satyakama!” “Sir?”",
                "3": "“Friend, I can teach you another foot of Brahman.” “Please do, revered sir.” “There are four quarters: earth, sky, heaven, and ocean. This is one foot of Brahman, called Without End. Know this, meditate on this"
            },
            "7": {
                "1": " A swanwill tell you more.” The next day Satyakama drove the cows onward. Toward evening he lit a fire, penned the cows, and sat by the fire facing east. 7.2",
                "2": "Then a swan flew near and said: “Satyakama!” “Sir?”",
                "3": "“Friend, I can teach you another foot of Brahman.” “Please do, revered sir.” “There are four quarters: fire, the sun, the moon, and lightning.These make one foot of Brahman, called Full of Light.",
                "4": "To meditate on this fourfold foot of truth is to be filled with light in this world and master the world of light. "
            },
            "8": {
                "1": " A diver bird will tell you more.” The next day Satyakama drove the cows onward. Toward evening he lit a fire, penned the cows, and sat by the fire facing east",
                "2": "Then a diver bird flew near and spoke to him: “Satyakama!” “Sir?”",
                "3": "“Friend, I can teach you another foot of Brahman.” “Please do, revered sir.” “There are four parts: breath, eye, ear, and mind. This is one foot of Brahman, called Established. ",
                "4": "To meditate on this fourfold foot of Brahman is to be at home in this world and master space. Whoever knows this fourfold foot of Brahman is called established.”"
            },
            "9": {
                "1": "1 So Satyakama returned to his teacher’s home. “Satyakama,” his teacher called,",
                "2": "“you glow like one who has known the truth. Tell me, who has taught you?” Satyakama replied, “No human, sir. But I wish to hear the truth from you alone.",
                "3": "For I have heard that only the teacher’s wisdom comes to fruition for us.” Then his teacher taught Satyakama that same wisdom. Nothing was left out from it; nothing was left out."
            }
        },
        "chapter6": {
            "1": {
                "1": "The Story of Shvetaketu Shvetaketu was Uddalaka’s son. When he was twelve, his father said to him: “It is time for you to find a teacher, Dear one, for no one in our family Is a stranger to the spiritual life.”",
                "2": "So Shvetaketu went to a teacher And studied all the Vedas for twelve years. At the end of this time he returned home, Proud of his intellectual knowledge.“You seem to be proud of all this learning,” Said Uddalaka. “But did you ask Your teacher for that spiritual wisdom",
                "3": " Which enables you to hear the unheard, \fThink the unthought, and know the unknown?” “What is that wisdom, Father?” asked the son.",
                "4": " “As by knowing one lump of clay, dear one, We come to know all things made out of clay That they differ only in name and form, While the stuff of which all are made is clay;",
                "5": " As by knowing one gold nugget, dear one, We come to know all things made out of gold: That they differ only in name and form,",
                "6": " As by knowing one tool of iron, dear one, We come to know all things made out of iron: That they differ only in name and form, While the stuff of which all are made is iron So through that spiritual wisdom, dear one, We come to know that all of life is one.”",
                "7": "“My teachers must not have known this wisdom,” Said Shvetaketu, “for if they had known, How could they have failed to teach it to me? Please instruct me in this wisdom, Father.” "
            },
            "2": {
                "2": "“Yes, dear one, I will,” replied his father. “In the beginning was only Being, One without a second.",
                "3": "2.3 Out of himself he brought forth the cosmos And entered into everything in it. There is nothing that does not come from him. Of everything he is the inmost Self. He is the truth; he is the Self supreme. You are that, Shvetaketu; you are that.”“Please, Father, tell me more about this Self.” \f“Yes, dear one, I will,” Uddalaka said."
            },
            "8": {
                "1": "“Let us start with sleep. What happens in it? When one is absorbed in dreamless sleep, He is one with the Self, though he knows it not. We say he sleeps, but he sleeps in the Self.",
                "2": "8.2 As a tethered bird grows tired of flying About in vain to find a place of rest And settles down at last on its own perch, So the mind, tired of wandering about Hither and thither, settles down at last In the Self, dear one, to which it is bound.",
                "4": "8.4 All creatures, dear one, have their source in him. He is their home; he is their strength.”",
                "6": "“When a person departs from this world, dear one, His speech merges in mind, his mind in prana, Prana in fire, and fire in pure Being.",
                "7": "8.7 There is nothing that does not come from him. Of everything he is the inmost Self. He is the truth; he is the Self supreme. You are that, Shvetaketu; you are that.”"
            },
            "9": {
                "1": "“Please tell me, Father, more about this Self.” “Yes, dear one, I will,” Uddalaka said. “As bees suck nectar from many a flower",
                "2": "And make their honey one, 9.2 so that no drop Can say, “I am from this flower or that,” All creatures, though one, know not they are that One.",
                "3": " There is nothing that does not come from him. Of everything he is the inmost Self. He is the truth; he is the Self supreme. You are that, Shvetaketu; you are that.” 9.1 \f“Please, Father, tell me more about this Self.”"
            },
            "10": {
                "1": " “As the rivers flowing east and west Merge in the sea and become one with it, Forgetting they were ever separate rivers,",
                "2": " So do all creatures lose their separateness When they merge at last into pure Being.",
                "3": " There is nothing that does not come from him. Of everything he is the inmost Self. He is the truth; he is the Self supreme. You are that, Shvetaketu; you are that.” “Please, Father, tell me more about this Self.”"
            },
            "11": {
                "1": "“Strike at the root of a tree; it would bleed But still live. Strike at the trunk; it would bleed But still live. Strike again at the top; It would bleed but still live. The Self as life Supports the tree, which stands firm and enjoys",
                "2": "11.2 If the Self leaves one branch, that branch withers. If it leaves a second, that too withers. If it leaves a third, that again withers. Let it leave the whole tree, the whole tree dies.",
                "3": "11.3 Just so, dear one, when death comes and the Self Departs from the body, the body dies. But the Self dies not.” 11.1 “There is nothing that does not come from him. Of everything he is the inmost Self. He is the truth; he is the Self supreme.You are that, Shvetaketu; you are that.” “Please, Father, tell me more about this Self.”"
            },
            "12": {
                "1": "“Bring me a fruit from the nyagrodha tree.” “Here it is, sir.” 12.1 “Break it. What do you see?” “These seeds, Father, all exceedingly small.” “Break one. What do you see?” “Nothing at all.”",
                "2": "“That hidden essence you do not see, dear one, From that a whole nyagrodha tree will grow.",
                "3": " There is nothing that does not come from him. Of everything he is the inmost Self. He is the truth; he is the Self supreme. You are that, Shvetaketu; you are that.” 12.2 “Please, Father, tell me more about this Self.” “Yes, dear one, I will,” Uddalaka said."
            },
            "13": {
                "1": " “Place this salt in water and bring it here Tomorrow morning.” The boy did.”Where is that salt?” his father asked. “I do not see it.”",
                "2": "“Sip here. How does it taste?” “Salty, Father.” “And here? And there?” “I taste salt everywhere.” \f“It is everywhere, though we see it not. Just so, dear one, the Self is everywhere, Within all things, although we see him not.",
                "3": " There is nothing that does not come from him. Of everything he is the inmost Self. He is the truth; he is the Self supreme. You are that, Shvetaketu; you are that.” “Please, Father, tell me more about this Self.” “Yes, dear one, I will,” Uddalaka said."
            },
            "14": {
                "1": " “As a man from Gandhara, blindfolded, Led away and left in a lonely place, Turns to the east and west and north and south And shouts, ‘I am left here and cannot see!’",
                "2": " Until one removes his blindfold and says, ‘There lies Gandhara; follow that path,’ And thus informed, able to see for himself, The man inquires from village to village And reaches his homeland at last – just so, My son, one who finds an illumined teacher Attains to spiritual wisdom in the Self.",
                "3": " There is nothing that does not come from him. Of everything he is the inmost Self. He is the truth; he is the Self supreme. You are that, Shvetaketu; you are that.” “Please, Father, tell me more about this Self.” “Yes, dear one, I will,” Uddalaka said."
            },
            "15": {
                "1": "“When a man is dying, his family All gather round and ask, ‘Do you know me? Do you know me?’ And so long as his speech Has not merged in mind, his mind in prana, Prana in fire, and fire in pure Being,",
                "2": " \fHe knows them all. But there is no more knowing When speech merges in mind, mind in prana, Prana in fire, and fire in pure Being,",
                "3": " There is nothing that does not come from him. Of everything he is the inmost Self. He is the truth; he is the Self supreme. You are that, Shvetaketu; you are that.”"
            },
            "17": {
                "3": " Then Shvetaketu understood this teaching; Truly he understood it all."
            }
        },
        "chapter7": {
            "1": {
                "1": " Narada approached the sage Sanatkumara and said, “Please teach me, Venerable One.” 1.1 “Tell me what you know,” replied the sage, “and then I will teach you what is beyond that.”",
                "2": "“I know the four Vedas – Rig, Yajur, Sama, Atharva – and the epics, called the fifth. I have studied grammar, rituals, mathematics, astronomy, logic, economics, physics, psychology, the fine arts, and even snake-charming. ",
                "3": " But all this knowledge has not helped me to know the Self. I have heard from spiritual teachers like you that one who realizes the Self goes beyond sorrow. I am lost in sorrow. Please teach me how to go beyond.” 1.2 “Whatever you know is just words,” said Sanatkumara, “names of"
            },
            "23.1": "finite phenomena. 23.1 It is the Infinite that is the source of abiding joy because it is not subject to change. Therefore seek to know the Infinite.” “I seek to know the Infinite, Venerable One.”",
            "24": {
                "1": "“Where one realizes the indivisible unity of life, sees nothing else, hears nothing else, knows nothing else, that is the Infinite. Where one sees separateness, hears separateness, knows 24.1 \fseparateness, that is the finite. The Infinite is beyond death, but the finite cannot escape death.” “On what does the Infinite depend, Venerable One?”",
                "2": "“On its own glory – no, not even on that. 24.2 In the world people think they can attain glory by having cows and horses, elephants and gold, family and servants, fields and mansions. But I do not call that glory, for here one thing depends on another. Utterly independent is the Infinite."
            },
            "25": {
                "1": "“The Infinite is above and below, before and behind, to the right and to the left. I am all this. The Self is above and below, before and behind, to the right and to the left. I am all this. 25.2 One who",
                "2": "meditates upon the Self and realizes the Self sees the Self everywhere, and rejoices in the Self. Such a one lives in freedom and is at home wherever he goes. But those who pursue the finite are blind to the Self and live in bondage."
            },
            "26": {
                "1": "“One who meditates upon and realizes the Self discovers that everything in the cosmos – energy and space, fire and water, name and form, birth and death, mind and will, word and deed, mantram and meditation – all come from the Self.",
                "2": "“The Self is one, though it appears to be many. Those who meditate upon the Self and realize the Self go beyond decay and death, beyond separateness and sorrow. They see the Self in everyone and obtain all things. 26.2 “Control the senses and purify the mind. In a pure mind there is constant awareness of the Self. Where there is constant awareness of the Self, freedom ends bondage and joy ends sorrow.” Thus the sage Sanatkumara taught the pure Narada to go beyond bondage, beyond sorrow, beyond darkness, to the light of the Self."
            }
        },
        "chapter8": {
            "0": " In the city of Brahman is a secret dwelling, the lotus of the heart. Within this dwelling is a space, and within that space is the fulfillment of our desires. What is within that space should be longed for and realized.",
            "1": " As great as the infinite space beyond is the space within the lotus of the heart. Both heaven and earth are contained in that inner space, both fire and air, sun and moon, lightning and stars. Whether we know it in this world or know it not, everything is contained in that inner space. 1.3",
            "2": " Never fear that old age will invade that city; never fear that this inner treasure of all reality will wither and decay. This knows no age when the body ages; this knows no dying when the body dies. This is the real city of Brahman; this is the Self, free from old age, from death and grief, hunger and thirst. In the Self all desires are fulfilled. 1.5",
            "3": " The Self desires only what is real, thinks nothing but what is true. Here people do what they are told, becoming dependent on their country, or their piece of land, or the desires of another, 1.6 so their",
            "4": " desires are not fulfilled and their works come to nothing, both in this world and in the next. Those who depart from this world without knowing who they are or what they truly desire have no freedom here or hereafter. But those who leave here knowing who they are and what they truly desire have freedom everywhere, both in this world and in the next. Would they see their departed mother or father? Lo, they see them and are happy. 1.3–6 Would they see their family and friends?",
            "5": " Lo, they see them and are happy. Would they enjoy the world of music, of spring flowers, of elegance? Lo, by their mere will they enjoy these things. 1.10 Whatever they desire, the object of that",
            "6": " desire arises from the power of their own thoughts; they have it and are happy. 1.1–2",
            "7": " \fHere our selfless desires are hidden by selfish ones. They are real, but they are covered by what is false. Therefore whoever of our own departs from this life, not one can ever be brought back before our eyes. 3.2 But all those we love, alive or departed, and all things we desire",
            "8": " but do not have, are found when we enter that space within the heart; for there abide all desires that are true, though covered by what is false. 3.1",
            "9": " Like strangers in an unfamiliar country walking over a hidden treasure, day by day we enter the world of Brahman while in deep sleep but never find it, carried away by what is false. The Self is hidden in the lotus of the heart. Those who see themselves in all creatures go day by day into the world of Brahman hidden in the heart. 4 Established in peace, they rise above bodyconsciousness to the supreme light of the Self. Immortal, free from",
            "10": " fear, this Self is Brahman, called the True. 5 Beyond the mortal and",
            "11": " the immortal, he binds both worlds together. Those who know this live day after day in heaven in this very life. 3.3",
            "12": " The Self is a bulwark against the confounding of these worlds and a bridge between them. Day and night cannot cross that bridge, nor old age, nor death, nor grief, nor evil nor good deeds. All evils turn back there, unable to cross; evil comes not into this world of Brahman. 4.1",
            "13": " One who crosses by this bridge, if blind, is blind no more; if hurt, ceases to be hurt; if in sorrow, ceases sorrowing. At this boundary night itself becomes day: night comes not into this world of Brahman. 4.2",
            "14": " Only those who are pure and self-controlled can find this world of Brahman. That world is theirs alone. In that world, in all the worlds, they live in perfect freedom. 4.3",
            "15": " The Gods and the Godless \fThe great teacher Prajapati said: “The Self is pure, free from decay and death, free from hunger and thirst, and free from sorrow. The Self desires nothing that is not good, wills nothing that is not good. Seek and realize the Self! Those who seek and realize the Self fulfill all their desires and attain the goal supreme.” 7.1",
            "16": " The devas and the asuras, the gods and the godless, heard this truth and said: “Let us seek and realize the Self so that we may fulfill all our desires.” So Indra from among the gods and Virochana from among the godless approached Prajapati, carrying fuel in their hands as a sign that they wanted to become his disciples. 7.3 They",
            "17": " dwelt with him for thirty-two years, and at the end of that time Prajapati asked why they had stayed with him so long. 7.2",
            "18": " Indra and Virochana replied, “We have heard of your inspiring words: ‘The Self is pure, free from decay and death, free from hunger and thirst, and free from sorrow. The Self desires nothing that is not good, wills nothing that is not good. Seek and realize the Self! Those who seek and realize the Self fulfill all their desires and attain the goal supreme.’ We have been living here as your disciples because we want to realize the Self.” Prajapati said to them: “When you look into another’s eyes, what you see is the Self, fearless and deathless. That is Brahman, the supreme.” 7.4",
            "19": " “Venerable One,” asked the two disciples, “what is it we see reflected in the water or in a mirror?” “It is the Self you see in all these,” he said to them. 8.1 “Now look at yourself in a bowl of water, and ask me anything",
            "20": " you want to learn about the Self.” They looked at themselves in a bowl of water. “What did you see in the water?” “We have seen the Self, even the hair and the nails.” \f“Put on your best clothes, adorn your body, and look again in the water.” 8.2",
            "21": " They did so, and came back to Prajapati. “What did you see in the water?” he asked. “We have seen the Self, well dressed and well adorned,” they replied. 8.3",
            "22": " “That is the Self, fearless and deathless. That is Brahman, the supreme.” Indra and Virochana went away satisfied. 8.4 But Prajapati said to",
            "23": " himself: “They have seen the Self, but they have not recognized the Self. They mistake the Self to be the body. Those who think the Self is the body will lose their way in life.” Virochana, quite sure that the Self is the body, went back to the godless and began to teach them that the body alone is to be saved, the body alone is to be adored. He taught them that whoever lives for indulging the senses will find joy in this world and the next. 8.5",
            "24": " Even today people are called godless when they lack faith, love, and charity, because that is the way of the godless. They dress even dead bodies in fine clothes and adorn them with ornaments so that they may enjoy their life in the next world. But Indra, as he was on his way home to the gathering of the gods, began to question this knowledge. “If the Self is the same as the body, well dressed when the body is well dressed, well adorned when the body is well adorned, then the Self will be blind when the body is blind, lame when the body is lame, paralyzed when the body is paralyzed. And when the body dies, the Self too will die. In such knowledge I see no value.” 9.1",
            "25": " 9.2",
            "26": " Again Indra went back to Prajapati with fuel in hand. \f“Why have you returned, Indra?” his teacher asked. “Did you not go away quite satisfied?” “Venerable One,” replied Indra, “if the Self is well dressed when the body is well dressed, well adorned when the body is well adorned, then the Self will be blind when the body is blind, lame when the body is lame, paralyzed when the body is paralyzed. And when the body dies, the Self too will die. In such knowledge I see no value.” “You are thinking clearly, Indra,” said Prajapati. “Live with me for another thirty-two years and I will teach you more of the Self.” 9.3",
            "27": " So Indra lived with Prajapati for another thirty-two years. Then Prajapati said to him: 10.1 “That which moves about in joy in the",
            "28": " dreaming state is the Self, fearless and deathless. That is Brahman, the supreme.” Indra went away satisfied, but on his way home to the gathering of the gods he began to question this knowledge. “In the dreaming state, it is true, the Self is not blind when the body is blind, nor lame when the body is lame, nor paralyzed when the body is paralyzed, 10.2 nor slain when the body is slain. Yet in dreams the Self may",
            "29": " appear to suffer and to be slain; it may become conscious of pain and even weep. In such knowledge I see no value.” 10.3",
            "30": " Again Indra went back to Prajapati with fuel in hand. “Why have you returned, Indra?” his teacher asked. “Did you not go away quite satisfied?” “Venerable One,” replied Indra, “in the dreaming state, it is true, the Self is not blind when the body is blind, nor lame when the body is lame; yet in this state the Self may still suffer and even weep. In such knowledge I see no value.” “You are thinking clearly, Indra,” said Prajapati. “Live with me for another thirty-two years and I will teach you more of the Self.” 10.4",
            "31": " \fIndra lived with Prajapati for another thirty-two years. Then his teacher said: “When a person is sleeping soundly, free from dreams, with a still mind, that is the Self, fearless and deathless. That is Brahman, the supreme.” 11.1",
            "32": " Indra went away satisfied, but on his way home to the gathering of the gods he began to question this knowledge. “In the state of dreamless sleep one is not aware of oneself or any other. The state of dreamless sleep is very close to extinction. In this knowledge I see no value.” 11.2",
            "33": " Again Indra went back to Prajapati with fuel in hand. “Why have you returned, Indra?” his teacher asked. “Did you not go away quite satisfied?” “Venerable One”, replied Indra, “in the state of dreamless sleep one is not aware of oneself or of any other. The state of dreamless sleep is very close to extinction. In this knowledge I see no value.” “You are thinking clearly, Indra,” said Prajapati. “Live with me for another five years and I will teach you to realize the Self.” 11.3",
            "34": " Indra lived with Prajapati for another five years. Altogether he lived with his teacher for one hundred and one years, which is why people say, “Even Indra had to live with his teacher for one hundred and one years.” After that time, Prajapati revealed the highest truth of the Self to Indra: “It is true the body is perishable, but within it dwells the imperishable Self. This body is subject to pleasure and pain; no one who identifies with the body can escape from pleasure and pain. But those who know they are not the body pass beyond pleasure and pain to live in abiding joy. 12.1",
            "35": " \f“Like the wind, like clouds, like thunder and lightning, which rise from space without physical shape and reach the transcendent light in their own form, those who rise above body-consciousness ascend to the transcendent light in their real form, the Self. 12.2",
            "36": " “In that state, free from attachment, they move at will, laughing, playing, and rejoicing. They know the Self is not this body, but only tied to it for a time as an ox is tied to its cart. Whenever one sees, smells, speaks, hears, or thinks, they know it is the Self that sees, smells, speaks, hears, and thinks; the senses are but his instruments. “Worshipping this Self in the world of Brahman, the gods obtained all worlds and all desires. Those who know this Self and realize this Self obtain all worlds and all desires.” So said Prajapati; so taught Prajapati. A Paean of Illumination From the Divine Dark to the manifest To the Divine Dark I pass again. As a horse shakes free its mane, I have Shaken off all evil. Freeing myself From the bonds of birth and death as the moon Escapes from Rahu’s mouth, I have attained The pure realm of Brahman; I have attained The pure realm of Brahman. 13.1",
            "37": " Brahman is my home. I shall not lose it. Truly I shall not be lost again. 15.1",
            "38": " OM"
        }
    },
    "SHVESTASHVATARA": {
        "i": {
            "1": " What is the cause of the cosmos? Is it Brahman? From where do we come? By what live? Where shall we find peace at last? What power governs the duality Of pleasure and pain by which we are driven?",
            "2": " Time, nature, necessity, accident, Elements, energy, intelligence – None of these can be the First Cause. They are effects, whose only purpose is To help the self rise above pleasure and pain.",
            "3": " In the depths of meditation, sages Saw within themselves the Lord of Love, Who dwells in the heart of every creature. Deep in the hearts of all he dwells, hidden Behind the gunas of law, energy, And inertia. He is One. He it is Who rules over time, space, and causality.",
            "4": "",
            "5": " The world is the wheel of God, turning round \fAnd round with all living creatures upon its rim.",
            "6": " Flowing from him and flowing back to him. On this ever-revolving wheel of life The individual self goes round and round Through life after life, believing itself To be a separate creature, until It sees its identity with the Lord of Love And attains immortality in the indivisible whole.",
            "7": " He is the eternal reality, sing The scriptures, and the ground of existence. Those who perceive him in every creature Merge in him and are released from the wheel Of birth and death.",
            "8": " The Lord of Love holds in his hand the world, Composed of the changing and the changeless, The manifest and the unmanifest. The separate self, not yet aware of the Lord, Goes after pleasure, only to become Bound more and more. When it sees the Lord, There comes an end to its bondage.",
            "9": " Conscious spirit and unconscious matter Both have existed since the dawn of time, With maya appearing to connect them, Misrepresenting joy as outside us. When all these three are seen as one, the Self Reveals his universal form and serves As an instrument of the divine will.",
            "10": " All is change in the world of the senses, But changeless is the supreme Lord of Love. Meditate on him, be absorbed in him, Wake up from this dream of separateness.",
            "11": " \fKnow God and all fetters will fall away. No longer identifying yourself With the body, go beyond birth and death. All your desires will be fulfilled in him Who is One without a second.",
            "12": " Know him to be enshrined in your heart always. Truly there is nothing more in life to know. Meditate and realize that this world Is filled with the presence of God.",
            "13": " Fire is not seen until one firestick rubs Against another, though the fire remains Hidden in the firestick. So does the Lord Remain hidden in the body until He is revealed through the mystic mantram.",
            "14": " Let your body be the lower firestick; Let the mantram be the upper. Rub them Against each other in meditation And realize the Lord.",
            "15": " Like oil in sesame seeds, like butter In cream, like water in springs, like fire In firesticks, so dwells the Lord of Love, The Self, in the very depths of consciousness. Realize him through truth and meditation.",
            "16": " The Self is hidden in the hearts of all, As butter lies hidden in cream. Realize The Self in the depths of meditation, The Lord of Love, supreme reality, Who is the goal of all knowledge. This is the highest mystical teaching; This is the highest mystical teaching."
        },
        "ii": {
            "1": " \fMay we harness body and mind to see The Lord of Life, who dwells in everyone.",
            "2": " Strive for blissful union with the Lord.",
            "3": " Through the practice of meditation.",
            "4": " Great is the glory of the Lord of Life, Infinite, omnipresent, all-knowing. He is known by the wise who meditate And conserve their vital energy.",
            "5": " Hear, O children of immortal bliss! You are born to be united with the Lord. Follow the path of the illumined ones And be united with the Lord of Life.",
            "6": " Kindle the fire of kundalini deep In meditation. Bring your mind and breath Under control. Drink deep of divine love, And you will attain the unitive state.",
            "7": " Dedicate yourself to the Lord of Life, Who is the cause of the cosmos. He will Remove the cause of all your suffering And free you from the bondage of karma.",
            "8": " Be seated with spinal column erect And turn your mind and senses deep within. With the mantram echoing in your heart, Cross over the dread sea of birth and death.",
            "9": " Train your senses to be obedient. Regulate your activities to lead you To the goal. Hold the reins of your mind As you hold the reins of restive horses.",
            "10": " \fChoose a place for meditation that is Clean, quiet, and cool, a cave with a smooth floor Without stones and dust, protected against Wind and rain and pleasing to the eye.",
            "11": " In deep meditation aspirants may See forms like snow or smoke. They may feel A strong wind blowing or a wave of heat. They may see within them more and more light: Fireflies, lightning, sun, or moon. These are signs That they are well on their way to Brahman.",
            "12": " Health, a light body, freedom from cravings, A glowing skin, sonorous voice, fragrance Of body: these signs indicate progress In the practice of meditation.",
            "13": " As a dusty mirror shines bright when cleansed, So shine those who realize the Self, Attain life’s goal, and pass beyond all sorrow.",
            "14": " They realize the presence of the Lord Within their heart. Freed from impurities, They pass forever beyond birth and death.",
            "15": " The Lord dwells in the womb of the cosmos, The Creator who is in all creatures. He is that which is born and to be born; His face is everywhere.",
            "16": " Let us adore the Lord of Life, who is Present in fire and water, plants and trees. Let us adore the Lord of Life! Let us adore the Lord of Life!"
        },
        "iii": {
            "1": " Brahman, attributeless Reality, \fBecomes the Lord of Love who casts his net Of appearance over the cosmos and rules It from within through his divine power. He was before creation; he will be After dissolution. He alone is. Those who know him become immortal. The Lord of Love is one. There is indeed No other. He is the inner ruler In all beings. He projects the cosmos From himself, maintains and withdraws it Back into himself at the end of time.",
            "2": " His eyes, mouths, arms, and feet are everywhere. Projecting the cosmos out of himself, He holds it all together.",
            "3": " He is the source of all the powers of life. He is the lord of all, the great seer Who dwells forever in the cosmic womb. May he purify our consciousness!",
            "4": " O Lord, in whom alone we can find peace, May we see your divine Self and be freed From all impure thoughts and all fear.",
            "5": " O Lord, from whom we receive the mantram As a weapon to destroy our self-will, Reveal yourself, protector of all.",
            "6": " You are the supreme Brahman, infinite, Yet hidden in the hearts of all creatures. You pervade everything. Realizing you, We attain immortality.",
            "7": " I have realized the Lord of Love, Who is the sun that dispels our darkness.",
            "8": " \fThose who realize him go beyond death; No other way is there to immortality. There is nothing higher than him, nothing other Than him. His infinity is beyond great And small. In his own glory rooted, He stands and fills the cosmos.",
            "9": " He fills the cosmos, yet he transcends it. Those who know him leave all separateness, Sorrow, and death behind. Those who know him not Live but to suffer.",
            "10": " The Lord of Love, omnipresent, dwelling In the heart of every living creature, All mercy, turns every face to himself.",
            "11": " He is the supreme Lord, who through his grace Moves us to seek him in our own hearts. He is the light that shines forever.",
            "12": " He is the inner Self of all, Hidden like a little flame in the heart. Only by the stilled mind can he be known. Those who realize him become immortal.",
            "13": " He has thousands of heads, thousands of eyes, Thousands of feet; he surrounds the cosmos",
            "14": " Is ever present in the hearts of all. He has become the cosmos. He is what was And what will be. Yet he is unchanging, The lord of immortality.",
            "15": " His hands and feet are everywhere; his heads And mouths everywhere. He sees everything, Hears everything, and pervades everything.",
            "16": " \fWithout organs of sense, he shines through them. He is the lord of all, inner ruler, Protector and friend of all.",
            "17": " He resides in the city with nine gates, Which is the body. He moves in the world Enjoying the play of his countless forms. He is the master of the universe, Of animate and inanimate.",
            "18": " He runs without feet and holds without hands. He sees without eyes and hears without ears. He knows everyone, but no one knows him. He is called the First, the Great, the Supreme.",
            "19": " The Lord of Love is hidden in the heart Of every creature, subtler than the subtlest, Greater than the greatest. Through his grace One sheds all selfish desires and sorrow And becomes united with the Self.",
            "20": " I know this Self, sage Shvetashvatara said, To be immortal and infinite. I know this Self who is the Self of all, Whom the sages call the Eternal One."
        },
        "iv": {
            "1": " May the Lord of Love, who projects himself Into this universe of myriad forms, From whom all beings come and to whom all Return – may he grant us the grace of wisdom.",
            "2": " He is fire and the sun, and the moon And the stars. He is the air and the sea, And the Creator, Prajapati.",
            "3": " \fHe is this boy, he is that girl, he is This man, he is that woman, and he is This old man, too, tottering on his staff. His face is everywhere.",
            "4": " He is the blue bird; he is the green bird With red eyes; he is the thundercloud, And he is the seasons and the seas. He has no beginning; he has no end. He is the source from whom the worlds evolve.",
            "5": " From his divine power comes forth all this Magical show of name and form, of you And me, which casts the spell of pain and pleasure. Only when we pierce through this magic veil Do we see the One who appears as many.",
            "6": " Two birds of beautiful plumage, comrades Inseparable, live on the selfsame tree. One bird eats the fruit of pleasure and pain; The other looks on without eating.",
            "7": " Forgetting our divine origin, We become ensnared in the world of change And bewail our helplessness. But when We see the Lord of Love in all his glory, Adored by all, we go beyond sorrow.",
            "8": " What use are the scriptures to anyone Who knows not the one source from whom they come, In whom all gods and worlds abide? Only those who realize him as ever present Within the heart attain abiding joy.",
            "9": " The Lord, who is the supreme magician, Brings forth out of himself all the scriptures, Oblations, sacrifices, spiritual disciplines,",
            "10": " \fPast and present, and the whole universe. Invisible through the magic of maya, He remains hidden in the hearts of all. Know him to be the supreme magician Who has brought all the worlds out of himself. Know that all beings in the universe Partake of his divine splendor.",
            "11": " Know him to be the supreme magician Who has become boy and girl, bird and beast. He is the bestower of all blessings, And his grace fills the heart with peace profound.",
            "12": " Know him to be the supreme source of all The gods, sole support of the universe, The sower of the golden seed of life. May he grant us the grace of wisdom.",
            "13": " Know him to be the supreme God of gods From whom all the worlds draw the breath of life. He rules every creature from within. May he be worshipped by everyone.",
            "14": " Know him to be the supreme pervader, In whom the whole universe is smaller Than the smallest atom. May he, Shiva, Fill our hearts with infinite peace.",
            "15": " Know him to be the supreme guardian Of the cosmos, protecting all creatures From within. May he, Shiva, in whom all Are one, free us from the bonds of death.",
            "16": " Know him to be the Supreme One, hidden Within the hearts of all like cream in milk And yet encompassing the universe.",
            "17": " \fMay he, Shiva, free us from all bondage. Know him to be the supreme architect Who is enshrined within the hearts of all. Know him in the depths of meditation. May he grant us immortality.",
            "18": " Know him to be the supreme source of all Religions, ruler of the world of light, Where there is neither day nor night, Neither what is nor what is not, but only Shiva.",
            "19": " He alone is. His glory fills all worlds.",
            "20": " He is far beyond the reach of the eye. He alone is. May he, Shiva, reveal Himself in the depths of meditation And grant us immortality.",
            "21": " I live in fear of death, O Lord of Love; I seek refuge at your feet. Protect me; Protect us man and woman, cow and horse. May the brave ones who seek you be released From the bondage of death."
        },
        "v": {
            "1": " To know the unity of all life leads To deathlessness; to know not leads to death. Both are hidden in the infinity Of Brahman, who is beyond both.",
            "2": " He is the One who presides over all And rules over everyone from within. He sows the golden seed of life when time begins And helps us know its unity.",
            "3": "He is the Lord who casts the net of birth \fAnd death and withdraws it again, The supreme Self who governs the forces of life. ",
            "4": " As the sun shines and fills all space with light, Above, below, across, so shines the Lord Of Love and fills the hearts of all created beings.",
            "5": " From him the cosmos comes, he who teaches Each living creature to attain perfection According to its own nature. He is The Lord of Love who reigns over all life.",
            "6": " He is the supreme creator, hidden Deep in the mystery of the scriptures. By realizing him the gods and sages Attained immortality.",
            "7": " Under the hypnotic spell of pleasure And pain, we live for ourselves and are bound. Though master of ourselves, we roam about From birth to birth, driven by our own deeds.",
            "8": " The Self, small as the thumb, dwelling in the heart, Is like the sun shining in the sky. But when identified with the ego, The Self appears other than what it is.",
            "9": " It may appear smaller than a hairs breadth. But know the Self to be infinite.",
            "10": " Not female, male, nor neuter is the Self. As is the body, so is the gender.",
            "11": " Attachments, and delusions, and is Born again and again in new bodies To work out the karma of former lives.",
            "12": " The embodied self assumes many forms, \fHeavy or light, according to its needs For growth and the deeds of previous lives. This evolution is a divine law.",
            "13": " Love the Lord and be free. He is the One Who appears as many, enveloping The cosmos, without beginning or end. None but the pure in heart can realize him.",
            "14": " May Lord Shiva, creator, destroyer, The abode of all beauty and wisdom, Free us from the cycle of birth and death."
        },
        "vi": {
            "1": " The learned say life is self-created; Others say life evolved from time. In truth The Lord brought the cosmos out of himself.",
            "2": " He is pure consciousness, omnipresent, Omnipotent, omniscient, creator Of time and master of the three gunas. Evolution takes place at his command.",
            "3": " Those who act without thought of personal Profit and lead a well-disciplined life Discover in course of time the divine Principle that all forms of life are one.",
            "4": " Are freed from the law of karma.",
            "5": " Know him to be the primal source of life Whose glory permeates the universe, Who is beyond time and space, yet can be Seen within the heart in meditation.",
            "6": " Know him to be beyond the tree of life, Whose power makes all the planets revolve:",
            "7": " \fWho is both law and mercy, yet can be Seen within the heart in meditation. Know him to be the supreme Lord of lords, King of kings, God of gods, ruler of all,",
            "8": " Whose power is seen in myriad ways.",
            "9": " Know him to be the cause without a cause, Without a second, parent or master.",
            "10": " In his creatures like a spider in its web, Grant us illumination.",
            "11": " The Lord is hidden in the hearts of all. The eternal witness, pure consciousness, He watches our work from within, beyond The reach of the gunas.",
            "12": " The Lord is the operator; we are But his innumerable instruments. May we realize him in our consciousness And find the bliss he alone can give us.",
            "13": " Changeless amidst the changing, consciousness Of the conscious, he grants all our prayers. May we realize him in our consciousness And find the freedom he alone can give us.",
            "14": " There shines not the sun, neither moon nor star, Nor flash of lightning, nor fire lit on earth. Everything reflects the light of the Lord.",
            "15": " May we realize him in our consciousness; There is no other way to conquer death.",
            "16": " He is the maker of the universe, Self-existent, omniscient, destroyer Of death, the source and inmost Self of all, Ruler of the cycle of birth and death. May we realize him in our consciousness; There is no other way to conquer death.",
            "17": " He is the protector of the cosmos, All glory, all-knowing, omnipresent. How could there be any ruler but he? May we realize him in our consciousness; There is no other way to conquer death.",
            "18": " Lord Shiva is my refuge, he who grants Freedom from the cycle of birth and death. Lord Shiva is my refuge, he who gave The sacred scriptures at the dawn of time.",
            "19": " Lord Shiva is my refuge, he who is The source of purity and perfection. Lord Shiva is my refuge, he who is The bridge from death to immortality. Lord Shiva is my refuge, he whose grace Has made me long for his lotus feet.",
            "20": " How can we roll up the sky like a piece Of deerskin? How can we end our misery Without realizing the Lord of Love who Is enshrined in our heart of hearts?",
            "21": " Sage Shvetashvatara realized the Lord In meditation through infinite grace And imparted this highest wisdom To devoted disciples.",
            "22": " This highest mystical experience, Revealed at the dawn of time, must be shared Only with one whose heart is pure Or with a disciple or ones own child.",
            "23": " If you have deep love for the Lord of Love And for your teacher, the light of this teaching Will shine in your heart. It will shine indeed!"
        }
    },
    "MUNDAKA": {
        "1.1": {
            "1": " From infinite Godhead came forth Brahma, First among gods, from whom sprang the cosmos. Brahma gave the vision of the Godhead, The true source of wisdom that life demands,",
            "2": " To Angi. In turn Angi gave it To Satyavaha. In this tradition Satyavaha gave it to Angiras.",
            "3": " A great householder named Shaunaka once came To Angiras and reverently asked: “What is that by knowing which all is known?”",
            "4": " Knowledge is twofold, higher and lower.",
            "5": " Rituals, astronomy, and all the arts Can be called lower knowledge. The higher Is that which leads to Self-realization.",
            "6": " “The eye cannot see it; mind cannot grasp it. The deathless Self has neither caste nor race, Neither eyes nor ears nor hands nor feet. Sages say this Self is infinite in the great And in the small, everlasting and changeless, The source of life.",
            "7": " “As the web issues out of the spider And is withdrawn, as plants sprout from the earth,",
            "8": " \fAs hair grows from the body, even so, The sages say, this universe springs from The deathless Self, the source of life. “The deathless Self meditated upon Himself and projected the universe As evolutionary energy. From this energy developed life, mind, The elements, and the world of karma, Which is enchained by cause and effect.",
            "9": " “The deathless Self sees all, knows all. From him Springs Brahma, who embodies the process Of evolution into name and form By which the One appears to be many.”"
        },
        "1.2": {
            "1": " The rituals and the sacrifices described In the Vedas deal with lower knowledge. The sages ignored these rituals And went in search of higher knowledge.",
            "2": " Look at these rituals: When the fire is lit, Pour butter into the fire in two spots; Then place the offering between these two. These oblations will take the worshipper",
            "3": " Where he can have his fill of enjoyment.",
            "4": " Such rituals are unsafe rafts for crossing The sea of samsara, of birth and death. Doomed to shipwreck are those who try to cross The sea of samsara on these poor rafts.",
            "5": " In their own esteem, these deluded men Proud of their vain learning go round and round Like the blind led by the blind.",
            "6": " \fLiving in darkness, immature, unaware Of any higher good or goal, they fall Again and again into the sea.",
            "7": " But those who are pure in heart, who practice Meditation and conquer their senses And passions, shall attain the immortal Self, Source of all light and source of all life.",
            "8": " Action prompted by pleasure or profit Cannot help anyone to cross this sea. Seek a teacher who has realized the Self.",
            "9": " Who has conquered his senses and passions, The teacher will reveal the Lord of Love."
        },
        "2.1": {
            "1": " Imperishable is the Lord of Love. As from a blazing fire thousands of sparks Leap forth, so millions of beings arise From the Lord of Love and return to him.",
            "2": " The Lord of Love is above name and form. He is present in all and transcends all. Unborn, without body and without mind, From him comes every body and mind.",
            "3": " He is the source of space, air, fire, water, And the earth that holds us all",
            "4": " Fire is his head, the sun and moon his eyes, The heavens his ears, the scriptures his voice, The air his breath, the universe his heart, And the earth his footrest. The Lord of Love Is the innermost Self of all.",
            "5": " \fFrom him comes the fire that burns in the sun; From the sky lit by sun and moon comes rain; From rain comes food, from food the sexual seed; All finally come from the Lord of Love.",
            "6": " From him come the scriptures, chants, and prayers, Religious rites and sacrificial gifts; From him come work, time, and givers of gifts, And all things under the sun and moon.",
            "7": " From him come the gods of the natural world, Men, beasts, and birds, and food to nourish them; From him come all spiritual disciplines, Meditation, truth, faith, and purity.",
            "8": " From him come the seven organs of sense, Seven hot desires and their sevenfold objects, And the seven levels of consciousness In the cavern of the heart.",
            "9": " From him come all the seas and the mountains, The rivers and the plants that support life. As the innermost Self of all, he dwells Within the cavern of the heart.",
            "10": " The Lord of Love is the one Self of all. He is detached work, spiritual wisdom, And immortality. Realize the Self Hidden in the heart, and cut asunder The knot of ignorance here and now."
        },
        "2.2": {
            "1": " Bright but hidden, the Self dwells in the heart. Everything that moves, breathes, opens, and closes Lives in the Self. He is the source of love And may be known through love but not through thought. He is the goal of life. Attain this goal!",
            "2": " \fThe shining Self dwells hidden in the heart. Everything in the cosmos, great and small, Lives in the Self. He is the source of life, Truth beyond the transience of this world. He is the goal of life. Attain this goal!",
            "3": " Take the great bow of the sacred scriptures, Place on it the arrow of devotion; Then draw the bowstring of meditation And aim at the target, the Lord of Love.",
            "4": " Is the arrow, and the Lord the target. Now draw the bowstring of meditation, And hitting the target be one with him.",
            "5": " In his robe are woven heaven and earth, Mind and body. Realize him as the One Behind the many and stop all vain talk. He is the bridge from death to deathless life.",
            "6": " Where all the nerves meet like spokes in a wheel, There he dwells, the One behind the many. Meditate upon him in the mantram. May he guide us from death to deathless life!",
            "7": " He knows everyone and sees everything. It is his glory that fills the cosmos. He resides in the city of the heart.",
            "8": " It is his power that moves body and mind. May he guide us from death to deathless life!",
            "9": " When he is seen within us and without, He sets right all doubts and dispels the pain Of wrong actions committed in the past.",
            "10": " In the golden city of the heart dwells The Lord of Love, without parts, without stain. Know him as the radiant light of lights.",
            "11": " There shines not the sun, neither moon nor star, Nor flash of lightning, nor fire lit on earth. The Lord is the light reflected by all. He shining, everything shines after him.",
            "12": " The Lord of Love is before and behind. He extends to the right and to the left. He extends above; he extends below. There is no one here but the Lord of Love. He alone is; in truth, he alone is."
        },
        "3.1": {
            "1": " Like two golden birds perched on the selfsame tree, Intimate friends, the ego and the Self Dwell in the same body. The former eats The sweet and sour fruits of the tree of life While the latter looks on in detachment.",
            "2": " As long as we think we are the ego, We feel attached and fall into sorrow. But realize that you are the Self, the Lord Of life, and you will be freed from sorrow.",
            "3": " Supreme source of light, supreme source of love, You transcend the duality of life And enter into the unitive state.",
            "4": " Seeing him in all creatures, the wise Forget themselves in the service of all. The Lord is their joy, the Lord is their rest; Such as they are the lovers of the Lord.",
            "5": " By truth, meditation, and self-control One can enter into this state of joy And see the Self shining in a pure heart.",
            "6": " \fTruth is victorious, never untruth. Truth is the way; truth is the goal of life, Reached by sages who are free from self-will.",
            "7": " The effulgent Self, who is beyond thought, Shines in the greatest, shines in the smallest, Shines in the farthest, shines in the nearest, Shines in the secret chamber of the heart.",
            "8": " Beyond the reach of the senses is he, But not beyond the reach of a mind stilled Through the practice of deep meditation.",
            "9": " But not beyond the reach of a pure heart Freed from the sway of the senses.",
            "10": " Sages are granted all the help they need In everything they do to serve the Lord. Let all those who seek their own fulfillment Love and honor the illumined sage."
        },
        "3.2": {
            "1": " The wise have attained the unitive state, And see only the resplendent Lord of Love. Desiring nothing in the physical world, They have become one with the Lord of Love.",
            "2": " Those who dwell on and long for sense-pleasure Are born in a world of separateness. But let them realize they are the Self And all separateness will fall away.",
            "3": " Not through discourse, not through the intellect, Not even through study of the scriptures Can the Self be realized. The Self reveals Himself to the one who longs for the Self.",
            "4": " \fThose who long for the Self with all their heart Are chosen by the Self as his own. Not by the weak, not by the unearnest, Not by those who practice wrong disciplines Can the Self be realized. The Self reveals Himself as the Lord of Love to the one Who practices right disciplines.",
            "5": " What the sages sought they have found at last. No more questions have they to ask of life. With self-will extinguished, they are at peace. Seeing the Lord of Love in all around, Serving the Lord of Love in all around, They are united with him forever.",
            "6": " They have attained the summit of wisdom By the steep path of renunciation. They have attained to immortality And are united with the Lord of Love.",
            "7": " Returns to the cosmic womb, but their work Becomes a beneficial force in life To bring others together in the Self.",
            "8": " The flowing river is lost in the sea; The illumined sage is lost in the Self. The flowing river has become the sea; The illumined sage has become the Self.",
            "9": " Those who know the Self become the Self. None in their family forgets the Self. Freed from the fetters of separateness, They attain to immortality.",
            "10": " Let this wisdom be taught only to those Who obey the law of life’s unity.",
            "11": " \fLet this wisdom be taught only to those Who offer their lives to the Lord of Love. This is the great truth taught in ancient times By the sage Angiras to Shaunaka. Let us adore the illumined sages! Let us adore the illumined sages! OM shanti shanti shanti"
        }
    },
    "MANDUKYA": {
        "intro": "The Mandukya is the briefest of the major Upanishads. Shankara declared\nthat if one could only study a single Upanishad it should be this one, and we\ncan see why: in its succinctness the Mandukya captures the essentials of\nmystical insight. One of the four Upanishadic mahavakyas, “great sayings”\nthat are packed into a brief formulaic utterance, occurs in the second verse:\nayam atma brahma, “the Self is Brahman.” This is probably why, in a much\nlater text, Rama tells a devotee that “the Mandukya alone is sufficient for\ndeliverance,” though less advanced seekers will have to read the ten\nprincipal Upanishads, or thirty-two, or all one hundred and eight.\nThe twelve verses of the Mandukya revolve around a fundamental\nproposition underlying the entire Vedantic worldview and mysticism\ngenerally: that one Reality (called Brahman in the Upanishads) has become\nthe infinite variety of shifting things that we experience around us in the\nuniverse or within us as the various states of our own consciousness. The\nlatter field of investigation forms the first of two passes through this basic\nidea that make up this text. In this pass we are walked through the four\nstates of consciousness that we all experience: the waking state, dreaming\nsleep, dreamless sleep, in which the autonomic nervous system rests, and\nfinally an indescribable state of consciousness the text calls simply turiya,\n“the fourth.” Like many such series in the Upanishads, these stages are\nsteps from the everyday reality to the supreme experience. In this final state\nthe sense of “I” is temporarily suspended. Surprisingly, the Upanishad tells\nus that we enter this state regularly, if we could only be aware of it: every\nnight we are “like someone unknowingly walking back and forth over a\nburied treasure” (Chandogya VIII.3.2). So near and yet so far.\nBut we have already been told, in the opening verse, that the supreme\nreality into which we merge in the “fourth” state is also represented by the\n\fsacred syllable AUM. So the sage takes another pass through the stages of\nbeing where the three “worlds” or orders of reality are seen in the sounds of\nthis sacred syllable – a, u, and m – as it is manifested in the phenomenal\nworld.\nIt is very common for an Upanishad to present us with multiple passes\nlike this through levels of reality reminiscent of what in the Middle Ages\nwas called the Great Chain of Being. What is different here is that the\nMandukya hints that there is a way to climb that chain. AUM stands for the\nmantram – a form of sacred utterance, like the repetition of a name of God,\nused in every major spiritual tradition to still the mind and become aware of\nthe divine Reality to which it refers. All mantrams, according to the\nMandukya, go back to AUM, and then beyond even that primordial energy to\nBrahman, the ultimate goal of spiritual progress.\nSo the Upanishad first gives us an inspiring picture of “that which is,”\nreassuring us that reality is not limited to the world of changing phenomena,\nand then hints at an everyday, doable way to reascend the orders of being\nand regain our spiritual home in the changeless. Shankara did well to praise\nthe condensed power of this Upanishad. –M.N.",
        "upnishads": {
            "1": " AUM stands for the supreme Reality. It is a symbol for what was, what is, And what shall be. AUM represents also What lies beyond past, present, and future.",
            "2": " Brahman is all, and the Self is Brahman. This Self has four states of consciousness.",
            "3": " The first is called Vaishvanara, in which One lives with all the senses turned outward, Aware only of the external world.",
            "4": " Taijasa is the name of the second, The dreaming state in which, with the senses Turned inward, one enacts the impressions Of past deeds and present desires.",
            "5": " The third state is called Prajna, of deep sleep, In which one neither dreams nor desires. There is no mind in Prajna, there is no Separateness; but the sleeper is not Conscious of this. Let him become conscious In Prajna and it will open the door To the state of abiding joy.",
            "6": " \fPrajna, all-powerful and all-knowing, Dwells in the hearts of all as the ruler. Prajna is the source and end of all.",
            "7": " The fourth is the superconscious state called Turiya, neither inward nor outward, Beyond the senses and the intellect, In which there is none other than the Lord. He is the supreme goal of life. He is Infinite peace and love. Realize him!",
            "8": " Turiya is represented by AUM. Though indivisible, it has three sounds.",
            "9": " A stands for Vaishvanara. Those who know this, Through mastery of the senses, obtain The fruit of their desires and attain greatness.",
            "10": " U indicates Taijasa. Those who know this, By mastering even their dreams, become Established in wisdom. In their family Everyone leads the spiritual life.",
            "11": " M corresponds to Prajna. Those who know this, By stilling the mind, find their true stature And inspire everyone around to grow.",
            "12": " The mantram AUM stands for the supreme state Of turiya, without parts, beyond birth And death, symbol of everlasting joy. Those who know AUM as the Self become the Self; Truly they become the Self."
        }
    },
    "KENA": {
        "intro": "At a conference held in New Orleans some years ago, physicists were\nchallenged to explain why there were no pioneers on the order of Einstein,\nBohr, and Heisenberg any more. One young physicist pointed out that the\ncomparison was a bit unfair. Those bold visionaries had been exploring the\nworld outside, while his generation was faced with the infinitely harder task\nof querying, Who is the investigator? How is the mind, our instrument of\nknowing, supposed to turn around and know itself?\nIn India it seems that this point had been reached and crossed very early.\nFundamental questions about reality are found even as early as the Rig\nVeda:\nWhat was all this before creation?\nWas there water?\nOnly God knows, or perhaps he knows not . . . (X.129)\nBy the time we reach the Upanishads this kind of questioning is no longer\nspeculative but has become a systematic and relentless pursuit of truth, and\nit embraced the realization that to know truth we have to come to grips with\nthe medium of knowing and the identity of the knower.\nThis is the realization that turns mere knowing into realization, objective\nscience into mystical awareness. There is a Sufi story about a seeker who\ncalls on Allah day in and day out for years and finally throws himself down\nand sobs, “How long have I been calling and you do not answer!” Then he\nhears a voice: “Who do you think has been making you call me?”\nKena, the title and opening word of the present Upanishad, means “by\nwhom?” – that is, impelled by whom do all the motions of life stir? Or in\n\fShankara’s brilliant paraphrase, “By whose mere presence does that desire\narise which moves the universe?”\nThe text’s answer is clear. The first thirteen verses declare, “He is the ear\nof the ear”: that is, that which moves the world is consciousness, which in\nthe human being becomes cognition, among other vital functions. Note that\namong the powers that operate our senses we meet “that which makes the\nmind think.” Mind was a sense, in the Vedantic worldview, in fact, the chief\nsense. This is a little easier to understand when we take into account that the\nword we translate as “sense” is actually indriya, “power, faculty.”\nThen comes a parable. Among the gods (the faculties of perception) only\nIndra has the staying power to merit instruction from the goddess of\nwisdom, Uma, the divine consort of Shiva. She teaches that the victory of\nthe Vedic gods over their adversaries (the creative triumph of order over\nchaos) has not been theirs but that of the supreme power working through\nthem. This is an allegory of the message which sent the Isha Upanishad so\ndeeply into Gandhi’s consciousness, about acting without attachment to the\nresults. The victory of good over evil is guaranteed – but not by the doer.\nWe cannot win that victory, but we can make ourselves instruments of it,\nprecisely by not thinking of ourselves as the doers but by “making\nourselves zero,” in Gandhi’s phrase. This is an immediate, practical\nconsequence of the realization that we are not really the ultimate doer of\nany of “our” actions, including the act of knowing: “It is the power of\nBrahman that makes the mind to think . . .Therefore, use this power to\nmeditate on Brahman” (IV.5–6).\nWith an assurance that this truth is all the seeker need discover, the Kena\nends. –M.N.",
        "i": {
            "1": " Who makes my mind think?\n Who fills my body with vitality? \nWho causes my tongue to speak? Who is that\n Invisible one who sees through my eyes \nAnd hears through my ears?",
            "2": " The Self is the ear of the ear,\nThe eye of the eye, the mind of the mind,\nThe word of words, and the life of life.\n Rising above the senses and the mind\n And renouncing separate existence,\n The wise realize the deathless Self.",
            "3": " Him our eyes cannot see, nor words express;\nHe cannot be grasped even by the mind.\nWe do not know, we cannot understand, 4 Because he is different from the known\nAnd he is different from the unknown.\nThus have we heard from the illumined ones.",
            "4": " Because he is different from the known\nAnd he is different from the unknown.\nThus have we heard from the illumined ones.",
            "5": " That which makes the tongue speak but cannot be\n Spoken by the tongue, know that as the Self.\n This Self is not someone other than you.",
            "6": " That which makes the mind think but cannot be Thought by the mind, that is the Self indeed. This Self is not someone other than you.",
            "7": " That which makes the eye see but cannot be Seen by the eye, that is the Self indeed. This Self is not someone other than you.",
            "8": " That which makes the ear hear but cannot be Heard by the ear, that is the Self indeed. This Self is not someone other than you.",
            "9": " That which makes you draw breath but cannot be Drawn by your breath, that is the Self indeed. This Self is not someone other than you."
        },
        "ii": {
            "1": " If you think, “I know the Self,” you know not. All you can see is his external form. Continue, therefore, your meditation.",
            "2": " THE STUDENT I do not think I know the Self, nor can I say I know him not.",
            "3": " THE TEACHER There is only one way to know the Self, And that is to realize him yourself. The ignorant think the Self can be known By the intellect, but the illumined Know he is beyond the duality Of the knower and the known.",
            "4": " \fThe Self is realized in a higher state Of consciousness when you have broken through The wrong identification that you are The body, subject to birth and death. To be the Self is to go beyond death.",
            "5": " Realize the Self, the shining goal of life! If you do not, there is only darkness. See the Self in all, and go beyond death."
        },
        "iii": {
            "1": " Once upon a time the gods defeated The demons; and though the victory Was brought about through the power of Brahman, The gods boasted, “Ours is the victory, And ours the power and glory.”",
            "2": " Brahman saw their foolish pride and appeared Before them. But they recognized him not.",
            "3": " Who this mysterious being is.” “I will,”",
            "4": " “Who are you?” asked the mysterious one. “I am Agni, god of fire, known to all.”",
            "5": "",
            "6": " The god of fire attacked the straw, but failed To burn it. Then he ran back to the gods And confessed, “I have failed to discover Who this mysterious being is.”",
            "7": " Who this mysterious being is.” “I will,”",
            "8": " “Who are you?” asked the mysterious one. “I am Vayu, god of air, king of space.”",
            "9": " \f“Are you powerful?” “I can blow all away.”",
            "10": " The god of air attacked the straw, but failed To move it. Then he ran back to the gods And confessed, “I have failed to discover Who this mysterious being is.”",
            "11": " They begged Indra, leader of gods, “Find out Who this mysterious being is.” “I will,” Promised Indra and approached the being,",
            "12": " Appeared the lovely goddess of wisdom, Uma, daughter of the Himalayas; And Indra asked her, “Who was that being?”"
        },
        "iv": {
            "1": " Uma replied, “That was Brahman, from whom Comes all your power and glory.” The gods Realized at last the Self is Brahman.",
            "2": " Among the gods because they realized Brahman.",
            "3": " The light of Brahman flashes in lightning; The light of Brahman flashes in our eyes.",
            "4": "",
            "5": " Use this power to meditate on Brahman.",
            "6": " He is the inmost Self of everyone; He alone is worthy of all our love. Meditate upon him in all. Those who Meditate upon him are dear to all. THE STUDENT",
            "7": " Teach me more of this spiritual wisdom. \fTHE TEACHER I shall share with you fully what I know.",
            "8": " And passions, and selfless service of all Are the body, the scriptures are the limbs, And truth is the heart of this wisdom. Those who realize Brahman shall conquer All evil and attain the supreme state. Truly they shall attain the supreme state!"
        }
    },
    "PRASHNA": {
        "intro": "The structure of the Prashna Upanishad is quite simple: six illustrious\nseekers approach the sage Pippalada in turn and ask him a basic question\nabout Reality. This allows the sage to begin with the process of creation, or\nthe emanation of the world’s innumerable forms from the divine, as many\nUpanishads do. Then the questions probe progressively deeper into the\npractical mysteries of human existence.\nIn his first answer Pippalada invokes the law of duality by which the One\nbecomes many through complementary opposites like consciousness and\nmatter, giving rise to the various orders of reality down to the sensible\nworld in which we consciously operate. Pippalada names the primary\npolarity prana and rayi, roughly consciousness and matter, and his answer\nto the second question – “What power quickens life?” – begins with a\nthought-experiment on the primacy of prana over all vital functions. This\nbecomes a hymn to prana, the distinctive theme of this Upanishad.\nPrana is one of those precise but broad-ranging terms in the lexicon of\nVedanta which we will say more about in the afterword. We can call it a\ntechnical term for the energy which fuels evolution, powers the vital\nprocesses in all forms of life, and ultimately becomes thoughts and desires\nin the mind, where it becomes most readily accessible for us to conserve or\nredirect. Around the concept of prana the Upanishads develop a\ncomprehensive theory of life which accounts for everything from health to\nmorality. Thus the questions and answers can become more penetrating, and\nthe sweep of reality to be explained more ample, as this great concept is\nexplored.\n\fAnswer 3 begins with the striking image (partly also at Brihadaranyaka\nII.1.12 and III.9.14) of the Self casting prana into the world of multiplicity as\nits shadow. Our real self is, of course, closer to energy or consciousness\n(prana) than to a form or name (rayi). Pippalada’s answer goes on to\ncategorize the five pranas known in vital functioning, with their\nmacrocosmic equivalents (e.g., 3.8, 4.8). The Self of the Upanishads is both\ndeeper and less circumscribed from the outside world than the usual\nWestern conception of the self (if indeed we have one: Huston Smith has\npointed out that “there is no consistent view of human nature in the West\ntoday”).\nAnswer 4, delving deeper into the question of human identity, brings in\nanother set of inner–outer equivalents discussed in the introduction to the\nChandogya Upanishad, that of the sacrifice. Answer 5 brings in the cosmic\nsyllable OM. And 6 closes by underscoring, if we needed further emphasis,\nthat prana is prior to and has given rise to “name and form” (nama-rupa): in\nother words, to all conditioned reality. “Name and form,” roughly, is the\nIndian equivalent of the Kantian categories of time and space, as the givens\nwhich make possible but also set limits around what the mind can grasp. –\nM.N.",
        "q1": {
            "1": " Sukesha, Satyakama, and Gargya, Kausalya, Bhargava, and Kabandhi, Who were all seeking Self-realization, Approached with love sage Pippalada For his guidance on the spiritual path.",
            "2": " The sage told them: “Live with me for one year, Practicing sense-restraint and complete trust. Ask me questions at the end of the year, And I will answer them if I can.”",
            "3": " After a year Kabandhi asked the sage: “Master, who created the universe?”",
            "4": " The sage replied: “The Lord meditated and brought forth prana With rayi, the giver of name and form: Male and female, so that they would bring forth Innumerable creatures for him.",
            "5": " “Prana is the sun; rayi is the moon. Matter is solid, matter is subtle; Rayi therefore is present everywhere.",
            "6": " \f“The sun gives light and life to all who live, East and west, north and south, above, below; It is the prana of the universe.",
            "7": " “The wise see the Lord of Love in the sun, Rising in all its golden radiance To give its warmth and light and life to all.",
            "8": " “The wise see the Lord of Love in the year, Which has two paths, the northern and the southern. Those who observe outward forms of worship And are content with personal pleasures Travel after death by the southern path, The path of the ancestors and of rayi, To the lunar world, and are born again.",
            "9": " “But those who seek the Self through meditation, Self-discipline, wisdom, and faith in God Travel after death by the northern path, The path of prana, to the solar world, Supreme refuge, beyond the reach of fear And free from the cycle of birth and death.",
            "10": " “Some look upon the sun as our father Who makes life possible with heat and rain And divides time into months and seasons. Others have seen him riding in wisdom On his chariot, with seven colors As horses and six wheels to represent The whirling spokes of time.",
            "11": " “The wise see the Lord of Love in the month; Rayi is the dark half, prana the bright. The wise worship in the light of wisdom, Others in the darkness of ignorance.",
            "12": " \f“The wise see the Lord of Love in the day; Rayi is the dark night, prana daylight. Those who use their days for sexual pleasure Consume prana, the very stuff of life; But mastered, sex becomes a spiritual force.",
            "13": " “The wise see the Lord of Love in all food; From food comes seed, and from seed all creatures.",
            "14": " But those who are self-controlled and truthful Will go to the bright regions of the sun.",
            "15": " “The bright world of Brahman can be attained Only by those who are pure and true, Only by those who are pure and true.”"
        },
        "q2": {
            "1": " Then Bhargava approached the sage and asked: “Master, what powers support this body? Which of them are manifested in it? And among them all, which is the greatest?”",
            "2": " The sage replied: “The powers are space, air, fire, Water, earth, speech, mind, vision, and hearing. All these boasted, ‘We support this body.’",
            "3": " Over them all, said, ‘Don’t deceive yourselves. It is I, dividing myself fourfold, Who hold this body together.’",
            "4": " “But they would not believe these words of prana. To demonstrate the truth, prana arose And left the body, and all the powers Knew they had to leave as well. When prana Returned to the body, they too were back. As when the queen bee goes out, all the bees",
            "5": " \fGo out, and when she returns all return, So returned speech, mind, vision, and hearing. Then the powers understood and sang this song: ‘Prana burns as fire; he shines as the sun; He rains as the cloud; he blows as the wind; He crashes as the thunder in the sky. He is the earth; he has form and no form; Prana is immortality.",
            "6": " ‘Everything rests in prana, as spokes rest In the hub of the wheel: all the Vedas, All the rituals, all the warriors and kings.",
            "7": " ‘O prana, you move in the mother’s womb As life to be manifested again. All creatures pay their homage to you.",
            "8": " ‘You carry offerings to gods and ancestors And help sages to master their senses, Which depend upon you for their function.",
            "9": " ‘You are the creator and destroyer, And our protector. You shine as the sun In the sky; you are the source of all light.",
            "10": " ‘When you pour yourself down as rain on earth, Every living creature is filled with joy And knows food will be abundant for all.",
            "11": " ‘You are pure and master of everything. As fire you receive our oblations; It is you who gives us the breath of life.",
            "12": " ‘Be kind to us with your invisible form, Which dwells in the voice, the eye, and the ear, And pervades the mind. Abandon us not.",
            "13": " \f‘O prana, all the world depends on you. As a mother looks after her children, Look after us. Grant us wealth and wisdom.’ ”"
        },
        "q3": {
            "1": " Then Kausalya approached the sage and asked: “Master, from what source does this prana come? How does he enter the body, how live After dividing himself into five, How leave the body at the time of death? How does he support all that is without And all that is within?”",
            "2": " The sage replied: “You ask searching questions. Since you are a devoted aspirant Seeking Brahman, I shall answer them.",
            "3": " “Prana is born of the Self. As a man Casts a shadow, the Self casts prana Into the body at the time of birth So that the mind’s desires may be fulfilled.",
            "4": " “As a king appoints officers To do his work in all the villages, So prana works with four other pranas, Each a part of himself, to carry out Different functions in the body.",
            "5": " “The main prana dwells in eye, ear, mouth, and nose; Apana, the downward force, in the organs Of sex and of excretion. Samana, The equalizing force in the middle, Digests food and kindles the seven fires.",
            "6": " “Vyana, distributor of energy, \fMoves through the myriad vital currents Radiating from the heart, where lives the Self.",
            "7": " That runs upward through the spinal channel, Udana, the fifth force, leads the selfless Up the long ladder of evolution, And the selfish down. But those who are both Selfless and selfish come back to this earth.",
            "8": "",
            "9": " “The sun is the prana of the universe, And it rises to bring light to our eyes. The earth draws the lower fire of apana; The space between sun and earth is samana, And the moving air is vyana.",
            "10": " “Fire is udana. When that fire goes out, The senses are drawn back into the mind And the person is ready for rebirth.",
            "11": " At the time of death, that is what unites us To prana, udana, and the Self, To be reborn in the plane we have earned.",
            "12": " “Those who realize this go beyond death. Their children too follow in their footsteps.",
            "13": " Enters the body, and becomes fivefold To serve the Self, they die not; they die not.”"
        },
        "q4": {
            "1": " QUESTION IV Then Gargya approached the sage and asked him: “Sir, when a man is sleeping, who is it That sleeps in him? Who sees the dreams he sees? When he wakes up, who in him is awake? When he enjoys, who is enjoying? In whom do all these faculties rest?”",
            "2": " \fThe sage replied: “As the rays of the sun, When night comes, become all one in his disk Until they spread out again at sunrise, Even so the senses are gathered up In the mind, which is master of them all. Therefore when a person neither hears, sees, smells, Tastes, touches, speaks, nor enjoys, we say he sleeps.",
            "3": " “Only the fires of prana are burning. Apana is like the holy hearth-fire Ever burning in the householder’s shrine; Vyana is like the fire that faces south For carrying offerings to our ancestors; And prana is the fire that faces eastward.",
            "4": " That balances inward and outward breath, The offerings made by the mind. Udana is the fruit of dreamless sleep, In which the mind is led close to the Self.",
            "5": " “The dreaming mind recalls past impressions. It sees again what has been seen; it hears Again what has been heard, enjoys again What has been enjoyed in many places. Seen and unseen, heard and unheard, enjoyed And unenjoyed, the real and the unreal, The mind sees all; the mind sees all.",
            "6": " “When the mind is stilled in dreamless sleep, It brings rest and repose to the body.",
            "7": " All things in life find their rest in the Self.",
            "8": " Elements, the eyes and what can be seen, The ears and what can be heard, the nostrils And what can be smelled, the palate and what \fCan be tasted, the skin and what can be touched, The tongue and what can be spoken, The hands and what can be held, the organ Of sex and its object of enjoyment, The organ of excretion and what is Excreted, the feet and what they walk on, The mind and what it thinks, the intellect And what it knows, the ego and what It grasps, the heart and what it loves, the light And what it reveals: all things in life Find their rest in the Self in dreamless sleep.” “It is the Self who sees, hears, smells, touches, And tastes, who thinks, acts, and is pure consciousness. The Self is Brahman, changeless and supreme.”",
            "9": " “Those who know the supreme Self as formless, Without shadow, without impurity, Know all, gentle friend, and live in all.",
            "10": " In whom the breath and all the senses live, Know all, gentle friend, and live in all.”"
        },
        "q5": {
            "1": " Satyakama approached the sage and asked: “Those who have become established in AUM, What happens to them after death?”",
            "2": " The sage replied: “AUM is both immanent And transcendent. Through it one can attain The personal and the impersonal.”",
            "3": " AUM has three sounds. Those who meditate on a Come back to earth, led by the Rig Veda, To lead a pure life, full of faith and love.",
            "4": " \fThose who meditate on the first two sounds, A and u, led by the Yajur Veda, Go to the lunar world, full of pleasure, From which they come back cloyed to earth again.",
            "5": " Are led by the Sama chants to the sun, Where freed from sin, as a snake sheds its skin, They see the supreme Lord, who lives in all.”",
            "6": " “These three sounds when they are separated Cannot lead one beyond mortality; But when the whole mantram, a, u, and m, Indivisible, interdependent, Goes on reverberating in the mind, One is freed from fear, awake or asleep.",
            "7": " “The Rig Veda brings one to earth; the Yajur Escorts one to the region of the moon; The Sama leads one to the solar world, To which the sage attains through the mantram. Established in this cosmic vibration, The sage goes beyond fear, decay, and death To enter into infinite peace.”"
        },
        "q6": {
            "1": " Then Sukesha approached the sage and said: “Master, the prince of Kosala asked me This question once: ‘Sukesha, do you know the Self With his sixteen forms?’ ‘I don’t,’ I replied. ‘If I did, I would certainly tell you; For he who speaks an untruth perishes Like a tree without roots.’ The prince mounted His chariot and went away silent. Now may I ask you, where is that Self?”",
            "2": " The Self with his sixteen forms, gentle friend.",
            "3": " \fThe Self asked himself, ‘What is it that makes Me go if it goes and stay if it stays?’",
            "4": " Desire; and from desire he made space, air, Fire, water, the earth, the senses, the mind, And food; from food came strength, austerity, The scriptures, sacrifice, and all the worlds; And everything was given name and form.",
            "5": " “As rivers lose their private name and form When they reach the sea, so that people speak Of the sea alone, so all these sixteen Forms disappear when the Self is realized. Then there is no more name and form for us, And we attain immortality.",
            "6": " “The Self is the hub of the wheel of life, And the sixteen forms are only the spokes. The Self is the paramount goal of life. Attain this goal and go beyond death!”",
            "7": " The sage concluded: “There is nothing more To be said of the Self, nothing more.”",
            "8": " The students adored their teacher and said: “You are our father; you have taken us Across the sea to the other shore.” Let us adore the illumined sages! Let us adore the illumined sages!"
        }
    },
    "TAITTIRIYA": {
        "intro": "The Upanishads make a careful distinction between the terms pleasure and\njoy. Pleasure, which mainly comes from sense experience, is transitory and\nactually quite limited. Joy comes from being in harmony with the creative\nforces of the universe, with one's own destiny, and is permanent - one of\nthe main reasons we can tell it apart from pleasure - and has no limits at all.\nThis is an important distinction in mysticism, and in a striking passage, the\nTaittiriya Upanishad builds on this idea and tries to give us some sense of\nthe magnitude of the joy that is our legacy, building up systematically, in\nexpansions of a hundred, a comparison with the limited experience that we\nhave now to the inexpressible joy of unity with the supreme.\nThat alone would be an outstanding contribution, but the Taittiriya has\nother distinctive features. One is the model of the human being as the Self\nencased in five wrappings like a Chinese puzzle, starting from the material\nbody (the first self we are generally aware of) and progressing inward to the\n'sheaths' of vitality (prana), mind, intuition (buddhi), and finally joy.\nAlong with the quantum leaps in joy are similar qualitative steps in\nawareness for those who push deeper through these layers of condensation,\nas it were, that cover our real Self.\nHow is this to be done? Here the text gives one of those practical insights\nthat startle us with their contemporary bearing: 'Respect food . . . Waste not\nfood . . . The earth can yield much more. . . . Refuse not food to those who\nare hungry.' (III.810). Passages like these should give final proof that the\nreligion of the Upanishads is not world-denying. The layered models that\nthey develop in so many forms make us feel more respect for the things of\nthis world. Food, for example, is life-energy, or prana, condensed into\nmatter. When we respect that energy on the physical level, we gain easier\npassage to the level beyond. Of course, this is even more true of our fellow\ncreatures; alienation from them blocks spiritual growth. By realizing the\nunity from which each created thing has come and in which it is sustained,\nwe can live rightly in the world of change in order to ascend through it to\nthe eternal.\nSection I.11 is a famous passage in this same spirit, a kind of\n'convocation address' to spiritual students who have finished their course\nof study, the phase of life called brahma-charya; it follows naturally on\nsection 9, here titled 'To the Householder.' The Upanishads are intended\nnot only for renunciates in Himalayan caves or forest solitude; they are also\nvery much for those who wish to carry out the dharmas of social life in the\nworld.\nLike the Kena, this Upanishad ends rather than begins with a narrative.\nThe story of Bhrigu addresses how we can make our own life part of the\nupward drive of spiritual evolution by 'serving the Self' in everything we\ndo. Than that, the Upanishad asserts, there can be no greater joy.",
        "part 1": {
            "1": " May the Lord of day grant us peace. May the Lord of night grant us peace. May the Lord of sight grant us peace. May the Lord of might grant us peace. May the Lord of speech grant us peace. May the Lord of space grant us peace. I bow down to Brahman, source of all power. I will speak the truth and follow the law. Guard me and my teacher against all harm. Guard me and my teacher against all harm.",
            "2": "",
            "3": " Let us learn the art of recitation, Which calls for knowledge of letters, accent, Measure, emphasis, sequence, and rhythm.",
            "4": "",
            "5": " \fMay the light of wisdom illumine us. May we become united with the Lord. Let us contemplate five categories: This world and luminous worlds in the sky, Education, progeny, and speech. What is this world? Earth below, sky above, Air between, and space connecting them.",
            "6": " Fire on one side and sun on the other, Water between, lightning connecting them.",
            "7": " To the disciple seated by his side, Wisdom between, discourse connecting them.",
            "8": " Father on the other, the child between, The sexual organ connecting them.",
            "9": " What is speech? The lower jaw and the upper, Words between, and the tongue connecting them.",
            "10": " Will have children, cattle, food, and wisdom.",
            "11": "",
            "12": " O Lord of Love, revealed in the scriptures, Who have assumed the forms of all creatures, Grant me wisdom to choose the path That can lead me to immortality. May my body be strong, my tongue be sweet; May my ears hear always the sound of OM, The supreme symbol of the Lord of Love, And may my love for him grow more and more.",
            "13": " Lord, may I grow in spiritual wisdom, And may I have food and clothes and cattle. May students come to me from far and near, Like a flowing river all the year; May I be enabled to guide them all \fTo train their senses and still their minds;",
            "14": " O Lord of Love, may I enter into you, And may you reveal yourself unto me, The pure One masquerading as many. You are the refuge of all devotees. I am your devotee. Make me your own.",
            "15": " Bhur, bhuvas, suvar are three vibrations. Mahachamasya taught a fourth, maha, To stand for the Self. The rest are his limbs. When bhur is the earth, bhuvas space between, And suvar the world above, maha is the sun That nourishes life everywhere.",
            "16": " The sun, maha is the moon that supports All the planets and celestial bodies.",
            "17": " And suvar the Yajur, maha is Brahman, Wisdom that nourishes all the four Vedas.",
            "18": " Downward, and suvar is prana widespread, Maha is food that nourishes vital forces",
            "19": " Are four times four. Those who understand them Realize the Self and are loved by all.",
            "20": " The Lord of Love dwells in the hearts of all. To realize him is to go beyond death. Between the parietal bones of the skull Swings the sagittal door, as the lobe swings Behind the palate. Through that one goes out Chanting bhur, to become one with fire; Chanting bhuvas, to become one with air; \fChanting suvar, to be one with the sun; Chanting maha, to be one with the Lord. Thus one becomes king of his own life, ruler Of his passions, senses, and intellect. He is united with the Lord of Love, Who is truth, peace, and immortality, The source of joy, the supreme goal of life. Meditate always on the Lord of Love.",
            "21": " Earth, sky, worlds above, quarters and their halves; Fire, air, sun, moon, and stars; water, herbs, trees, Space, and entity are the elements. Eye, ear, mind, tongue, and touch; skin, flesh, muscle, Marrow, and skeleton; and the five Vital forces constitute the body. The sage, contemplating these sets of five, Discovered that everything is holy. Man can complete the inner with the outer.",
            "22": "",
            "23": " OM is the supreme symbol of the Lord. OM is the whole. OM affirms; OM signals The chanting of the hymns from the Vedas. The priest begins with OM; spiritual teachers And their students commence with OM. The student who is established in OM Becomes united with the Lord of Love.",
            "24": "",
            "25": " To the Householder Practice right conduct, learning and teaching; Be truthful always, learning and teaching; Master the passions, learning and teaching; Control the senses, learning and teaching; Strive for peace always, learning and teaching; \fRouse kundalini, learning and teaching; Serve humanity, learning and teaching; Beget progeny, learning and teaching. Satyavacha says: “Be truthful always.” Taponitya says: “Master the passions.” Naka declares: “Learning and teaching are Necessary for spiritual progress.”",
            "26": " “I have become one with the tree of life. My glory rises like the mountain peak. I have realized the Self, who is ever Pure, all-knowing, radiant, and immortal.” Thus spoke sage Trishanku when he became United with the Lord of Love.",
            "27": "",
            "28": " Having taught the Vedas, the teacher says: “Speak the truth. Do your duty. Neglect not The scriptures. Give your best to your teacher. Do not cut off the line of progeny. Swerve not From the truth. Swerve not from the good. Protect your spiritual progress always. Give your best in learning and teaching. Never fail in respect to the sages.",
            "29": " Teacher, and guest. Never do what is wrong.",
            "30": " Give with faith. Give with love. Give with joy.",
            "31": " Follow the example of the sages, Who know what is best for spiritual growth.",
            "32": " This is the secret; this is the message.”"
        },
        "part 2": {
            "1": " Bhrigu went to his father, Varuna, and asked respectfully: “What is Brahman?” Varuna replied: “First learn about food, Breath, eye, ear, speech, and mind; then seek to know That from which these are born, by which they live, \fFor which they search, and to which they return. That is Brahman.”",
            "2": " Bhrigu meditated and found that food Is Brahman. From food are born all creatures, By food they grow, and to food they return. Not fully satisfied with his knowledge, Bhrigu went to his father, Varuna, And appealed: “Please teach me more of Brahman.” “Seek it through meditation,” replied Varuna, “For meditation is Brahman.”",
            "3": " Bhrigu meditated and found that life Is Brahman. From life are born all creatures, By life they grow, and to life they return. Not fully satisfied with his knowledge, Bhrigu went to his father, Varuna, And appealed: “Please teach me more of Brahman.”",
            "4": " “Seek it through meditation,” replied Varuna, “For meditation is Brahman.” Bhrigu meditated and found that mind Is Brahman. From mind are born all creatures, By mind they grow, and to mind they return. Not fully satisfied with his knowledge, Bhrigu went to his father, Varuna, And appealed: “Please teach me more of Brahman.”",
            "5": " “Seek it through meditation,” replied Varuna, “For meditation is Brahman.” Bhrigu meditated and found that wisdom Is Brahman. From wisdom come all creatures, By wisdom they grow, to wisdom return. Not fully satisfied with his knowledge,",
            "6": " \fBhrigu went to his father, Varuna, And appealed: “Please teach me more of Brahman.” “Seek it through meditation,” replied Varuna, “For meditation is Brahman.” Bhrigu meditated and found that joy Is Brahman. From joy are born all creatures, By joy they grow, and to joy they return.",
            "7": " Bhrigu, Varuna’s son, realized this Self In the very depths of meditation. Those who realize the Self within the heart Stand firm, grow rich, gather a family Around them, and receive the love of all. Respect food: the body is made of food; Food and body exist to serve the Self. Those who realize the Self within the heart Stand firm, grow rich, gather a family Around them, and receive the love of all.",
            "8": " Waste not food, waste not water, waste not fire; Fire and water exist to serve the Self. Those who realize the Self within the heart Stand firm, grow rich, gather a family Around them, and receive the love of all.",
            "9": " Increase food. The earth can yield much more. Earth and space exist to serve the Self. Those who realize the Self within the heart Stand firm, grow rich, gather a family Around them, and receive the love of all.",
            "10": " Refuse not food to those who are hungry. When you feed the hungry, you serve the Lord, From whom is born every living creature.",
            "11": " \fThose who realize the Self within the heart Stand firm, grow rich, gather a family Around them, and receive the love of all. Realizing this makes our words pleasing, Our breathing deep, our arms ready to serve The Lord in all around, our feet ready To go to the help of everyone in need.",
            "12": " In beast and bird, in starlight and in joy, In sex energy and in the grateful rain, In everything the universe contains. Drawing on the Lord’s resources within, Security, wisdom, and love in action, We conquer every enemy within To be united with the Lord of Love. The Self in man and in the sun are one.",
            "13": " And go beyond the various sheaths Of being to realize the unity of life. Those who realize that all life is one Are at home everywhere and see themselves In all beings. They sing in wonder: “I am the food of life, I am, I am; I eat the food of life, I eat, I eat. I link food and water, I link, I link. I am the first-born in the universe; Older than the gods, I am immortal. Who shares food with the hungry protects me; Who shares not with them is consumed by me. I am this world and I consume this world. They who understand this understand life.” This is the Upanishad, the secret teaching."
        },
        "part 3": {
            "1": " Bhrigu went to his father, Varuna, and asked respectfully: “What is Brahman?” Varuna replied: “First learn about food, Breath, eye, ear, speech, and mind; then seek to know That from which these are born, by which they live, \fFor which they search, and to which they return. That is Brahman.”",
            "2": " Bhrigu meditated and found that food Is Brahman. From food are born all creatures, By food they grow, and to food they return. Not fully satisfied with his knowledge, Bhrigu went to his father, Varuna, And appealed: “Please teach me more of Brahman.” “Seek it through meditation,” replied Varuna, “For meditation is Brahman.”",
            "3": " Bhrigu meditated and found that life Is Brahman. From life are born all creatures, By life they grow, and to life they return. Not fully satisfied with his knowledge, Bhrigu went to his father, Varuna, And appealed: “Please teach me more of Brahman.”",
            "4": " “Seek it through meditation,” replied Varuna, “For meditation is Brahman.” Bhrigu meditated and found that mind Is Brahman. From mind are born all creatures, By mind they grow, and to mind they return. Not fully satisfied with his knowledge, Bhrigu went to his father, Varuna, And appealed: “Please teach me more of Brahman.”",
            "5": " “Seek it through meditation,” replied Varuna, “For meditation is Brahman.” Bhrigu meditated and found that wisdom Is Brahman. From wisdom come all creatures, By wisdom they grow, to wisdom return. Not fully satisfied with his knowledge,",
            "6": " \fBhrigu went to his father, Varuna, And appealed: “Please teach me more of Brahman.” “Seek it through meditation,” replied Varuna, “For meditation is Brahman.” Bhrigu meditated and found that joy Is Brahman. From joy are born all creatures, By joy they grow, and to joy they return.",
            "7": " Bhrigu, Varuna’s son, realized this Self In the very depths of meditation. Those who realize the Self within the heart Stand firm, grow rich, gather a family Around them, and receive the love of all. Respect food: the body is made of food; Food and body exist to serve the Self. Those who realize the Self within the heart Stand firm, grow rich, gather a family Around them, and receive the love of all.",
            "8": " Waste not food, waste not water, waste not fire; Fire and water exist to serve the Self. Those who realize the Self within the heart Stand firm, grow rich, gather a family Around them, and receive the love of all.",
            "9": " Increase food. The earth can yield much more. Earth and space exist to serve the Self. Those who realize the Self within the heart Stand firm, grow rich, gather a family Around them, and receive the love of all.",
            "10": " Refuse not food to those who are hungry. When you feed the hungry, you serve the Lord, From whom is born every living creature.",
            "11": " \fThose who realize the Self within the heart Stand firm, grow rich, gather a family Around them, and receive the love of all. Realizing this makes our words pleasing, Our breathing deep, our arms ready to serve The Lord in all around, our feet ready To go to the help of everyone in need.",
            "12": " In beast and bird, in starlight and in joy, In sex energy and in the grateful rain, In everything the universe contains. Drawing on the Lord’s resources within, Security, wisdom, and love in action, We conquer every enemy within To be united with the Lord of Love. The Self in man and in the sun are one.",
            "13": " And go beyond the various sheaths Of being to realize the unity of life. Those who realize that all life is one Are at home everywhere and see themselves In all beings. They sing in wonder: “I am the food of life, I am, I am; I eat the food of life, I eat, I eat. I link food and water, I link, I link. I am the first-born in the universe; Older than the gods, I am immortal. Who shares food with the hungry protects me; Who shares not with them is consumed by me. I am this world and I consume this world. They who understand this understand life.” This is the Upanishad, the secret teaching."
        }
    },
    "AITAREYA": {
        "intro": "Perhaps the greatest contribution of the Upanishads is to open our eyes to\nwhat it really means to be a human being. The constant concern of the sages\nis to reawaken us to the sacred nature of the environment, of living\ncreatures, of one another, and finally of our own inner reality. This exalted\nvision of the human person has been echoed by the anonymous monk of\nfourteenth-century England who has left us one of the world’s greatest\nmystical documents, the Cloud of Unknowing:\nBeneath you and external to you lies the entire created universe. Yes,\neven the sun, the moon, and the stars. They are fixed above you,\nsplendid in the firmament, yet they cannot be compared to your exalted\ndignity as a human being. . . . There is nothing above you in nature\nexcept God himself.\nHow can this be? How can this miniscule, fragile body whose size in the\nUniverse is beyond ludicrous be, or contain, such importance? Because, the\nUpanishads and all the world’s great mystics insist, we are not that fragile\nbody but that which causes it to move, breathe, and be alive: consciousness.\nIn this Upanishad we have one of the four mahavakyas or “great utterances”\nthat later tradition teased out as the sum and substance of their teaching:\nprajnam brahma, “All reality is consciousness.” And the same\nconsciousness is the life of all: thus we have the explanation for both the\nsanctity and the unity of life.\nThe Aitareya lays out this explanation by telling the story of evolution in\nthe form of a creation myth. To us today it seems very Lamarckian because\nit sees the driving force of evolution as desire; but if we bear in mind that\n\fthe sages understood desire to be precisely that – a force, rather than simply\ncravings or emotions – the myth is not so implausible. The titanic energy of\nevolution suggests some kind of drive; when the sages (or the early Greek\nthinkers) called it “desire,” they were connecting life in the here-and-now to\nthat awesome cosmic process by which the One manifested itself as, and\nstill sustains, the many.\nA great sage of modern India who was most Upanishadic in his exalted\nvision of this process, Sri Ramana Maharshi, replied to the urgent questions\nof a distinguished philosopher in words that always haunt me:\nHappiness is the very nature of the Self; happiness and the Self are not\ndifferent. There is no happiness in any object of the world. We imagine\nthrough our ignorance that we derive happiness from objects. When the\nmind goes out, it experiences misery. In truth, when its desires are\nfulfilled, it returns to its own place and enjoys the happiness that is the\nSelf. –M.N.",
        "1": {
            "1": {
                "1": " Before the world was created, the Self Alone existed; nothing whatever stirred. Then the Self thought: “Let me create the world.”",
                "2": "He brought forth all the worlds out of himself: Ambhas, high above the sky; Marichi, The sky; Mara, the middle region that is earth; And Apa, the realm of waters below.",
                "3": " The Self thought: “I have created these worlds. Let me now create guardians for these worlds.” From the waters he drew forth Purusha And gave him a form.",
                "4": "As the Self brooded Over the form, a mouth opened, as does An egg, giving forth speech and fire; nostrils Opened with the power of breathing the air; Eyes opened, giving rise to sight and sun; And ears opened to hear the sound in space. Skin appeared and from it hair; from hair came Plants and trees. The heart gushed forth; from the heart Came the mind, and from the mind came the moon. The navel opened with the downward force, Apana, which gave rise to death. The sex organ rose With living water which gave rise to birth."
            },
            "2": {
                "1": "Thus came these guardians into the mightyOcean of existence. The Self caused them  To hunger and thirst. They said to the Self: “Give us a place where we can live and eat.”",
                "2": "He brought them the form of a cow. They said: “This is not what we desire.” He brought them  The form of a horse. But they said again:",
                "3": "“This is not what we desire.” He brought them A human form. They said in joy: “Just right! A human body is just right for us.” The Self asked them to enter the body And take up their places. ",
                "4": " Fire, becoming Speech, entered the mouth; air, becoming smell, Entered the nose; the sun, becoming sight, Entered the eyes; sounds in space, becoming Hearing, entered the ears; plants, herbs, and trees, Becoming hair, entered the skin; the moon, Becoming mind, entered the heart. The god Of death, becoming downward force, entered The navel; the god of living water,Becoming sperm, entered the sex organ.",
                "5": "Hunger and thirst said to the Self: “Give us A place.” He told them: “Enter into these Guardians and share their life with them.”  Thus hunger and thirst for food, drink, and pleasure  Attend us, whatever we do in life."
            },
            "3": {
                "1": "The Self, Creator, thought: “Here are the worlds And their guardians. Let me now bring forth food For them.”",
                "2": "He brooded over the waters, And food appeared in the form of matter",
                "3": " It tried to run away in fear, and man, The first embodied being, tried to catch It with his speech. But he could not catch it With words. Merely by repeating the name Of food one cannot satisfy hunger.",
                "4": " He tried to catch it with his breath, but he Could not. Just by smelling food one cannot Satisfy hunger.",
                "5": " He tried to catch it With his eyes, but he could not. By looking At food one cannot satisfy hunger.",
                "6": "He tried to catch it with his ears, but he Could not. By merely hearing about food One cannot satisfy hunger.",
                "7": "He tried To catch it with his skin, but he could not. By touching food one cannot satisfy Hunger.",
                "8": "He tried to catch it with his mind, But he could not. By thinking about food One cannot satisfy hunger",
                "9": " He tried To catch it with his genital organ, But he could not. By sexual union One cannot satisfy hunger.",
                "10": "He tried To catch it with apana, the downward prana Of digestion, and at last he caught it. Thus it is apana that takes in food; Thus it is apana that lives on food.",
                "11": "1 The Self thought, “How can this be without me? If speaking is done by speech, breathing by Breath, seeing by eyes, hearing by ears, smelling By nose, and meditation by the mind,",
                "12": " Then who am I?” Entering the body Through the gateway at the crown of the head, He passed into the three states of consciousness In which the Self resides.",
                "13": "Filled with wonder, we sing: “I see the Lord.\"",
                "14": "So his name is Idamdra, “He who sees.” The name Indra stands for Idamdra. The gods do like to sit behind a veil; Indeed they like to sit behind a veil."
            }
        },
        "2": {
            "1": " Life begins in man as sexual fluid, Which has the strength gathered from all his limbs. Man holds this quintessence in his body, And it becomes child in woman. This is The first birth",
            "2": "Child and mother are one. She protects the child, and needs protection.",
            "3": "The mother carries the child in her womb, And the father bestows his loving care Before and after birth. The child is their Atman, their very Self, and continues Their line without break as the second birth.",
            "4": "4 He discharges all their holy duties And sheds his body, too, when it grows old, To be born again. This is the third birth. The sage Vamadeva declared of old:",
            "5": "“While dwelling in the womb I understood The birth of all the gods. A hundred forms, Strong as steel, held me prisoner. But I Broke loose from them, like a hawk from the cage, And came out swiftly.” While still in the womb, Vamadeva made this declaration.",
            "6": "He emerged from his mother’s womb, fully Illumined, to live in abiding joy, And went beyond death. Indeed He went beyond death. "
        },
        "3": {
            "1": "Who is this Self on whom we meditate? Is it the Self by which we see, hear, smell, and taste,",
            "2": "Through which we speak in words? Is Self the mind By which we perceive, direct, understand, Know, remember, think, will, desire, and love? These are but servants of the Self, who is Pure consciousness. This Self is all in all. He is all the gods, the five elements,",
            "3": "Earth, air, fire, water, and space; all creatures, Great or small, born of eggs, of wombs, of heat, Of shoots; horses, cows, elephants, men, and women; All beings that walk, all beings that fly, And all that neither walk nor fly. Prajna Is pure consciousness, guiding all. The world Rests on prajna, and prajna is Brahman.",
            "4": " Those who realize Brahman live in joy And go beyond death. Indeed They go beyond death."
        }
    },
    "FOUR MINOR UPANISHADS": {
        "intro": "A “minor” Upanishad, by definition, is one that has not been commented\nupon or extensively cited by Shankara, not necessarily one that is minor in\nwisdom or expressive power. Shankara’s commentaries elevated the\nprincipal Upanishads into a kind of canon; but it should be noted that the\nlist is not fixed – various authorities, ancient and modern, have reshaped it –\nand there may in any case have been other commentaries of Shankara\nwhich have not survived. Some of the so-called minor texts convey insights\nof the same magnitude as those singled out by Shankara, usually in much\nthe same style and often with the same force.\nThe first of the four minor Upanishads in this collection, the Tejobindu,\nstresses the “beyondness” of Reality and how the aspirant must rise beyond\nordinary experience and ordinary responses to be one with it: even – for\nHindu tradition does not shrink from this – beyond the guidance of the\nsacred texts themselves. It is a testimony to the value Hindu mysticism\nplaced on independence that the Upanishads and other texts exhort aspirants\nto transcend scripture itself in the search for one’s own destiny.\nThe second text, Atma Upanishad, offers a very simple and effective\ntripartite model of this transcendence. The human being exists in an outer\nworld and an inner one, that is, in the physical body and environment and in\nthe realms of mind; yet there is something beyond both. In describing the\nworld within, the Atma does what all Upanishads do best: describe\nconsciousness with subtlety, profundity, and humor. The realm beyond\ncannot be described at all, but the effects of knowing it are extolled.\n\fThe next text in this selection, Amritabindu, is one of four or five\nUpanishads whose names end in bindu or “drop,” indicating their succinct\ndistillation of wisdom. Amrita, “immortality,” like its Greek cousin\nAmbrosia, was thought of in ritualistic and mythic contexts as a kind of\nliquid. This is not the Upanishad’s conception. It concentrates on the mind\nas the seat of spiritual struggle. The mind is a “wondrous power,” as Sri\nRamana Maharshi said, and our destiny in life is determined by what we do\nwith that power. The opening line of the Dhammapada, a central text of\nTheravada Buddhism, is\n“All that we are is the result of what we have thought” (more\nliterally, of mind).\nIf we neglect mind, the senses and lower forces in our inherited\nconsciousness take control of it; if we train it carefully, we can utilize its\npower to liberation – to immortality.\nThe Paramahamsa Upanishad, last in our selection, stresses that the\ninsignia of the religious pilgrim or mendicant are symbolic. Like the rituals\nobserved by householders, they are at best aids to the conditions of\nfreedom, love, and wisdom the seeker must establish within. In this regard\nthe Paramahamsa resembles descriptions of true spirituality found, for\nexample, in the last chapter of the Dhammapada (“The Brahmin”) and still\nlater in the poems of Kabir. –M.N.",
        "The Tejobindu Upanishad": {
            "1": " Let us meditate on the shining Self, Changeless, underlying the world of change, And realized in the heart in samadhi.",
            "2": " Hard to reach is the supreme goal of life, Hard to describe and hard to abide in.",
            "3": " Mastered their senses and are free from anger, Free from self-will and from likes and dislikes, Without selfish bonds to people and things.",
            "4": " They alone attain samadhi who are Prepared to face challenge after challenge In the three stages of meditation. Under an illumined teacher’s guidance They become united with the Lord of Love,",
            "5": " Though the three gunas emanate from him, He is infinite and invisible. Though all the galaxies emerge from him, He is without form and unconditioned. To be united with the Lord of Love Is to be freed from all conditioning. This is the state of Self-realization, \fFar beyond the reach of words and thoughts. To be united with the Lord of Love, Imperishable, changeless, beyond cause And effect, is to find infinite joy. Brahman is beyond all duality, Beyond the reach of thinker and of thought. Let us meditate on the shining Self, The ultimate reality, who is Realized by the sages in samadhi. Brahman cannot be realized by those Who are subject to greed, fear, and anger. Brahman cannot be realized by those Who are subject to the pride of name and fame Or to the vanity of scholarship. Brahman cannot be realized by those Who are enmeshed in life’s duality. But to all those who pierce this duality, Whose hearts are given to the Lord of Love, He gives himself through his infinite grace; He gives himself through his infinite grace."
        },
        "The Atma Upanishad": {
            "1": " This is the teaching of sage Angiras: Purusha manifests itself three ways: As outer, inner, and the supreme Self. Skin, flesh, vertebral column, hair, fingers, Toes, nails, ankles, stomach, navel, hips, thighs, Cheeks, eyebrows, forehead, head, eyes, ears, arms, sides, Blood vessels, nerves: these make up the outer self, The body, subject to birth and death.",
            "2": " The inner self perceives the outside world, Made up of earth, water, fire, air, and space. It is the victim of likes and dislikes, Pleasure and pain, and delusion and doubt. It knows all the subtleties of language, Enjoys dance, music, and all the fine arts; Delights in the senses, recalls the past, Reads the scriptures, and is able to act. This is the mind, the inner person.",
            "3": " The supreme Self, adored in the scriptures, Can be realized through the path of yoga. Subtler than the banyan seed, subtler Than the tiniest grain, even subtler Than the hundred-thousandth part of a hair, This Self cannot be grasped, cannot be seen. The supreme Self is neither born nor dies. He cannot be burned, moved, pierced, cut, nor dried. Beyond all attributes, the supreme Self Is the eternal witness, ever pure, \fIndivisible, and uncompounded, Far beyond the senses and the ego. In him conflicts and expectations cease. He is omnipresent, beyond all thought, Without action in the external world, Without action in the internal world. Detached from the outer and the inner, This supreme Self purifies the impure."
        },
        "The Amritabindu Upanishad": {
            "1": " The mind may be said to be of two kinds, Pure and impure. Driven by the senses It becomes impure; but with the senses Under control, the mind becomes pure.",
            "2": " It is the mind that frees us or enslaves. Driven by the senses we become bound; Master of the senses we become free.",
            "3": "",
            "4": " When the mind is detached from the senses One reaches the summit of consciousness.",
            "5": " Practice meditation. Stop all vain talk.",
            "6": " For it lies beyond all duality.",
            "7": " Keep repeating the ancient mantram OM Until it reverberates in your heart.",
            "8": " Brahman is indivisible and pure; Realize Brahman and go beyond all change.",
            "9": " Realizing him, sages attain freedom",
            "10": " They have but realized what they always are.",
            "11": " Waking, sleeping, dreaming, the Self is one. Transcend these three and go beyond rebirth.",
            "12": " \fThere is only one Self in all creatures. The One appears many, just as the moon Appears many, reflected in water.",
            "13": " The Self appears to change its location But does not, just as the air in a jar Changes not when the jar is moved about.",
            "14": " But the Self knows well when the body is shed.",
            "15": " We see not the Self, concealed by maya; When the veil falls, we see we are the Self.",
            "16": " The mantram is the symbol of Brahman; Repeating it can bring peace to the mind.",
            "17": " Knowledge is twofold, lower and higher. Realize the Self; for all else is lower.",
            "18": "",
            "19": " The milk of cows of any hue is white. The sages say that wisdom is the milk And the sacred scriptures are the cows.",
            "20": " As butter lies hidden within milk, The Self is hidden in the hearts of all. Churn the mind through meditation on it;",
            "21": " The Self, all whole, all peace, all certitude.",
            "22": " “I have realized the Self,” declares the sage, “Who is present in all beings. I am united with the Lord of Love; I am united with the Lord of Love.”"
        },
        "The Paramahamsa Upanishad": {
            "1": " Narada enquired of the Lord of Love: “What is the state of the illumined one?” The Lord replied: “Hard to reach is the state Of the illumined one. Only a few Attain it. But even one is enough. For he is the pure Self of the scriptures; He is truly great because he serves me, And I reveal myself through him always.” He has renounced all selfish attachments And observes no rites and ceremonies. He has only minimum possessions, And lives his life for the welfare of all.",
            "2": " He has no staff nor tuft nor sacred thread. He faces heat and cold, pleasure and pain, Honor and dishonor with equal calm. He is not affected by calumny, Pride, jealousy, status, joy, or sorrow, Greed, anger, or infatuation, Excitement, egoism, or other goads; For he knows he is neither body nor mind. Free from the sway of doubt and false knowledge He lives united with the Lord of Love, Who is ever serene, immutable, Indivisible, the source of all joy And wisdom. The Lord is his true home, His pilgrim’s tuft of hair, his sacred thread; For he has entered the unitive state.",
            "3": " \fHaving renounced every selfish desire, He has found his rest in the Lord of Love. Wisdom is the staff that supports him now. Those who take a mendicant’s staff while they Are still at the mercy of their senses Cannot escape enormous suffering. The illumined man knows this truth of life.",
            "4": " For him the universe is his garment And the Lord not separate from himself. He offers no ancestral oblations; He praises nobody, blames nobody, Is never dependent on anyone.",
            "5": " He has no need to repeat the mantram, No more need to practice meditation. The world of change and changeless Reality Are one to him, for he sees all in God. The aspirant who is seeking the Lord To people, money, and possessions. When his mind sheds every selfish desire, He becomes free from the duality Of pleasure and pain and rules his senses. No more is he capable of ill will; No more is he subject to elation, For his senses come to rest in the Self. Entering into the unitive state, He attains the goal of evolution. Truly he attains the goal of evolution."
        }
    },
    "Afterword": {
        "A Religion for Moder Times": "The Upanishads have often been called the purest source of India’s spiritual\ntradition. If we take the word pure to mean that they consist of essentials\nand are not tangled up in the changing circumstances of the culture that\nproduced and recorded them, we will see why they are not only still revered\nin India but have been discovered by individuals throughout the world as\ntreasures of needed wisdom – even though they are not particularly easy to\nread.\nOur age seems to need this kind of guidance more than ever. We are\npassing through a spiritual crisis that has been brought about by a wrong\nmessage about human nature and human happiness – a message so\npervasive that it makes up a global culture of its own. We need to turn to\nsources of wisdom wherever we can find them. Against this backdrop the\nwisdom tradition in general is indispensable, and the Upanishads in\nparticular have some attractive features recommending them as a way to\nmine that tradition and integrate the best it has to offer into our modern\nlives.\nFirst, the Upanishads offer a noble, exalted vision of human nature. To\nhear sages say, “Hear, O children of immortal bliss, you are born to be\nunited with the Lord,” or to read the many “ladder” images in the texts that\nshow us that our awareness of ourselves as physical bodies is a mere\nshadow of what we really are, brings a shock of recognition, a great relief.\nSecond, while the Upanishads are wrapped in a good bit of mythology\nand ritual, that wrapping comes off pretty easily. What we are left with is\npure mysticism: a penetrating and remarkably comprehensive vision of\nTruth that can give us inspiration and a direction – a beckoning goal and a\nway to reach it.\nThird, the Upanishads are scientific and experiential. They don’t say,\n“believe this”; they say, “This we have seen: if you do x, y, and z, you can\nconfirm it for yourself.” They offend neither our sense of logic nor our\nsense of responsibility for discovering truth for ourselves. More: their\noutlook is nonjudgmental. They speak with fervor about darkness and\n\fignorance, not with indignation about sin. They give us their glorious\ntestimony about reality and let us decide whether we want to realize it for\nourselves. Their universe is rigorously unforgiving in the sense that\nignorance is its own punishment, and rigorously redemptive in the sense\nthat wisdom is its own reward.\nAll this being said about the Upanishad’s universality, the fact remains\nthat these conversations (as they seem to have been) were recorded very far\nback in time in a world that was very different from our own. They do\nrequire some getting used to. My familiarity with them grew as I learned\nmore about the world from which they had come; and this is what I will\nnow try to share.",
        "SONGS OF TRUTH": {
            "WHAT IS AN UPANISHAD?": "An Upanishad is an utterance of mystical truth that has come down to us as\nan attachment to the Vedas, the ancient and extremely sacred hymn\ncollections or Samhitas of the Indo-Aryans. These collections are four in\nnumber – Rig, Yajur, Sama, and Atharva, in order of their age and their\npredominant interest in gods, ritual formula, chant, or magic spells. They\nand their adjuncts of almost equally ancient material form the textual basis\nto this day of India’s major religious system. To be Hindu means in some\nsense to accept their authority, and since Hinduism is a decentralized\nsystem with diffuse institutional controls, there is almost no other criterion.\nAs one studies the Upanishads today it is useful to keep in view this\nseeming paradox of decentralized authority and unwritten stability.\nVeda (etymologically “sacred knowledge,” or wisdom) means in the first\ninstance these four Samhitas or collections of inspired hymns directed to the\ngods of the Indo-Aryan pantheon and divinized aspects of the Vedic\nreligious ideology, such as fire, as well as some hymns so elusive we can no\nlonger tell what exactly they are celebrating. A second meaning of the word\nincludes three classes of texts which were soon attached to, and preserved\nwith, their respective Samhitas. The first are the Brahmanas, lengthy\ndescriptions of the Vedic rituals in a prose which is nearly that of classical\nSanskrit, containing a vast amount of lore and narrative from innumerable\nfamily traditions. These texts were basically manuals for the priests (also\nbrahmanas, “brahmins”) responsible for the increasingly complex family\nand community rites. Second is a smaller and more intriguing group of texts\n\fknown as Aranyakas or “forest manuals,” continuations of the Brahmanas\nbut “dealing with the speculations and spirituality of forest dwellers . . . ,\nthose who have renounced the world.”[1] And third are the earliest\nUpanishads or “confidential sessions.”[2] The Upanishads thus\nconsummate a line of development which begins with the official hymns of\nthe extended family that were recited at their public rituals and ends with\nutterances of universal import that a remarkable class of forest sages had\ngiven to their intimate disciples. For this reason, and because they are\nhanded down at the end of the Vedic collections and are meant to be learned\nand recited last by Vedic students, the Upanishads are classified as vedanta,\n“the end of the Vedas.”\nIndian tradition makes a distinction between the Samhitas and\nBrahmanas, which deal mainly with ritual performance, and the Aranyakas\nand Upanishads, especially the latter, which deal with interpretation: what\nthe rituals, and then what things in general, mean. The technical terms for\nthese two divisions were karma kanda and jnana kanda, the portions\ndealing respectively with (ritual) action and spiritual knowledge. In the\nUpanishads themselves the former often serves as foil for the latter; that is,\nrituals become symbols of Self-realization, always an elusive state to\ndescribe in words.\nHowever they began, there are today about two hundred texts which go\nby the name of Upanishad – or, according to another classification, one\nhundred and eight, an auspicious number in Hinduism. Looked at as a\ngenre, these texts vary as drastically in content and spirituality as they do in\nage, ranging from the oldest prose Upanishads to some which are obviously\nmedieval. The transcendent authority of the older texts rises above sectarian\nforms of religion to represent the religion that Hindus originally called not\n“Hinduism” but the sanatana dharma or “eternal law.”\nEarly in the eighth century A.D., in a period when Hinduism was losing\nits bearings, the great mystic and philosopher Shankara, knowing that only\nmystical experience could reinvigorate the tradition, composed remarkable\ncommentaries on ten of the Upanishads, giving them as it were a secondary\ncanonization by his authority, labor, and vast intellectual achievement – and\nrenewing Hinduism in the process. These ten Upanishads are listed by\nIndian tradition in the following order: Isha, Kena, Katha, Prashna,\nMundaka, Mandukya, Taittiriya, Aitareya, Chandogya, Brihadaranyaka.\nThe Shvetashvatara is no less treasured today, and some scholars say that\n\fShankara wrote a commentary on it which has not survived. These eleven\nare commonly considered the principal Upanishads.\nThe class of people who taught in the forest ashrams of ancient India\nwere “apparently engaged,” as D. S. Sarma points out, “in the mighty task\nof transforming a rather low type of sacrificial religion prevalent at the time\ninto a great mystical religion true for all time.”[3] It would be misleading to\nsay there was no trace of mysticism in the Samhitas; wherever there is a\nreal love of life there is a groundwork of mystical devotion, and the\nexuberance of the hymns, their total faith in the order of the universe (rita)\nand in man’s place in nature, seen and unseen, their sense of the seriousness\nof human action – all these belong to a spirit of mysticism. Besides, the\nSamhitas and especially the oldest, the Rig Veda Samhita, contain\nimpressive profundity in speculation about the nature of being, time, and\nthe universe, as in the famous Nasadiya Sukta (.129.1.4), sometimes called\na “basis of the Upanishads”:[4]\nAt first there was neither Being nor Nonbeing.\nThere was not air nor yet sky beyond.\nWhat was its wrapping? Where? In whose protection?\nWas water there, unfathomable and deep?\nIn the beginning Love arose,\nWhich was the primal germ cell of the mind.\nThe seers, searching in their hearts with wisdom,\nDiscovered the connection of Being in Nonbeing.\nWho really knows? Who can presume to tell it?\nWhence was it born? Whence issued this creation?\nEven the gods came after its emergence.\nThen who can tell from whence it came to be?\nThe Vedas give us glimpses into a mythological world which looks like\nthat of Greece, Rome, and the rest of Europe, but different. The\nUpanishadic universe also contains “three worlds,” but these are not the\nunderworld, “middle-earth,” and heaven as in the West, but the visible\nworld, heaven (or the sky), and another plane that is far beyond phenomenal\nreality. The human being is not a puny speck in this cosmos, as we may\nappear physically. By virtue of a power called tapas (“heat”) generated by\nextreme austerity (also called tapas) or in deep stages of meditation,\n\fordinary men or women can compel profound changes in the universe. The\nhard line between mortality and immortality, between mankind and the\ngods, which Greek and Roman religion hammer home, is blurred and\ncrossable.\nWhen we get to the Upanishads themselves there is a new element,\nsomething almost disconcertingly different. It can be brought out in an\nimage which appears in the Rig Veda (I.164.20) and is repeated, sometimes\nverbatim, in several Upanishads:\nTwo birds of beautiful plumage, comrades\nInseparable, live on the selfsame tree.\nOne bird eats the fruit of pleasure and pain;\nThe other looks on without eating.\nWhen this image occurs in the Vedic context it’s pretty clear that the bird\nthat does partake – that is, the person who enjoys the fruits of life – is being\nheld up for praise. In the Upanishadic contexts it is just the other way\naround: he or she who is not hypnotized by the ever-changing stream of\nphenomena but observes it in detachment is heading for the supreme human\ndestiny.\nSometimes the Upanishads draw attention to this discontinuity with a\nboldness of thought few cultures – not to say religions – have ventured, as\nwhen they openly state that the Vedas themselves are only aids to\nrealization which an already realized person no longer needs (Mundaka\nI.2.7). One way of looking at the decisive difference is that the religion of\nthe Samhitas centers on the gods, and the direct, enthusiastic invocation and\nworship of them at the sacrifice. In the Brahmanas, however, the intense\npower of the sacrifice itself (the original meaning of brahman) becomes the\nfocus, and the sacrifice which moves the gods is several times said to be\nmore powerful than they are. Then, finally, in the Aranyakas, power is seen\nto rest in man himself. There is a ground for mysticism in the Samhitas, but\nonly the Aranyakas and then decisively the Upanishads plant in that ground\nand cultivate it systematically.\nIt is because of this fundamental commitment to spiritual values and the\nfocus on human consciousness that the Upanishads may be regarded as the\nsource, insofar as texts are the source, of India’s civilization. There is a\nmystical element at the heart of all great religious systems; but in India that\n\fmysticism has been established and systematically developed, to become –\nto use a phrase of Schopenhauer’s – “the faith of the people.”\nHowever this happened, mysticism and the intense devotion that is\nalways a part of mysticism have become the heart of India’s civilization,\nand if it survives the current corrosion of values by materialism the way it\nsurvived, in centuries past, the successive attacks of Mongols, Muslims, and\nBritish, the spiritual culture of India will be a precious resource for a world\nreawakening to the need for spiritual values. But for this to happen, some\ndifficulties that lie in the path of our understanding this culture must be\ncleared. Perhaps the most serious is simply the rarity of the experience they\nare attempting to describe. To this day, only a rare few human beings have\nactually had the experience of “seeing” reality from the perspective taken\nby these remarkable documents. The Self is “hidden in the deepest cave of\nthe heart.” It cannot be perceived by the senses, like phenomena we can\nmeasure or describe. We have to build a road into the regions of\nconsciousness where we can “see” what lies there; we need an appropriate\nand sufficiently powerful organ of perception, what the Bhagavad Gita\n(II.8) calls the “divine eye.” It is for this reason that the author of the Kena\nexclaims, “We do not know, we do not understand.” (I.3).",
            " INDIAN CULTURE & TRADITION": "Rabindranath Tagore once pointed out that while the Greeks and Romans\nbuilt great cities, India’s was a “forest civilization.”[5] Not that there were\nno great cities in ancient India – Harappa and Mohenjo Daro rose and fell\nbefore Mycenaean palaces were erected on the Greek mainland – but the\nessential continuity of the culture was developed and preserved by families\nliving in small communities close to nature long after splendid palaces and\nuniversities rose in those cities. This had profound consequences, as Tagore\nexplains, for the Hindu worldview. Like the Hebrews, the ancient Indians\ndistrusted the pace and pomp of urbandom, and distrusted it enough to resist\ncentral authority and conformism for thousands of years. Their trust in oral\ncreativity and preservation paid off, for India’s is an extremely welldocumented civilization. More survives of classical Sanskrit than of ancient\nGreek and perhaps Latin literature put together: the Iliad, the Odyssey, and\nthe Aeneid would fit into one vast Indian epic, the Mahabharata, with room\nto spare for Lucian and some others.\n\fThese choices help to explain what meets us in the Upanishads: their\nintimacy, the bewildering variety of their outer form, the fact that they are\ncreative utterances of gifted individuals, even the way they were preserved\nas a precious inheritance in family traditions. It is this closeness to the\nindividual person that makes them, behind an austere facade, deeply\ndevotional.\nThe Upanishads are in some ways the archetype for other forms of Indian\nculture, most importantly perhaps in their grounding in the teacher-student\nrelationship. Not only in mysticism, but in Indian music and other arts it is\nthis reliance on person-to-person communication, both for teaching the\nindividual student and for perpetuating the parampara or “succession” that\nkeeps the art alive for the whole culture.\nIndian aesthetics holds that the essence of every moment in an artistic\nperformance is its rasa, which corresponds to one of nine moods or\ndispositions, such as fear, erotic love, or devotion. If the Upanishads are an\narchetypal art form in that sense, what is their rasa? That question occupied\nIndian aestheticians a great deal, and their answer was skillful: the\nUpanishads come from the disposition of shanta, “peace,” which is not\nreally a disposition or mood but what happens when all mental dispositions\nare brought to rest: again the Upanishads are an “end of the Vedas.”\nThe rasa theory also allowed Indian theorists to get a grip on what an\nUpanishad was essentially, rather than formally: whenever you have a truthutterance (a profound statement by someone in a higher state of\nconsciousness) you have an Upanishad. In this sense the Bhagavad Gita is\nan Upanishad, and the epic in which it is embedded, the Mahabharata,\nhowever violent on the surface, itself teaches detachment from worldly gain\nand communicates the predisposition of inner calm (shama) leading also to\nspiritual peace (shanta).[6]\nThis attention to theory and classification bring us to the fact that India’s\nwas a highly scientific spirit, and this combination of science and devotion,\nof detached observation and mystical ecstasy, is one of the most arresting –\nand useful – aspects of the Upanishads. It did not stop with them. When\nGandhi told the world that he had been instructed to undertake his “epic\nfast” in 1932 by “the voice of God,” many asked how he knew he was not\nhaving a hallucination. He calmly told them, “The claim that I have made is\nneither extraordinary nor exclusive. God will rule the lives of all those who\nsurrender themselves without reservation to him.” And he added, “Here is\n\fno question of hallucination. I have stated a simple, scientific law that can\nbe verified by anyone who will carry out the necessary preparations. . . .”\nWe are used to considering religion and science at odds – a divorce that\nmany consider very harmful. Gandhi’s confident claim is an arresting\nrevelation, entirely in the spirit of the Upanishads.\nIf we judge a theory by its explanatory power, one of the most successful\nin the Upanishads is the theory of prana. The word may come from the\nprefix pra- “forth” (possibly used here as an intensifier) and the important\nroot an “to breathe.” As generally used, prana means “(living) energy”: all\nthe “vital signs” by which we try to identify the presence of life are tokens\nof the capacity of a body to direct, conserve, and employ energy at a high\nlevel of complexity. The Upanishadic sages worked out the primacy of\nprana over its various functions in the body by what we call thoughtexperiments. One might imagine, for example, what would happen if the\nindividual faculties (in Sanskrit, indriyas) leave a person one by one: as\nsight leaves, the person would go blind, and so forth, but still live. This is\nexactly what we find in the Brihadaranyaka (VI.1.7–13) and other\nUpanishads. But when prana itself makes ready to leave, “like a great\nstallion pulling up the stakes by which he was tethered,” all the faculties\ngather round and beg it to remain, declaring they have learned their lesson:\nthey all derive their existence from prana. Or one might imagine what\nwould happen if all the faculties left and came back to the inert body one by\none: how would sight function by itself if one were not conscious? This is\nthe Aitareya experiment, and there are others in the Prashna and elsewhere.\nThe sages are saying, as it were, “If our theory is correct, death should only\noccur when prana itself goes, and conversely life should resume when it\nreturns.”\nThe sages testify that they have confirmed all this by direct observation –\nbut that observation requires a highly trained observer. This is a principle\nknown in Western medieval philosophy as adaequatio rei et intellectu, the\n“suitability of the cognitive equipment to its task”: the senses and the mind\n(which Indians considered the chief sense) must be brought to a stillness,\nusually by assiduous training, in order for us to become aware of prana and\nwhat lies beyond even that.\nIn giving us these thought-experiments the sages probably had three\nthings in mind. First and foremost, they wanted to guide the cognitive\ngrowth of others who could be inspired to undertake the training required to\n\fperceive the life-process in this direct way. Second, they simply wanted to\nexplain life with the most powerful theory, which is why they are so\nrigorously logical. And finally they meant to put a science of health on a\nfirm basis – in other words, to say something true and useful about the\nprocess and the systems we call life. From this scientific basis the sages\nwere also able to explain, again drawing on their incredible skill at directing\nattention inward, the fivefold distribution of the body’s energy, which is\nelaborated, including its relationship to other realities, in the Prashna and\nseveral other Upanishads.\nI hope I have illustrated that with a little getting used to, one can move\naround handily enough in the Indian system, which was quite scientific and\nrational in its own terms. Diversity is not disharmony. Without formal rules,\nHindus organized a vast collection of texts into categories and canonized\nthem in a system that was authoritative throughout Hindu culture. In this\nrespect India invites comparison with another ancient people with intense\nspiritual longings who remained decentralized, not by choice but by the\ndestruction of their political integrity: the Jews. In this description of the\nMishnaic inheritance we might almost be reading a description of the\nUpanishads:[7]\nThe Talmud is the repository of thousands of years of Jewish wisdom,\nand the oral law, which is as ancient and significant as the written law\n(the Torah), finds expression therein. It is a conglomerate of law,\nlegend, and philosophy, a blend of unique logic and shrewd pragmatism,\nof history and science, anecdotes and humor. It is a collection of\nparadoxes: its framework is orderly and logical, every word and term\nsubjected to meticulous editing, completed centuries after the actual\nwork of composition came to an end; yet it is still based on free\nassociation, on a harnessing together of diverse ideas reminiscent of the\nmodern stream-of-consciousness novel.\nEven more than diaspora Jewish tradition, the survival strategy of Indian\nculture was cumulative. This is a particularly useful generalization to bear\nin mind. India was probably the only country where three in many ways\ncontradictory systems of medicine, Indian, Arabic, and Greek, flourished\nside by side; a similar toleration extended to the successive stages of\nevolution in religious consciousness through which India passed. Outworn\n\fforms of religious worship were virtually never discarded – as Professor\nSarma points out, the sages did their job of moving people beyond their\n“rather low type of sacrificial religion . . . without in any explicit manner\nbreaking away from the traditions of the past.”[8]\nThe resulting accumulation can be confusing because most traditions\nhave not been cumulative; they reject a “creed outworn” when they move\non to a new stage. The ability to accommodate rather than reject older\nbeliefs has a very practical outcome. India has had its share of religious\nintolerance, but thanks to its paradigm of unity-in-diversity and its\ncumulative strategy for preserving culture, those individuals and\ncommunities who respond to outward forms of worship have kept their\nplace and dignity in the system, while at the other extreme individuals who\nhave really had mystical experience have been unusually free to transcend\nall religious forms and not only follow their own path but become beacons\nfor the culture as a whole. “As men approach me, so I receive them,” Sri\nKrishna says in the Gita. “All paths, Arjuna, lead to me” (Gita 4.11). This\ntoo helps explain the mixtures, or more properly layers, of religious\nconsciousness displayed in the Upanishads.",
            "THE LITERARY VEHICLE": "Although not many of the Upanishadic passages dealing with ritual and\nsacrifice are included in this or most other modern collections, the texts’\nconcern with that aspect of religion went beyond the fact that technically\nthe Upanishads are commentaries on the Vedas. Ritual stood for all human\naction; sacrifice, once internalized, was the key idea of mysticism and thus\nbecame a perfect vehicle of continuity between the Brahmanas and the\ntexts’ own interiorizing mystical vision. In the Upanishads’ treatment of\nsacrifice we can learn many things about how they work as literary,\nphilosophical, and religious texts.\nMany Upanishadic passages have to be interpreted by two or more\n“codes” (as literary critics say today), since a new set of meanings is\nmapped onto an older set of symbols.[9] The gods or devas of the natural\nworld are dramatizations of phenomena like rain and wind, but they also\nstand for parallel faculties in the human being. When Krishna says in the\nGita, “Those who worship the gods go to the gods, but my devotees come\nto me” (Gita 7. 23), he means that those who live in the sense-world end up\n\fstuck in the sense-world; but those who try to reach awareness of their inner\nSelf become completely realized.\nAt all stages of Indian civilization the world-process itself was\nconsidered a sacrifice. Even the gods carry out sacrifice, playing, just as\nhuman beings must, their role in the continuation of the cosmic cycle. But\nas we have seen, devas can stand for the sensory and motor faculties, divine\nenergy as experienced in the microcosm; Shankara elsewhere comments, “It\nis a fact established on the strength of the scriptures that speech and the\nother faculties are conscious through being presided over by conscious\ndeities.”[10] So in this image of the gods offering sacrifice for the\ncontinuity of the cosmic process (or as that process) we also can see the\nbeginnings of one of the most important principles of mysticism, the\nprinciple of yajna or spiritual sacrifice: in order to reach the highest\nfulfillment, the human being returns vital energy to the process rather than\nclinging to it. In practical terms, he or she works for the well-being of the\nworld rather than for the gratification of personal desires, and therefore\neven eating is ideally a sacrifice meant to empower a selfless contribution\nto the world process. We encounter this repeatedly in the Upanishads; the\nFourth Question of the Prashna contains just this allegory of human life as\nsacrifice, and the spiritual principle of yajna is, as Gandhi said, the essence\nof the Isha, indeed of India’s civilization.\nLikewise, when the Upanishads describe the soul as traveling through\nvarious realms after death, they are really referring to realms of psychic\nexperience we can have in this life. The Upanishads do not suppress but\nreuse the complex layers of symbolic thought they have inherited. If their\ninterest in sacrifices was a debt owed to their Vedic and Brahmanic home in\nthe literary tradition, it was a debt they paid cheerfully, for it gave them a\nperfect vehicle for their new message.\nIn the Katha and some other Upanishads we come across an expression\nthat means literally “eating up the good works” (karma) of someone or\nother. Karma means primarily the spiritual or ethically operational residue\nof every act. Thus not only a ritual act but every act is symbolic, in the\nsense that beyond its external, visible effects are the far more important,\ndeep-residing effects of every thought, word, and deed on our spiritual\nrelationships.\nThese effects entangle us in further relationships, making up our network\n– or net – of karma. Yet, as the Gita so eloquently says (3.4–6), it is absurd\n\fto think we have a choice not to act; even if we sit quietly our thoughts and\ndesires will go on driving through the world of karmic influence. How can\nwe ever be free of such a tangle? Precisely by learning more and more day\nby day to act in a spirit of yajna.\nIt was Gandhi who really brought this abstruse doctrine back to vibrant\nlife: act, by all means, but make your act, in the modern sense of the word,\na sacrifice. That is, he explained, choose a selfless goal, use right means\n(nonviolence), and never be pushed into action for your own benefit – a tall\norder. Gandhi was not waxing metaphorical when he called his programs\nfor the deliverance of India – and of the individual activist – yajna. By\ndrawing upon the not-to-be-denied need in all of us to work for a selfless\ngoal he elevated even his political campaigns to the level of models for\nevery action we might want to take today.\nWhat Professor Sarma called the sages’ “mighty task” of making the\nHindu system valid for all time could be expressed in a single word:\ninteriorization. Interiorization does not mean giving up on external\nstruggles and satisfactions but rather reaching the center of the field where\nall satisfaction is ultimately achieved for us human beings. It does not mean\nlosing life; it means the sacrificer gets eternal life. The Upanishads share\nwith all sages the same high vision of what the human being can become:\nwithout sacrifice, we stop short of something that is essentially human.\nSeveral things about the Vedic sacrificial (and, more generally, ritual)\nbelief system made it relatively easy to develop that system mystically –\nthat is, to interiorize it. At an early stage, for example, a certain type of\npriest was designated who officiated at the rituals mentally, not\nparticipating in the acts or recitations but going through them in his mind.\n[11] His role originally was the important one of protecting the performance\nagainst errors, which were felt to be dangerous and required elaborate\npurification; but that precedent of an interior run-through led to the\nprovision that one could actually perform the rituals mentally if the\nnecessary implements or personnel were not available – for example, in the\nforest. It was a relatively short step from this provision to the position that\nas far as the true purpose of religion goes, external rites – however suitable\nfor the short-term resolution of social problems – are unnecessary, or at best\nsymbolic. The real sacrifice could then be done directly, not just attempted\nby symbolic manipulations.\n\fAt the beginning of the Katha Upanishad we seem to have a\nrecapitulation of this historic process. Everything it describes has more than\none meaning. Nachiketa, a forthright youth who takes life seriously, is taken\naback by his father’s sham sacrifice, but underneath he is actually frustrated\nwith the unreality of the world. His longing and his sincerity bring him face\nto face with the power of death. Given three boons, he chooses first of all to\nbe reconciled with his father and to escape the immediate danger of death\nhe is facing. Then – his relationship to death is becoming that of spiritual\naspirant before the supreme teacher – he asks and receives the knowledge\nof the fire sacrifice that “leads to heaven.” Then with the third boon comes\nthe point: “O Death, having seen your face, how can I enjoy anything\nagain? Teach me the real secret: What are you? What happens when we die,\nand how can we not?” He does not want to die and come back to life; he\ndoes not want to die and be remembered; finally he just does not want to\ndie.\nAnd he does not have to. Desire focused and unified at that depth opens\nfor him “the entire secret of meditation” (Katha II.3.18) by which one\nleaves all separate individuality – and consequently all that is created and\nmust die – behind. These stages of the story reflect rather well the\ndevelopment of India’s rich, complex, and cumulative religious history,\ndriven always by the quenchless desire for life that caused it to evolve into\none of the most highly developed – and inspiring – systems of mysticism in\nthe world.\nWe think of the Upanishads first and foremost as a well of deep meaning\n– their practical use to and effect upon us. But Indian pundits and scholars\nof old considered them also as a source of poetic beauty, and this beauty is\nnot entirely secondary. The Upanishads inherit from the Vedas a capacity\nfor inspired poetry. They speak, usually, in a less lyrical voice; on the other\nhand, they have even deeper access to the basic resource of all poetry,\nwhich is vision. Vision often produces poetry even when the Upanishads\nspeak in their most dogged prose; for example in highly imaginative\nimagery that can suddenly light up an elusive concept with deceptive\nsimplicity. These images stay in the mind; once we hear them, we will carry\nthem around like a torch, throwing light on life wherever we live it. When\nwe understand the purpose of the Upanishads and have grown used to their\naesthetic, reading them can be what it was meant to be: a deeply enjoyable,\nmoving, and even transformative experience.",
            "THE PHILOSOPHY": "To modern ears the word philosophy connotes a kind of dry, theoretical\nlearning which would be almost a travesty of the Upanishads’ passion for\nexperiential realization. As the sages used the term, knowing is not a\nseparate activity from other aspects of being – courage, endurance,\nconcentration, will. There is such a thing as mere intellectual knowing, of\ncourse, but the Mundaka Upanishad, for example, begins by setting aside\nthis kind of knowing as apara, “nontranscendent” – that is, not dealing with\ntransformative experience. The Upanishads are concerned with para,\n“transcendent” knowledge, “by knowing which, all things are known” (I.3)\nin a way that our being and our actions are transformed. For this kind of\nknowledge there were four nonintellectual prerequisites: discrimination,\ndetachment, self-control, and an “irrepressible hankering after the\nrealization of truth.”[12]\nOrdinary knowledge is either subjective or objective; transcendent\nknowing is neither. When a student in the Upanishads says, for example, “I\ndid not know that such-and-such is Brahman,” he means he has not yet\nrealized the identity of that thing with its source, precisely because he has\nbeen seeing it as a separate object. But according to mysticism – and to\nmodern physics – we cannot know anything objectively; it does not really\nexist independently of an observer, where both observer and observed are\nparticipating in consciousness.\nOn the other hand, neither can we know things subjectively as yet,\nbecause that would only be superimposing our own preconceived ideas on\nthings. The only way we can truly know something is to become identified\nwith it. We can become what we would know. “If [one] loves a stone, he\nbecomes a stone; if he loves a man, he is a man; if he loves God – I dare not\nsay more, for if I said that he would then be God, you might stone me.”[13]\nThis, minus the final hesitation, is precisely the position of the sages.\nThe higher mode of knowing induced by intense selfless love and\nidentification produces powerful changes in the knower: “Whatever they\n[knowers of Brahman] desire, the object of that desire arises from the power\nof their own thoughts; they have it and are happy” (Chandogya VIII.2.1–\n10). If these claims overdraw on the credulity of the modern reader, it is\nbecause we think naturally of the normal mode of knowing with which we\nare familiar. Earlier translators used to think the Upanishads were talking\nabout magic, especially when the symbolic code of the text happens to\n\fconcern ritual: “He who performs this rite knowing goes beyond death.”\nWhat the sages mean is that if one sees through the symbolism of the ritual\nto its meaning and identifies with that inner core of meaning through\nspiritual union, rites become superfluous. For that knower they have\nfulfilled their purpose; they have lifted the performer’s vision to the world\nbeyond death. Spiritual identification is caught from rather than taught by\nan illumined teacher. “Knowing” in the Upanishads is a code for that\nrealization.\nTradition has isolated four powerful formulaic utterances (mahavakyas)\nembedded in the early Upanishads. One is sarvam idam brahma, “All is\nBrahman” (Chandogya III.14.1), which states the foundation of mysticism:\nthat everything is ultimately one. In the Vedic period, that belief had taken\nthe form of a great myth in which Purusha, or the prototypical “Person,”\nwas made into our world by the primordial sacrifice; his head became the\nBrahmin class, his arms the Kshatriyas or ruler-warriors, and so forth. We\ncan say two things about the purport of this myth: it affirms the unity of life\nin a common source (Christian writers would make the same point about\nour common ancestor, Adam), and it affirms the order, or meaning, in the\nUniverse: there is rita – harmony, regularity – underlying all seemingly\nrandom change. And that harmony or order prevails not only in the material\norder, making science possible; it is also seen in the laws that govern the\nconscious or moral dimensions of existence.[14]\nWhat the myth does not tell us, being a myth, is the most important\nconsequence of these beliefs: that a human being can reverse the process of\ncreation which proceeded from singularity to diversity: not just retrace it,\nfor example, in science or philosophy, but reverse it, so that one withdraws\nfrom the world of change and follows what St. Augustine called the “hidden\nfootprint of unity” that is there, perhaps covered but never eradicated in our\nconsciousness. [15]\nThe Upanishads never stray far from this purpose. Take the episode of\nUddalaka and his son Shvetaketu (Chandogya VI.1–16). The latter has\ncome home from his traditional twelve years’ study under a brahmin\nteacher “proud of his learning in the scriptures” but unaware of the purpose\nof that learning. In this case the father must be his real teacher. Uddalaka\nfirst shakes him out of his complacency with a spiritual version of “What\ndid you learn at school”: “Did they teach you That by which everything else\nis known?” Then, as soon as the boy is ready to grasp that truth of truths, he\n\fhas him dissolve salt in water, dissect a mustard seed, and perform other\nexperiments that by analog or induction yield insights into the one Reality\nunderlying all phenomena. These are not chemistry or biology lessons: each\ntime Shvetaketu has such a flash of insight Uddalaka tells him, “Shvetaketu,\nyou are That.”\nThis is one of the central passages in the Upanishads, and its teaching\nthat the supreme Reality can be found in the humblest and most ordinary\nobjects “as fire lies hidden in firestick, butter in cream, water in springs”\n(Shvetashvatara I.15) is fundamental in the Upanishadic worldview. Not\nsurprisingly, “You are That” (tat tvam asi) is one of the mahavakyas.[16]\nShvetaketu’s sudden awakening is uncharacteristic; in most anagogic\npassages of the Upanishads the process is by gradual stages. When King\nJanaka asks Yajnavalkya, “What is the light of man?” (Brihadaranyaka\nIV.3.11 ff), the sage first cites the sources of visible light – sun, moon, fire –\nin diminishing order of brightness. Then he moves on to speech, by which\nwe can “see” in the sense we can orient ourselves and carry out actions\neven in darkness. Finally he comes to the Self. That Self, Reality, or the\ndivine ground of existence, does indeed exist in all things, or they would\nnot exist; but to discover it we must slowly learn to peel back layers of\nreality like an onion.\nThere is an endless variety of such hierarchies in the Upanishads, all with\na common pattern. They move from the inanimate world to some forms of\nconsciousness (seeing, speech) to consciousness itself, or from outer things\nto our awareness of things – or feelings, or thoughts – to our Self, the\nultimate witness. We are always being led back to that center from whatever\nperimeter to which the endless outward migrations of the mind have carried\nus.\nThis can be sometimes put, at least at first, in objective terms, because\nstacked up behind everything we perceive is the series of causes that\nbrought it into existence, beginning with the First Cause of phenomenal\nexistence itself (Katha I.3.10). At the heart of any apparently separate thing\nlurks its essence – its rasa, literally “sap” – that brought that thing into\nbeing. When we see the essence, the thing itself has served its purpose: in\nthe earthy language of the Upanishads, “the subtle eats the gross.”[17] The\nrasa of anything is subtler than it; it is its cause, its explanation, and the key\nto its significance; it is more real – more long-lasting – and the next step\ncloser to the ultimate reality beyond both the knower and the known.\n\fBut it is more illuminating to look at the theory in subjective terms.\nBehind the act lies the motive; the former in the world of material\ninteraction, the latter in the world of thought and desire. In one sense the\n“cause” of the light in my study is electricity; in a more important sense it is\nmy wish to have it there. If I fall asleep, there will be no “light” in the\nroom: it’s a participatory study, in this participatory universe.\nAll search for essences and for the ultimate relationship ends with Atman,\nthe Self. This concept is the glory of the Upanishads. The etymology of the\nword is not entirely certain, but most likely it is derived from an, “to\nbreathe,” and thus shares an important linguistic as well as philosophical\nconnection with prana. This richness of meaning is testimony to the very\nsimplicity of the concept. Atman just means “self”; in Sanskrit it was used\nas the reflexive pronoun. Yet so much is contained within that simple\nconcept: untold energy and devotion, the explanatory power of a scientific\nformula, the evocative power of poetry, and finally the sheer drama of the\ntremendous discovery made by the sages over and over again – one of the\nmost authoritatively verified hypotheses in the universe – that the Self is\nGod.\nThis Self cannot possibly be subject to any change, not even death. This\nis perhaps why belief in reincarnation died hard even in the West. It was a\ncherished belief not only in pagan but in various Jewish and Christian\ngroups in the early centuries of our era, but was brusquely rejected by the\nemerging orthodoxy and seems an unsettling and unverifiable hypothesis to\nmost of us today. Yet it differs only slightly, almost by a question of\nsemantics, from the modern concept of evolution, which holds that the\nindividual dies with the death of the physical body. Indian religious systems\nhold as a core belief that the individual is not that which dies: it is more\naccurate to think of ourselves as the forces which brought our body and\npersonality into existence – forces that will continue shaping our destiny\nbeyond what we call death, “as the wind takes on the fragrance from the\nflower” (Gita 15.8).\nThe ultimate Self, however, never entered into any of these processes but\nsomehow governs them all. It is neither that which dies nor those shaping\nforces, but the Witness of all this evolution. The Self is untouched by the\nturmoil of the world, “observing without partaking” (the two birds’ image),\na bulwark that sorrow cannot broach (Chandogya VIII.4.1–2). Only because\nwe think the Self is yoked to its temporary instruments, the body, mind, and\n\fsenses, do we think it enjoys or dislikes anything in one little corner of the\ncosmic process (Katha I.3.4). But it is present everywhere. The Self has\n“entered into everything like a razor fitted into its case” or (Augustine and\nSt. Teresa use the same image) into every creature “up to the nails”\n(Brihadaranyaka I.4.7). The Self alone has no essence, no cause, being the\ncause and essence of everything and everyone.\nOne might expect on the basis of such a revolutionary theory of being, or\nmetaphysics, an equally well-developed theory of our relationship to things\nand people and how, if we have happiness in view, we ought to behave\ntowards them. This expectation is not disappointed by the Upanishads, in\nwhich metaphysics and ethics are one.\nThe central value of Hinduism, declared in a formula known mostly from\nlater narrative literature, is ahimsa paramo dharma: “The highest religion,\nthe ultimate law of our being, is nonviolence.” This value is implicit, and\nsometimes explicit (Chandogya IV.17.4) in the Upanishadic teaching of\nunity. Before we explore it, however, let us look at a complementary\nteaching which is equally surprising and perhaps even less easily\nunderstood.\nOne of the critical “secrets” of the Upanishads is that renunciation is the\nopposite of deprivation. When the senses (indriyas) are untrained they run\nwild, leading to a state of conditioning that is the opposite of freedom\n(Katha I.2.5–6). Joy comes from putting these faculties back on track under\nthe guidance of the Self. This is precisely why the Upanishads teach\nrenunciation. Not only are joy and renunciation not contradictory; they\npositively require each other. Taken together they form the key value of\nHinduism, as Mahatma Gandhi taught when he took for his own mahavakya\nthose three opening words of the Isha Upanishad: tena tyaktena bhunjitah,\n“Renounce and enjoy.”\nIn the Gita, desire is referred to once as the rasa of objects, i.e., the\nobjects of sense experience (II.59, a verse which meant a very great deal to\nGandhi). Since a thing’s essence is more permanent than its material\nembodiment, it stands to reason that if we could somehow enjoy that\nessence directly, our enjoyment would be more permanent than sensory\ncontact with the thing itself. A sense of joy and happiness within is longerlasting than the sensation of pleasure, which is notoriously short-lived. One\nof the boldest treatments of this theory of satisfaction occurs in the Katha:\n\fThat through which one enjoys form, sound, smell, taste, touch, and\nsexual union is the Self. Can there be anything not known to one who is\nthe One in all? . . . That which enjoys the honey [rasa] from the flowers\nof the senses is the Self. (Katha II.1.3)\nWe lose nothing in this process; in St. Francis de Sales’s fortuitous\nimage, when the sun rises the light of a star does not go out, but “is ravished\ninto and absorbed in the sun’s sovereign light, within which it is happily\nmingled and allied.”[18] Nor do the senses or the body generally suffer\nwhen we control them voluntarily. Free from the popular misconception\nabout self-tormenting “yogis,” Upanishadic students pray, “May my senses\nwax clear and strong.” That is why they trained them.\nThis whole question is so important that I would like to make another\npass through this logic, as the Upanishads would, from a slightly different\npoint of view. If we could trace where a desire arises from – and the\nUpanishads do, repeatedly – we would find that in most cases something –\na thought, an external event – has stirred up some wisp of the vague sense\nof incompleteness we harbor beneath the floor of surface consciousness as\nlong as we are not identified with our Self. We immediately misinterpret\nthis stirring as a desire for something outside us. This is maya:\nmisinterpreting the longing for union within as a call from something\noutside the Self.\nThe Upanishads go a step further. When we have the sensation “I want\nsuch-and-such,” what we really mean is that we want the relative tranquility\nthat follows when that desire subsides. As a great sage of modern India, Sri\nRamana Maharshi, who was very close to the Upanishads in spirit, once\ndeclared, “There is no happiness in any object of the world.” The Self is\npure happiness, which we mistake as coming from outside; so the closer we\ncome to the Self within, the more we are aware of – the more we feel\nalready – what we were looking for outside us. This is what the Upanishads\nmean by joy. “Renunciation” refers simply to dropping the outside\nreflection for the reality which is within.\nFreedom is one of the most passionate concerns of the Upanishads, and a\nname of one of the oldest, Kaivalya.[19] But another Sanskrit word for\nfreedom, swaraj, appears in the Chandogya as well as the Kaivalya, and this\nword was the rallying cry Mahatma Gandhi used in the successful Indian\nstruggle for independence from British rule. Of course, what the\n\fUpanishads meant by swaraj was inner, personal freedom; but that is\nexactly what Gandhi meant by it too. “The word swaraj is a sacred word,”\nhe said, “a Vedic word, meaning self-rule and self-restraint, and not\nfreedom from all restraint which ‘independence’ often means.”\nIt is typical of the Upanishads’ approach to life not to check or negate\npassions but to channel them, reconnecting them with their original source\nin deeper consciousness. In Upanishadic psychology, the inner demand all\nhuman beings feel for freedom is ultimately a drive to free ourselves from\nthe inherited and acquired compulsions in our own psychic makeup. The\nUpanishads do not deny the need for political freedom; they simply claim\nthat inner freedom comes first, and is really the only reliable guarantee of\nall other forms. The more freedom one wins within, through control over\none’s own thoughts and passions, the less one will be manipulable by\nothers, and the more one will be able to seek political freedom – without\ngoing on to manipulate others oneself.\nThus we see that whereas the Upanishads were not nitishastra, textbooks\nof political counsel, they contained germs of profound richness for the\nalleviation of political and other relations. The imaginative setting of the\nUpanishads is a stable and perhaps idealized world of kings and brahmins\n(and birds and beasts, and gods), and the sages do not say much about how\nthat world, much less one like ours, should be organized. Yet their feelings\nabout those aspects of life also come through, sometimes in the most\nunexpected contexts. This passage is in the profoundly mystical eighth\nchapter of the Chandogya Upanishad:\nHere [in this world] people do what they are told, becoming dependent\non their country, or their piece of land, or the desires of another, so their\ndesires are not fulfilled and their works come to nothing, both in this\nworld and in the next\n. . . but those who leave here knowing who they are and what they truly\ndesire have freedom everywhere, both in this world and in the next.\n(Chandogya VIII.1.5–6)\nThis modern-sounding scorn for “doing what you are told” comes as a bit\nof a shock in this stable world presided over by religious, family, and royal\nauthority; but a closer look reveals that while the social structure of that\nworld is stable, the sages don’t hesitate to take this structure apart and show\n\fus where the underlying sources of authority are, or should be: more than\none proud brahmin has to take lessons from a king who turns out to enjoy\ndeeper spiritual experience (cp. Brihadaranyaka II.1.1–15); more than one\nteenager like Nachiketa pulls the wraps off a sham sacrifice or flings sham\nrewards back at the delighted king of death (cp. Katha). In this view\nfreedom and authority come together, like renunciation and joy. The truly\nfree man or woman is svamin, literally “in full possession of self.” He or\nshe exercises a spontaneous authority over others: not the authority that\ndebases others but that ennobles them, not the authority that distances but\nthat draws to intimacy, not the authority of birth or social advantage but of\nthe ability to forget oneself in the welfare of others, which anyone can\nlearn. “Real Swaraj will come,” Gandhi said, “not by the acquisition of\nauthority by a few, but by the acquisition of the capacity by all to resist\nauthority when it is abused.” Gandhi’s last phrase shows how he had\ninternalized the vision of the sages that in the ideal world, while there\nwould have to be authority of each over himself, there could also be\nstructures of authority among others, so long as these were exercised\nselflessly. The issue of authority is not, as often in our polarized world, yes\nor no, but what kind.\nThese basic principles lead naturally to two other “political”\nconsiderations, one of which we have touched on. Gandhi’s “discovery” of\nnonviolence was Upanishadic to the core. It was an innate response to the\nat-homeness in the world that breathes through every line of those texts.\nAnd we find some principles of nonviolence well articulated: If one is\nsocially or by personality weak with regard to another (that is, not yet\nsvamin oneself), one still need not be exploited: “for by dharma even the\nweak man can hope to prevail against a king” (Brihadaranyaka I.4.14, with\nShankara’s comment).[20] This dharma is nothing other than nonviolence;\nas we have seen, ahimsa paramo dharma, “There is no higher dharma than\nnonviolence.” It is a fact not to be glossed over that Gandhi, one small man,\nprevailed against the British Empire in the height of its historic majesty\nwith that secret. Can there be a secret more necessary to learn?\nWhile various thinkers today have remarked how modern physics seems\nto reflect the vision of the forest sages, few have noticed how another\nsignificant discovery of ours was long anticipated by them: the concept of\nunity in diversity. Originally popularized by Hegel, this mildly paradoxical\ntheme is becoming central in discussions of how a nation or even the world\n\fshould be organized, for a very simple reason: the world needs, as Richard\nFalk has put it, “the maximum degree of spontaneous solidarity.” But what\nkind of solidarity? A megagovernment? If this is to be world order, one may\nbe excused for preferring chaos. When he begins to specify the\nrequirements for true solidarity Professor Falk sounds almost Upanishadic:\nthe goal must be “the maintenance of living systems at all levels of\ncomplexity . . . the exploration of space and the planetary character of\neconomic, ecological, and cybernetic complexity are building the\nfoundations of an inevitable global consciousness.”[21] We want a new\nprinciple of political order which does not depend upon or induce\nuniformity among peoples, but which, tolerant of complexity, promotes the\nfullest unfolding of their individual potential – which happens to be a\ndefinition of nonviolence.[22]\nThe Upanishads of course specialize in diversity; in fact they revel in it\nas the essential character of life:\nHe is this boy, he is that girl, he is this man, he is that woman, and he is\nthis old man, too, tottering on his staff. His face is everywhere. He is the\nblue bird, he is the green bird with red eyes, he is the thundercloud, and\nhe is the seasons and the sea. (Shvetashvatara IV.3–4)\nBut the forest vision of life balances this love of diversity in living beings\nwith an unwavering focus on the unity which is life’s center.\nThe concept of dharma, though not as developed in the Upanishads as in\nthe narrative and sutra texts that followed, shows the same apparent tension\nbetween a universal Law unchanging in any time or circumstance – the\ndharma, properly speaking – and the less well known concept of\nsvadharma, each individual’s own law or way.[23] The Gita sternly\ndescribes how each must discover and earnestly follow his or her own path\nor perish spiritually: “competition in another’s dharma breeds fear and\ninsecurity” (Gita 3.35).\nIn the end, unity in diversity is not a paradox at all. Unity is the center –\nin Upanishadic terms, “in the cave of the heart” – of conscious beings,\nwhile diversity flourishes on the surface of life. It is as necessary to foster\ndiversity there at the outside as it is to hold unity on the inside. Gandhi\nmade this notion of inside and outside concrete for us: there must be “heart\nunity” among all, meaning spontaneous concern for the welfare of others,\n\fand that very concern must lead to complete toleration of natural\ndifferences and even differences of wealth and station (which did not please\nhis Marxist critics) as long as they are not abused. Class, family, and\nregional groupings are a sort of bridge between the unity toward which all\nmust be allowed to work and the individuality from which we start. The\nmore the heart can be opened in spontaneous concern for the other, the less\nof an obstacle and more of a vehicle for social coherence – and in the end\nspiritual unity – intermediate unities become.[24]\nUnity in diversity formed the cornerstone of India’s national\nconsciousness from ages past; it may yet form her contribution to a global\nconsciousness which, as S. Radhakrishnan has said, the world has no choice\nbut to develop.",
            "THE CURVE OF HISTORY": "Since the discovery of the Upanishads by the West, not a few Westerners\nhave gone to them as a source of the “perennial philosophy,” a fascinating\nwitness to an ancient civilization and its unique religious system; others,\nlike Yeats, have been drawn by their poetic beauty. But the first Western\nphilosopher to stumble on them, Arthur Schopenhauer, was looking for\nmuch, much more. And they did not disappoint him. In his oft-quoted\nwords: “They have been the consolation of my life, and will be the\nconsolation of my death.”[25]\nIt is not hard to appreciate his reaction. One of the closing statements in\nthe first book of the Chandogya reads, “Whoever meditates and gains this\nwisdom here in this life lives at his highest and his best” (I.9.4), and\nShankara comments, “People may think, ‘Though such rewards might have\naccrued for the blessed ancients, they cannot be possible for people in this\nage.’ The text proceeds to set aside this notion.”\nWe too can set aside the notion that the Upanishads are irrelevant\ncuriosities. Because of the intense problems of our times, problems that\nseem to be created by specifically modern conditions, we naturally tend to\nthink we have broken the thread of history: Shankara did not have to face\necological degradation, terrorism, and nuclear war. But these problems arise\nfrom unresolved human difficulties that have been the same throughout\nrecorded history. Ecological degradation is ultimately caused by human\ngreed, as greed and alienation lie behind all forms of crime; war arises, as\nthe UNESCO constitution says, “in the minds of men,” and persists when\n\fmen and women shrink from the age-old task of learning to resolve their\nconflicts. Whether we live in a forest ashram or in downtown Los Angeles,\nthe job of being human means learning to convert our inherited tendencies\nfrom problems into positive forces. Ours is not therefore a predicament on\nwhich the experience of the past falls silent.\nSchopenhauer predicted that others would soon react to the Upanishads\nas he had; that, in fact, the sole advantage his own enlightened century\ncould claim over the benighted seventeenth would be its possession of those\nwonderful documents, which would cause a revolution in human\ncivilization. In this, it would appear, the old pessimist was wrong. The\nnineteenth century and the twentieth have come and gone, and have brought\nneither enlightenment nor even – unless we are beginning to see it just now\n– the kind of open-mindedness Schopenhauer could have toward the\nachievements of a very different culture.\nIt is not that there has never been mysticism in the West. In fact, when\nthe Western experiment with rationalism and scientific thinking began more\nthan twenty-five hundred years ago and Greek thinkers, mainly in Asia\nMinor, struggled to free themselves from the mental universe of myth and\nsymbol, the paradigm or system of thought they came up with was very like\nthat of their Indian counterparts who had laid the basis of the Vedanta some\ncenturies earlier. One thinks particularly of Heraclitus of Ephesus (ca. 540–\n475 B.C.). We remember Heraclitus for the saying “all is in flux,” but he\nwas much more excited about his discovery that underneath the flux of the\nphenomenal world exists aiezoon pyr, “everliving fire” (probably a symbol\nof consciousness, for which the Greeks had as yet had no single term),\nwhich ordinary human beings do not perceive but to which they owe such\nknowledge as they possess. This living fire that becomes all things reminds\nus forcibly of prana.\nIn a supremely important fragment Heraclitus declares, “You may search\nthe limits of the soul without ever finding them, go down any road you will;\nsuch a profound reality it has” (Fr. 45). It would not be unfair to suggest\nthat we have taken the scientific worldview he made possible to its very\nlimits in the opposite direction: happiness is caused by endorphans, mother\nlove is programmed by genes and triggered by chemicals; a full-page ad in\nmy university’s magazine recently boasted a picture of a chromosome with\nthe heading, “This is your life.” The soul has so shrunken from view that far\nfrom standing awestruck by its infinitude we have difficulty remembering\n\fthat it exists: indeed, why speak of soul; mind or consciousness play no role\nin the electrochemical image of the human being which popular\nimagination and some scientists today present unchallenged.\nBut the time has come to challenge them. It is curious to look back from\nthis vantage point and observe that the similarities between the founders of\nWestern thought and the scientist-sages of the forest are so striking that\nfrom time to time Western scholars keep trying to find out whether the latter\nsomehow influenced these “Ionian physicists” who awakened Western\nphilosophy and science in the generation before Socrates directly.[26] Such\nan influence would not be unlikely. Yet at no time has the “Upanishadic”\nvision of a Heraclitus or an Augustine really become our own. Here the\nUpanishads challenge us to put in place fundamentally different concepts of\nwho we are, and to build a life of thoughts, of personal habits, of lifestyle,\nof relationships, of institutions and values, and finally even of foreign\npolicy based on the unity of consciousness rather than on the separateness\nof biochemical fragments.\nCultural and historical prejudices are loosening now, and that may mean\nwe have an unparalleled opportunity to forge the kind of shift in paradigm\nwe need to survive and grow as a united world – and perhaps Schopenhauer\nafter all had seen this coming. In the full text of his oft-quoted remarks on\nthe Upanishads we meet a bit of a surprise:\nFrom every sentence deep original and sublime thoughts arise, and the\nwhole is pervaded by a high and holy and earnest spirit. In the whole\nworld . . . there is no study . . . so beneficial and so elevating as that of\nthe Upanishads. They are destined sooner or later to become the faith of\nthe people.[27]\nSchopenhauer foresaw not one but two major revolutions: first, that the\nbarrier between East and West would fall, permitting a more helpful crosscultural borrowing than had ever been the case – which, as I say, we are\nalready beginning to see happen. But second, and even more daring, he\npredicted that a profound, visionary way of seeing, willing, and seeking\nfulfillment will become not just the thought-experiment of philosophers, as\nhad happened at the beginning of Western scientific history, but “the faith\nof the people.”\n\fOf all the sources of India’s vision, Schopenhauer was drawn by unerring\ninstinct to the Upanishads. He was trying to draw our attention not to\nHinduism or India, but to a habit of looking beneath the surface of life to its\nunderlying causes, to an at-homeness in the world with its infinite variety of\ncreatures and natural beauty – our home and the only laboratory of our\ndestiny – to tremendous insights into the nature of power, to a plan for\nworld unity that seems to be embedded in every particle of reality, to a\nreminder that, as the Maitri Upanishad states, “One becomes like that which\nis in one’s mind – this is the everlasting secret”;[28] and most of all to the\ncourage to discover in ourselves a higher image of the human being. These\nare the gifts and the challenge of the Upanishads."
        }
    }
}